{"cat":"Properties Layer 1","title":"👪decentralized-censorship-resistant-ungovernable-incorruptible-trustless-unconfiscatable-updatable","desc":"DECENTRALIZATION There are three main reasons that Bitcoin is decentralized. One is that there is no person, group, or central authority in charge of...","msgs":[{"text":"<b>DECENTRALIZATION</b>\nThere are three main reasons that Bitcoin is decentralized. One is that there is no person, group, or central authority in charge of Bitcoin. There is no Bitcoin CEO or Bitcoin board of directors or head of marketing. No one can decide to mint more than the max supply of Bitcoin. Everyone has to follow the rules set forth by math and the code. The second reason Bitcoin is decentralized is because it is composed of a network of users who run Bitcoin nodes all over the world. See <#874331220618670120> for more information about how Bitcoin is decentralized in that regard. Thirdly, Bitcoin <#874331239081975929> is decentralized. While most mining occurs in the United States and Kazakhstan, there is hashing power coming from most countries in the world.\n\nThere is an additional take on decentralization. Bitcoin being decentralized means that it has removed intermediaries. Transactions can be made peer-to-peer without having to trust a third party. Additionally, Bitcoin doesn't have any gatekeepers who can control what you do with your money and to who and why you send money somewhere.\n\n<b>TRUSTLESS</b>\nThe major concept inherent in a decentralized network like Bitcoin is that it is a functional system operating on a *trustless* manor. Nobody transacting with Bitcoin has to trust a third party like a bank to ensure that their transaction is valid; this is the innovation that Bitcoin has unleashed. The system is fully transparent and can be audited by anyone at any time."},{"text":"<b>CENSORSHIP RESISTANT/UNGOVERNABLE/INCORRUPTIBLE</b>\nThere is no CEO or president of Bitcoin. No one is in charge of Bitcoin, and therefore there is no counterparty risk to deal with. There is no one person or group to bribe, arrest, or kill to stop Bitcoin. Bitcoin is not a company, it is a protocol and network with a set of rules (math and code) without rulers. Everyone participating on the Bitcoin network must follow the rules. No central authority or government body or banker is needed to process transactions. With all these underpinnings in mind, Bitcoin is also resistant to *corruption*. This inexorably human element is removed from the equation. This is the first time in human history that such a process was made possible!\n\n<b>UNCONFISCATABLE</b>\nBitcoin itself is literally and factually unconfiscatable because it's stored decentrally, hash-proofed on the blockchain. To access it, you need information which is your seed/private keys. How you store that information is up to you - it can be digital (not recommended), physical or only in your memory, or a combination. That's the difference between bitcoin and physical goods which can be confiscated and fiat which can be seized. For more on best practices when it comes to storing your bitcoin, see <#874598050675433542>."},{"text":"<b>UPDATING THE CODE/STRUCTURED GOVERNANCE CONSENSUS</b>\nDecisions to change or update the Bitcoin Core code require a deep consensus from members of the network. There is a process that starts with a Bitcoin Improvement Proposal (BIP). For one very particular Taproot activation method, after the BIP reached a certain stage, it still needed to be approved by 95% of the last 2,016 miners (previous 14 or so days) in order to be officially implemented into the code. More details can be found here: https://galea.medium.com/bitcoin-development-who-can-change-the-core-protocol-478b8ac5fe43\nThe Bitcoin Core development team has said that it will typically require a super-majority of 95% percent of hash power to agree on soft forks - https://bitcoinmagazine.com/.amp/technical/why-some-changes-to-bitcoin-require-consensus-bitcoin-s-layers-1456512578#amp_tf=From%20%251%24s&aoh=16432950474149&referrer=https%3A%2F%2Fwww.google.com","link":"https://galea.medium.com/bitcoin-development-who-can-change-the-core-protocol-478b8ac5fe43"},{"text":"In general, no one in particular controls the Bitcoin Core code. It’s practically impossible to fully comprehend Bitcoin as a system. The definition (control) of Bitcoin the protocol is like the definition of a language. Languages emerge spontaneously; the consensus over the meaning of words is organic rather than dictated by dictionaries. Much as dictionaries describe the phenomenon of a language rather than define it, so do Bitcoin implementations describe the language of Bitcoin with code. No one is forced to agree with the definition of a given word in a dictionary, neither are they forced to agree with code in a given Bitcoin implementation by running it. When a piece of code gets pushed through and implemented in the protocol, the node users running the code do not have to update their code if they don't want to. Anyone can still run Bitcoin on the old rules, if he/she wants.\n\nFor more on how the Bitcoin Core code is governed, see: https://blog.lopp.net/who-controls-bitcoin-core-/","link":"https://blog.lopp.net/who-controls-bitcoin-core-/"},{"text":"https://twitter.com/parman_the/status/1505795787242242050?t=_iauVtoyIAVrQl85GnYKAQ&s=19","link":"https://twitter.com/parman_the/status/1505795787242242050?t=_iauVtoyIAVrQl85GnYKAQ&s=19"},{"text":"https://bitcoinmagazine.com/tags/decentralization","link":"https://bitcoinmagazine.com/tags/decentralization"},{"text":"Decentalization\nhttps://twitter.com/BitcoinMagEDU/status/1569412306638864384?t=Lk095wI4oIuD_INg1YqFqQ&s=19","link":"https://twitter.com/BitcoinMagEDU/status/1569412306638864384?t=Lk095wI4oIuD_INg1YqFqQ&s=19"},{"text":"Decentralization","imgs":["images/properties/decentralized_decentralization.png"]}]}