{"cat": "Properties Layer 1", "title": "🏆dominant-recognizable-brand-legitimate-limitless-infinite-exponential-transformative-revolutionary", "desc": "<i>under construction</i>  DOMINANT/RECOGNIZABLE BRAND The top 10 cryptocurrencies have traded hands many times since 2009...all except spot #1. Bitcoin...", "msgs": [{"text": "<i>under construction</i>\n\n<b>DOMINANT/RECOGNIZABLE BRAND</b>\nThe top 10 cryptocurrencies have traded hands many times since 2009...all except spot #1. Bitcoin has a head start, and by now, everyone in the world has at least heard of Bitcoin. Nothing will catch it or replace it.\nFor more on branding: https://bitcoinmagazine.com/culture/bitcoin-and-the-most-valuable-brands", "link": "https://bitcoinmagazine.com/culture/bitcoin-and-the-most-valuable-brands"}, {"text": "<b>LEGITIMATE</b>\nBitcoin's code is public and has been audited probably tens of thousands of times. The developers are very careful when they make changes. Everything is thoroughly tested.\nAdditionally, Bitcoin's monetary policy is very clear. Bitcoin is scarce, sound money. There are no false promises. Bitcoin doesn't need a marketing team or budget. The principles speak for themselves."}, {"text": "<b>LIMITLESS</b>\nWhile Bitcoin's supply is capped, the potential of Bitcoin is limitless. Everything that is advertised and being developed on other coins that is important will be built on top of Bitcoin. Bitcoin scales exceptionally."}, {"text": "<b>INFINITE</b>\nYou've probably seen ∞/21 million before (infinity divided by 21 million). What this means is that all of the world's wealth (hundreds of trillions of dollars) will eventually funnel into Bitcoin. The process is already underway."}, {"text": "<b>EXPONENTIAL</b>\nBitcoin's growth is exponential and will resemble a J shaped curve."}, {"text": "<b>TRANSFORMATIVE</b>\nYou don't find Bitcoin, Bitcoin finds you. Bitcoin changes you. It lowers your time preference, meaning it makes you think about having a good future as opposed to mindlessly consuming in the present. Studying Bitcoin takes you down the rabbit hole of economics, policy making, national relations, governments, history, math, cryptography, game theory, privacy, and much more. Not to mention Bitcoin teaches you about patience and compassion."}, {"text": "<b>REVOLUTIONARY</b>\nWe are fixing a 10,000 year old problem that has always plagued humans. We are fixing money. Bitcoin removes the human element that always leads to corruption. Bitcoin is a revolution."}]}