{"cat": "Properties Layer 1", "title": "💰money-deflationary-salable-durable-anti-fragile-divisible-portable-transmittable-verifiable-fair", "desc": "MONEY Money is the token or representation of value. It was created after the system of barter became inefficient (because how many chickens does one...", "msgs": [{"text": "<b>MONEY</b>\nMoney is the token or representation of value. It was created after the system of barter became inefficient (because how many chickens does one barrel of rice cost?). There are the key features that define money and the properties of Bitcoin that fit the mold: durability (Bitcoin can't be destroyed unless you forget your password/keys), portability (Bitcoin is digital, it has no weight and can be transported anywhere in the world very quickly at little cost), divisibility (see below), fungibility/uniformity (1 Bitcoin = 1 Bitcoin no matter where you are and when you transact with it), limited supply (21 million coin limit) and general acceptability/recognizability as a payment method. Bitcoin inherently has all of these features except general acceptability as a payment method. However, this will come when Bitcoin is more widely adopted over time.\n\nIn order to become actual money used by everyone, Bitcoin needs to experience and go through three stages: store of value, medium of exchange, and unit of account. A detailed look at these properties can be found in the book, \"The Bitcoin Standard,\" linked in . \n\n<b>DEFLATIONARY/STORE OF VALUE (SAVING)</b>\nThere will only ever be 21 million bitcoin. The price in dollars is literally programed to go up (\"number-go-up (NGU) technology). Right now, Bitcoin is a solid store of value. Many people, including myself, view their Bitcoin stacks as a savings account. What makes something a store of value is that it is able to hold its value over time. The main reason that Bitcoin is a great store of value is that Bitcoin has a supply limit. The main reason that the price keeps rising so quickly is because Bitcoin's issuance is slowing deflating (half as many new coins are minted about every 4 years). This is a very basic concept of supply and demand on steroids. This is also why Bitcoin can be described as \"hard money.\" Bitcoin's money supply can't be inflated."}, {"text": "As bitcoin gets readily adopted over time and demand goes up while its liquid supply decreases as issuance goes down and more and more people decide to hold their bitcoin long term, the price will keep going up until (seemingly) all of the world's wealth is in bitcoin.\n\n<b>MEDIUM OF EXCHANGE (PAYING)</b>\nBitcoin is working its way as being a medium of exchange. Some stores and services accept Bitcoin as payment. Some employers pay their employees in Bitcoin. Some NFL players receive part of their salary in bitcoin. There are Bitcoin ATMs all around the world. Apps like Fold and Lolli exist as a workaround of the current fiat system to transact in bitcoin. Internationally, underprivileged families collect remittance payments in bitcoin to save on horrible fees from Western Union.\n\n<b>UNIT OF ACCOUNT (PRICING)</b>\nAs for unit of account, that's when goods are priced in bitcoin. We are a ways off from this, but when it happens, we will be knee deep in hyperbitcoinization.\n\n<b>SALABILITY</b>\nMarket participants converge upon the most salable commodity over time, through many transactions. Eventually, the good that is most widely accepted and best maintains value over time will become money. Bitcoin is being more widely adopted everyday. It is emerging as the most salable money.\n\n<b>DURABILITY/ANTI-FRAGILITY</b>\nBitcoins, having no issuing authority, may be considered durable so long as the network that secures them remains in place. Although Bitcoin is still in its infancy, we can draw a pretty strong conclusion that it is durable. There are encouraging signs that the network displays a remarkable degree of “anti-fragility” meaning it can't be stopped, tampered with, disturbed or interrupted in any way.\n\n<b>DIVISIBILITY</b>\n1 bitcoin = 100,000,000 satoshis (units)\n1 satoshi = 0.00000001 bitcoin\nThe Bitcoin code also will allow further divisibility (more decimal places) if need be in the future but may require a hardfork (unconfirmed)."}, {"text": "<b>BITCOIN PAYMENTS</b>\nA simple way to explain how Bitcoin payments work is to compare it to email. Anyone with your email can send you an email in the same way that anyone with your Bitcoin address can send you Bitcoin. Anyone with an internet connection can send any amount of bitcoin to anyone else in any part of the world at any time. However, you don't have to online and present at the exact moment someone sends you bitcoin. Just like with email, the only way for you to send an email is if you have access to your email with a password. Your password for your bitcoin is what is known as your private keys. Never tell your private keys to anyone. Never store them on the internet or take a picture of them. Write them down and store it in a safe (preferably fireproof) or use another method of storing your keys mentioned in .\n\n<b>PORTABLE/TRANSMITTABLE</b>\nAny amount of Bitcoin can be sent person to person (peer-to-peer) anywhere in the world at any time very quickly and for low fees as long as you have an internet connection. \n\n<b>VERIFIABLE</b>\nBitcoin's Blockchain is public. Anyone can audit it and verify transactions at any time with a block explorer tool such as https://www.blockchain.com/explorer. See to learn more about how all bitcoin transactions are verifiable.\n\n<b>SETTLEMENT</b>\nBitcoin transactions on the base layer are finalized within an hour (when 3+ blocks are confirmed on the network). Lightning transactions are settled immediately without need of confirmation from the base layer. See for more information. Bitcoin is the first digital bearer instrument, meaning credit risk is not an inherent concept within the Bitcoin ecosystem. More on bearer instruments: https://www.investopedia.com/terms/b/bearer-instrument.asp#:~:text=A%20bearer%20instrument%20is%20a,entitled%20to%20the%20coupon%20payments.", "link": "https://www.blockchain.com/explorer."}, {"text": "<b>FAIR</b>\nThere are a few reasons why Bitcoin is fair. First of all, the way it came into existence and was distributed is fair. There was no premine, no opportunity to purchase a large supply of the coins before anyone else has access. This is what most of these new altcoins, such as Ethereum, do.\n\nThe second part of Bitcoin that is fair is that everyone has access to it. If you provide value to the world, you can purchase some Bitcoin in return for your work. The same will be true when Bitcoin fully replaces fiat as currency. People will be paid in Bitcoin directly for their work."}]}