{"cat": "Properties Layer 1", "title": "☮peaceful-neutral-voluntary-open-universal-permissionless-borderless-global-inevitable-unstoppable", "desc": "<i>under construction</i> PEACEFUL/NEUTRAL/VOLUNTARY/OPEN/UNIVERSAL/PERMISSIONLESS/BORDERLESS/GLOBAL No one will force you to use Bitcoin. You can choose...", "msgs": [{"text": "<i>under construction</i> <b>PEACEFUL/NEUTRAL/VOLUNTARY/OPEN/UNIVERSAL/PERMISSIONLESS/BORDERLESS/GLOBAL</b> No one will force you to use Bitcoin. You can choose to opt-in if you want. You don't need permission or special access to transact or develop on the Bitcoin network. There are no gatekeepers preventing you from doing something. It is open to everyone, and the code is open-source, meaning it us public and can be audited/verified by anyone. Bitcoin is FOSS (free open-source software). You don't have to provide proof of your identity, your name, address or anything specific to use Bitcoin. It is peer-to-peer, borderless, transnational, indiscriminate, inclusive, and radically neutral. There are no barriers for entry. On some levels, you don't even need to provide any identification (at the very least, transacting in Bitcoin is pseudonymous). However, Bitcoin it is not forced on anyone. It is opt-in. In addition, the software (code) is open-source (public) and therefore auditable. Anyone can develop programs/applications on the Bitcoin network for free, and without permission (see the Bitcoin GitHub The people who can use Bitcoin are not held within any borders like fiat currency does around the world. Bitcoin is borderless. Bitcoin is money no matter where you are in the world. Many citizens of authoritarian counties have to flee their homeland because their government is forcing them to use their debasing currency. Bitcoin is a way out of the broken, oppressive system. Bitcoin is a purely voluntary system with no gatekeepers. No one is forced to use Bitcoin. Bitcoin is open-source; its design is public, it is usable by anyone/anywhere/anytime. Developers can freely program applications on top of the Bitcoin protocol without having to ask anyone for permission.", "link": "https://discord.com/channels/874318808423219280/874319558641610802/875008087856148511)"}, {"text": "<b>INEVITABLE/UNSTOPPABLE</b>\nWhen China banned Bitcoin (again and again over the years), Bitcoin just moves. When Bitcoin exchanges get banned, they move offshore. When citizens aren't allowed to invest in Bitcoin, they start buying Bitcoin with stablecoins. When Bitcoin mining gets banned, the miners move. To shut down Bitcoin, you have to shut down all 14,000+ computers (nodes) spread across the entire world. There even satellite nodes that run Bitcoin now. The governments of the world would have to band together and shut down the entire internet worldwide at the exact same time. They'd have to locate all 14,000+ nodes, shut them down, and make sure they never turn them on again. This is basically impossible at this point."}]}