{"cat": "Properties Layer 1", "title": "🍀scarce-unforgeable-hedge-scalable-p2p-instant-open-source-auditable-inaliable", "desc": "SCARCITY/ UNFORGEABILITY Bitcoin's supply is limited, which makes it different than fiat currency like USD and other cryptocurrencies like Ethereum....", "msgs": [{"text": "<b>SCARCITY/ UNFORGEABILITY</b> Bitcoin's supply is limited, which makes it different than fiat currency like USD and other cryptocurrencies like Ethereum. There will only ever be 21,000,000* Bitcoin. So far, 19.1 million have been mined. Additionally, 2-3 million coins are actually either lost due to lost or forgotten passwords or seemingly locked away forever (approximately 1 million of those coins are in the creator Satoshi's wallet and haven't moved from it since 2012). Because of the supply limit, Bitcoin is scarce and therefore is also known as a trophy asset (something like real estate or a rare collectible). What makes something scarce is its unforgeable costliness meaning it’s sufficiently hard to produce and hard to fake the production cost of. In other words, easy to verify the validity of. Bitcoin is both of these things do to Proof-of-Work. * *Technically, the maximum supply of Bitcoin is actually 20,999,999.9769 because the supply issuance is asymptotic (it's cut in half ~every 4 years). People say 21 million for convenience because it's easier to note/market.* <b>HEDGE AGAINST INFLATION</b> Bitcoin is deflationary and a hedge against inflation because its supply can't be increased. Every 4 years, the amount of Bitcoin that gets minted gets cut in half. This, of course, increased Bitcoin's demand and thus correlates with a rise in price! Because of this, you might also hear that Bitcoin implements NGU (number to up) technology 😉. Fiat currency, on the other hand, is subject to massive inflation that will eventually result in hyperinflation due to the Federal Reserve's constant printing of money. The value of any good will trend to its marginal cost to produce. This is true about everything from toilet paper to cars. The marginal cost to produce fiat money is ZERO (the Fed can print trillions of dollars for no cost at the press of a button).", "link": "https://discord.com/channels/874318808423219280/874319602811801670/874986213944201287)."}, {"text": "<b>SCALABILITY</b>\nYou might have heard that Bitcoin can only process only upwards of 7 transactions per second. This is somewhat true, but only about Bitcoin's base layer. See for Bitcoin's solution to this problem.\n\n<b>PEER-TO-PEER (P2P)/ INSTANT</b>\nBitcoin provides direct person to person instant, final settlement anywhere in the world at any time."}, {"text": "<b>OPEN SOURCE/AUDITABLE</b>\nBitcoin's code is open sourced meaning it is public and fully auditable by anyone. Anyone can propose changes or updates through \"Bitcoin Improvement Protocols\" or BIPs.\n\n<b>INALIENABLE</b>\nNo one can take away your Bitcoin from you."}, {"text": "Thread on scarcity\nhttps://twitter.com/real_vijay/status/1032509404409548800?t=HNw3SR0m98Jj07mo-zaB8g&s=19", "link": "https://twitter.com/real_vijay/status/1032509404409548800?t=HNw3SR0m98Jj07mo-zaB8g&s=19"}]}