{"cat":"Properties Layer 1","title":"™secure-fungible-immutable-incorruptible-immalleable-infallible-reliable-predictable-irreplicable","desc":"How Bitcoin's network security makes it virtually impossible to hack — protected by more computing power than anything on Earth.","msgs":[{"text":"<b>SECURITY</b>\nIt is quite impossible to hack the Bitcoin network. Bitcoin is a honeypot of over $800 billion and has been under attack every hour of every day since gaining significant value around 2013. Every day that passes, Bitcoin's security gets stronger. This is because more and more computers join the network as both nodes and miners. \n\n<b>BITCOIN CAN'T BE HACKED</b>\nI will look for the source that described how hard it would be to actually try to hack the Bitcoin network (I think it was from an Andreas lecture...). Bitcoin is practically unforgeable. In order to attack/hack it, you would have to alter the Bitcoin Blockchain. It is very difficult to write new history to the Blockchain because it is so costly to forge it while there are always low costs to validate it. Andreas stated something along the lines of in order to rewrite (and hack) the Bitcoin blockchain, the hackers would have to gain 51% of the mining power (\"51% attack\") for roughly 2 or so weeks and risk billions upon billions of dollars doing so trying to forge the Blockchain. It is a great risk for the hackers because if the number of miners \"hacking\" drops below 51% at any point during the hack, the hack fails and every bad miner just wasted tons of resources for nothing...let alone they didn't earn any real Bitcoin from the mining they would have been doing if they weren't trying to hack fake Bitcoin. To put this into perspective on how hard it would be to get 51% of the mining network on your side: if Google decided to program all their servers and supercomputers to mine Bitcoin, they would only make up less than 1% of the total network\n\nAgain, I need to find this lecture because he explains it much better than that."},{"text":"The private keys for your Bitcoin wallet (your seed phrase) is also quite impossible to hack by brute force. This video will show you just how secure and how difficult to guess your private keys are: https://www.youtube.com/watch?v=S9JGmA5_unY. There are 2^160 potential Bitcoin wallets, which renders attacks on the network pointless. To put things into perspective, there are “only” 2^63 grains of sand on Earth. For more written about why Bitcoin (the network) can't be hacked and why your own bitcoin can't be hacked, <b>FUNGIBLE</b> Bitcoins are fungible at the network level, meaning that every bitcoin, when transmitted, is treated the same on the Bitcoin network. Bitcoin is interchangeable with other bitcoin. Bitcoin is also immutable. What this means is it is impossible for any entity to manipulate, replace, falsify or reverse data stored on the network. Bitcoin solved the \"double spend\" problem. No one can falsify or replicate any transaction. Adam Back on fungibility https://youtu.be/AvS3tp0qqgA","link":"https://www.youtube.com/watch?v=S9JGmA5_unY."},{"text":"<b>IMMUTABILITY/INCORRUPTIBILITY</b>\nBitcoin is immutable in that its monetary policy is set in stone and it can not be changed. This was made possible for three main reasons: 1) Bitcoin didn't have a premine. 2) There is no official foundation behind Bitcoin. 3) The founder (Satoshi) stepped down. \n\nImmutability is dependent on having a currency that is native to it, like Bitcoin. There is this idea that Bitcoin is really good at two things- It is good at currency issuance and currency settlement. It is a closed loop system that does not know anything else about the outside world; it doesn't need to know anything else. What Bitcoin does very well is it knows with 100% certainty what is and what isn't Bitcoin. In doing that, and in order to incentivize the security mechanism to ensure that an invalid transaction will not be validated, the Blockchain needs to pay for Bitcoin's security. It needs to pay for it in a way that can be a closed loop system that only knows how to validate Bitcoin. Bitcoin, the currency, wouldn't be valuable without its Blockchain, but its Blockchain wouldn't be viable, relevant, and valid without its property of immutability. The Blockchain needs its own native currency (Bitcoin) to pay for the security (through transaction verifications) it receives from miners, a process that happens every new block every 10 minutes (mining reward) as well as with transaction fees.\n\nMore of immutability by Andreas: https://www.youtube.com/watch?v=h1SHF3YPrjM\n\n<b>IMMALEABLE</b>\nBitcoin uses energy through proof-of-work to build an uneditable (immalleable) record of all the Bitcoins in existence and who owns them. The blockchain (leger) is permanent history.","link":"https://www.youtube.com/watch?v=h1SHF3YPrjM"},{"text":"<b>INFALLIBLE/RELIABLE</b>\nThe protocol that fuel Bitcoin is apparently infallible. Even if we can never exclude the idea that a flaw may one day be found, this scenario is unlikely as the code has been peer reviewed by hundreds of thousands of coders including the world's brightest. Cryptography that protects Bitcoin also has protected banks for many years, and Bitcoin has already withstood many forms of attack. Bitcoin is a honeypot of almost $1 trillion. It is constantly being attacked. Each day that Bitcoin survives these attacks, it gets stronger. Bitcoin is battle hardened to the max! If Bitcoin should encounter difficulties, they are much more likely to be caused by the way it is perceived and used than because of a programming fault. Additionally, Bitcoin has a 99.987% uptime (https://www.buybitcoinworldwide.com/bitcoin-uptime/).","link":"https://www.buybitcoinworldwide.com/bitcoin-uptime/)."},{"text":"<b>PREDICTABLE</b>\nThe supply issuance of Bitcoin is known in advance; it is written in the code of the protocol. The supply issuance gets cut in half every 4 years. Currently, 6.25 bitcoin get minted about every 10 minutes. In 2024, 3.125 bitcoin will get minted about every 10 minutes. Additionally, the supply cap is known. There will only ever be 21 million bitcoin, and no one can print more Bitcoin. There are no secrets or gatekeepers involved in Bitcoin."},{"text":"<b>IRREPLICABLE</b>\nBitcoin is impossible to be replicated. It can be copied, as it has been thousands of times with forks and altcoins, but it's immaculate conception and rise from collectible to an asset/money can not be replicated. You can't rediscover/reinvent digital scarcity. It is a one time discovery/invention."}]}