{"cat":"Properties Layer 1","title":"✔use-cases","desc":"Real-world uses for Bitcoin: savings, payments, remittances, store of value, and more.","msgs":[{"text":"Bitcoin is money. A better money than anything used in all of human history. Bitcoin is better at being gold than gold. Bitcoin is better at being fiat than fiat.\nGold is really good at transporting value over time. Fiat is really good at transporting value over space. Bitcoin is good at both of these things.\nBitcoin protects you from inflation caused by infinite money printing by central bankers. You and your family's wealth can be preserved in Bitcoin. Bitcoin is a savings technology.\n\nBitcoin has a sound monetary policy that is very difficult to change (this is a good thing). No single person or group of people can change the rules. No one has the right or power to decide to print more Bitcoin and increase the supply. \n\nAdditionally, Bitcoin is secure and decentralized. There are enough miners protecting the network to withstand state level attacks. No other coin has this going for it. There are also over 14,000 Bitcoin nodes enforcing the protocol's set of rules (code). If someone wanted to shut down Bitcoin, they'd have to turn off every single internet connection throughout the entire world at the exact same time or they'd have to destroy all 14,000+ computers running Bitcoin dispersed across the world."},{"text":"With Bitcoin, you are able to transact with anyone, anytime, in any amount, person-to-person with no intermediary bank or government. There is nobody necessary to process or approve your transactions and nobody in the way to delay or deny your transactions."},{"text":"Remittance transfers using apps like Twitter, Strike, and the Lighting Network have much cheaper fees than traditional avenues like Western Union.\n\nAdditionally, Bitcoin can be used:\n- international p2p payments (tips, direct payment for services/products)\n- transfer of personal wealth across borders"},{"text":"Equipped with only a cell phone and an internet connection, Bitcoin enables you to be your own banker. There is no need anymore for anyone to have a traditional bank account. In fact, billions of unbanked citizens across the world will leap frog traditional banking with Bitcoin. Kids born today likely will never have a traditional bank account. You can store your own wealth in Bitcoin and secure it yourself without any counter party risk."},{"text":"Bitcoin mining promotes renewable energy usage and also makes use of otherwise wasted energy. It turns wasted energy into wealth. Bitcoin solves the problem of channeling (moving) energy geographically to where it's needed most. Before Bitcoin, energy needed to be moved to where humans lived. With Bitcoin mining, energy can be channeled and monetized anywhere, even in remote areas where people don't reside. This is creating more jobs and more wealth for everyone which will boost the economy."},{"text":"Specific use cases by country listed in this thread:\nhttps://twitter.com/skwp/status/1335627973915971592?t=4_mrKwGEFCLwL5RgVUfqKw&s=19","link":"https://twitter.com/skwp/status/1335627973915971592?t=4_mrKwGEFCLwL5RgVUfqKw&s=19"},{"text":"","imgs":["images/properties/use-cases_21_reasons_bitcoin_will_save_the_world.jpg"]},{"text":"<b>21 REASONS BITCOIN WILL SAVE THE WORLD (outlined by the members of this server)</b>\n1. Self sovereignty. Take control of your savings. Take control of your future.\n2. Censorship resistance. No government, bank or person stands between you and your money.\n3. Remittance payments with little to no fees\n4. Code is law. Everyone follows the same rules, enforced by math and code\n5. Immutability. It is impossible for any entity to manipulate, replace, falsify or reverse data stored on the network. Bitcoin's blockchain is permanent history.\n6. Decrease the wealth gap/level the playing field\n7. Reduction in violence/potential for war by making the Petro dollar insignificant \n8. Bitcoin removes the human element of tampering with money and it's supply which inevitably leads to the corruption & debasement of money that has plagued civilization for 10,000 years of existing monetary policy. This one is BIG! \n9. Bitcoin provides financial services for the billions of un-banked people across the world. \n10. A world with Bitcoin is a happier world. When the value of money appreciates, people are likely to be far more discerning with their consumption and to and to save far more of their income for the future. Such a world would cause people to develop a lower time preference, as their monetary decisions will orient their actions towards the future, teaching them to value the future more and more."},{"text":"11. Bitcoin counters the Cantillon Effect, where those closest to the money spigot get the most benefits (and the rich get richer). \n12. More than 2/3 of the energy produced in the world is waste energy, because it's produced during the hours of the day when there isn't a demand to consume it. Bitcoin miners use this wasted energy to create Bitcoin. For example, Bitcoin miners are moving to Wyoming, Texas, and Alberta where oil rigs flare off huge quantities of waste methane. They capture this methane with portable mining equipment. Not only are they taking the natural gas and using it as electricity, they are capturing the carbon and put it underground (not venting it and creating acid rain and CO2). This helps the environment and turns a profit at the same time! \n13. Bitcoin is a movement that all political parties can get behind and support. Bitcoin is probably the most bipartisan idea this world has ever seen. Bitcoin is free speech. Bitcoin is freedom.\n14. Bitcoin provides an economic system/framework that is in line with the current deflationary environment of tech. We cannot move towards an energetically “sustainable” future in an economic system that incentivizes consumption and spending, while the improving technology is naturally deflationary and more efficient. This is all laid out in the book The Price of Tomorrow by Jeff Booth and is one of the most powerful macro arguments in favor of Bitcoin. We haven't upgraded our money in over 100 years. Bitcoin is the upgrade.\n15. Bitcoin incentivizes saving again, plain and simple. You can save your money without losing purchasing power in the future. This is completely distinct from investing, which is required in our inflationary system to try to maintain purchasing power. Due to rising inflation, people can't even save money these days, which is crazy! Bitcoin gives us an option to save."},{"text":"16. Bitcoin enables very fast, low fee, secure transactions of any amount to anyone in the world at any time.\n17. Bitcoin, unlike legacy banking services, is open before 9AM and doesn't close after 5PM or on weekends or holidays. \n18. You can transact with anyone without having to trust them or rely on a third party to enforce the transaction.\n19. There are ways to hold and transact with Bitcoin that aren't directly tied to your identity (privacy factor).\n20. Bitcoin is the only truly decentralized coin. There is no CEO, board of directors or marketing team behind Bitcoin.\n21. Bitcoin can be transacted with on the lightning network that enables instant, nearly free global transactions at any time."},{"text":"Another take on 21 reasons why bitcoin will save the world:\nhttps://darthcoin.substack.com/p/21-reasons-why-bitcoin-will-save","link":"https://darthcoin.substack.com/p/21-reasons-why-bitcoin-will-save"},{"text":"Circumvent the Russian Putin regime https://twitter.com/LynAldenContact/status/1484186042899079169?t=KhUaHP49QvJ293TigXxRkg&s=19","link":"https://twitter.com/LynAldenContact/status/1484186042899079169?t=KhUaHP49QvJ293TigXxRkg&s=19"},{"text":"Thread of use cases \nhttps://twitter.com/skwp/status/1335627973915971592?t=oUxbM8t6a24QK-zE3MqRdw&s=19","link":"https://twitter.com/skwp/status/1335627973915971592?t=oUxbM8t6a24QK-zE3MqRdw&s=19"},{"text":"One underrated feature of Bitcoin is that it can be spent in any amount imaginable.\n\nHigh value payments are great for wealthy elites, but the low value payments will change the world.\n\nSo many new use cases that simply aren't possible with cash, credit cards, and bank wires.","imgs":["images/properties/use-cases_20220214_064714.jpg"]},{"text":"As we're seeing today with the Ukraine, Russia conflict, Bitcoin is a safe haven. It is a hedge against geopolitical risk, because Bitcoin isn't controlled by any government. Sanctions can not be made on your Bitcoin!"},{"text":"If you pay with credit card, the merchant has to pay 3% fee and they pass that on you through increasing prices. With bitcoin it's basically free."},{"text":"How Bitcoin contributes to society.\nhttps://twitter.com/XbtWilly/status/1535608286241771521?t=vDHA4hJDDP6G5xU-tLGKFA&s=19","link":"https://twitter.com/XbtWilly/status/1535608286241771521?t=vDHA4hJDDP6G5xU-tLGKFA&s=19"},{"text":"Human Rights and Bitcoin in countries all over the world\nhttps://twitter.com/gladstein/status/1539472491474694144?t=ZknLQx5mgyAU0M-g3Gp_5A&s=19","link":"https://twitter.com/gladstein/status/1539472491474694144?t=ZknLQx5mgyAU0M-g3Gp_5A&s=19"},{"text":"Bitcoin fixes this:\nhttps://twitter.com/gladstein/status/1406413672977555459?t=hSv1oL_JfHPeWTgQIiC0UQ&s=19","link":"https://twitter.com/gladstein/status/1406413672977555459?t=hSv1oL_JfHPeWTgQIiC0UQ&s=19"},{"text":"The Bitcoin Promise:\nhttps://twitter.com/ODELL/status/1575866807822741504?s=20&t=5efOVsVIR0n2fXoBwsQ5jQ","link":"https://twitter.com/ODELL/status/1575866807822741504?s=20&t=5efOVsVIR0n2fXoBwsQ5jQ"},{"text":"Bitcoin fixes what, exactly?\nhttps://thebitcoinpoet.substack.com/p/bitcoin-fixes-what-exactly","link":"https://thebitcoinpoet.substack.com/p/bitcoin-fixes-what-exactly"},{"text":"https://twitter.com/khalliburton/status/1584569793692471297?s=20&t=rgx0zjwkBVDXjpbcjs1IPw","link":"https://twitter.com/khalliburton/status/1584569793692471297?s=20&t=rgx0zjwkBVDXjpbcjs1IPw"},{"text":"https://twitter.com/skwp/status/1335627973915971592?s=20","link":"https://twitter.com/skwp/status/1335627973915971592?s=20"},{"text":"https://twitter.com/gladstein/status/1340836877595594752?s=20","link":"https://twitter.com/gladstein/status/1340836877595594752?s=20"},{"text":"Use case","imgs":["images/properties/use-cases_use_case.jpg"]},{"text":"Use cases thread \nhttps://x.com/DSBatten/status/1833875802326175939?t=Z6uje3lKoXzyADAseKBn1w&s=19","link":"https://x.com/DSBatten/status/1833875802326175939?t=Z6uje3lKoXzyADAseKBn1w&s=19","imgs":["images/properties/use-cases_20220215_use_case.jpg"]},{"text":"Here are dozens of human rights and humanitarian use cases for Bitcoin which cannot be done with dollars or any fiat money (Gladstein):\nhttps://www.journalofdemocracy.org/online-exclusive/how-to-dictator-proof-your-money/","link":"https://www.journalofdemocracy.org/online-exclusive/how-to-dictator-proof-your-money/","imgs":["images/properties/use-cases_use-cases_GettyImages-1233884338-scaled.jpg"]}]}