{"cat": "Experienced Topics", "title": "⛓blockchain-timechain-transactions-addresses", "desc": "BLOCKCHAIN A blockchain is a specific type of database. For Bitcoin, this database is a time-stamped ledger that keeps a historical record of the...", "msgs": [{"text": "<b>BLOCKCHAIN</b>\nA blockchain is a specific type of database. For Bitcoin, this database is a time-stamped ledger that keeps a historical record of the transactions on the network. As the name suggests, blockchains store data in blocks that are then chained together. As new data comes in, it is entered into a fresh block. Once the block is filled with data, it is chained onto the previous block which makes the data chained together in chronological order (complete with a timestamp). Different types of information can be stored on a blockchain, but the most common use so far has been as a ledger (record keeper) for transactions like it is for Bitcoin.\n\nIt has recently come to my attention that Satoshi originally called what we call the Blockchain, the Timechain. From here on out, when you refer to the Bitcoin Blockchain, you should call it the <i>Timechain</i>! See here for more (also posted in ): https://twitter.com/francispouliot_/status/1106028072799744002\n\nBitcoin timestamps each block using Unix (UTC) timestamps.\n\n<b>BUZZ WORD</b>\nThe word, \"blockchain,\" is being thrown around all over the place in this space, but people don't really know what it is (and more importantly, what it is not). A blockchain is not revolutionary tech in and of itself. Enterprise, permissioned blockchains were all the rage a few years ago and all of a sudden the buzz word is back. Many companies like IBM and Microsoft created their own blockchain teams under the belief that “blockchain, not Bitcoin” was the real innovative tech that would change the world. Years later, many of these companies have shut down their blockchain teams entirely. These companies could have saved a whole lot of money and time if they had just read this Jimmy Song blog post (April 14th, 2018) about why blockchains are pretty much useless for everything except money, like Bitcoin: https://jimmysong.medium.com/why-blockchain-is-hard-60416ea4c5c", "link": "https://twitter.com/francispouliot_/status/1106028072799744002"}, {"text": "<b>BLOCK SIZE</b>\nEach block in the Bitcoin Blockchain has a size of 1 MB (megabyte). Each block typically contains 1000-2000 transactions. The transactions awaiting verification/confirmation from the miners and the node operators are held in what is called the mempool. Currently, the entire Blockchain, which includes every single transaction that has ever occurred on the Bitcoin network up to the present moment (which updates automatically on all ), is over 300 GB. Satoshi knew that a block size larger than 1 MB would be inefficient (storage wise) as the nodes running the network wouldn't be able to cost effectively store the Blockchain if the blocks were larger. There was great controversy on this topic which led to a Bitcoin hard fork in 2017 called Bitcoin Cash. More on this hard fork can be found in (Block Size Wars (2015 - 2017))."}, {"text": "<b>DON'T TRUST, VERIFY</b>\nThe Bitcoin code is full of many consensus rules. Two of them that derive from Blockchain technology are, \"Is this Bitcoin that is being transacted with consistent with the fixed supply of 21 million coins, and has it previously been spent?\" This way, if I have bitcoin and I send it to two different people at the same time, the network will know which of these transactions occured first, therefore identifying both the valid transaction and invalid transaction (which it will automatically reject). Nodes don't need to trust other nodes for this to work; they only need verify that sufficient Proof of Work (spent energy/electricity) was done to create the new block. The longest chain is what individual nodes accept as the valid version of the Blockchain. The rule that nodes adopt the longest chain of blocks allows every node on the network to agree on what the Blockchain looks like, and therefore agree on the same transaction history. And as we know, since the network is decentralized, all of this can be done without a trusted third party!\n\nIn Bitcoin’s case, blockchain is used in a decentralized way so that no single person or group has control—rather, all users collectively retain control. Decentralized blockchains are immutable, which means that the data entered is irreversible. For Bitcoin, this means that transactions are permanently recorded and viewable to anyone. Form more on this, see ."}, {"text": "<b>BLOCKCHAIN 101 INCLUDING HASHING</b>\nhttps://youtu.be/_160oMzblY8", "link": "https://youtu.be/_160oMzblY8", "imgs": ["images/experienced/blockchain-timechain_004_blockchain-timechain_maxresdefault.jpg"]}, {"text": "Using a Blockchain for something other than a ledger for decentralized money is like using a forklift to do grocery shopping--it will work, but it's inefficient. Huge sums of money have been poured into Blockchain technology...no one has been able to create a large-scale record-keeping system using a Blockchain that significantly improves up or even achieves parity with more traditional approaches."}, {"text": "Great education on what a blockchain is and what it isn't: \nhttps://www.coincenter.org/education/blockchain-101/whats-a-blockchain/", "link": "https://www.coincenter.org/education/blockchain-101/whats-a-blockchain/", "imgs": ["images/experienced/blockchain-timechain_013_blockchain-timechain_blockchain1-2.png"]}, {"text": "https://twitter.com/AwyeeDeaterBob/status/1457457508877062144?t=-AT3vcL4AD9-jk9hoDcQ8A&s=19", "link": "https://twitter.com/AwyeeDeaterBob/status/1457457508877062144?t=-AT3vcL4AD9-jk9hoDcQ8A&s=19"}, {"text": "When people say Blockchain not Bitcoin. Via Andreas\nhttps://fxtwitter.com/lemalive/status/1462863293253570560?s=20", "link": "https://fxtwitter.com/lemalive/status/1462863293253570560?s=20"}, {"text": "https://twitter.com/w_s_bitcoin/status/1471479938771521538?t=mybg6Y9eMblGdSiD6o395g&s=19", "link": "https://twitter.com/w_s_bitcoin/status/1471479938771521538?t=mybg6Y9eMblGdSiD6o395g&s=19"}, {"text": "<b>TRANSACTIONS</b>\nFormat of wallet addresses:\nThere are a few different kinds of Bitcoin addresses. You can identify which address type it is by the first characters in the address:\n- old legacy addresses start with a 1\n- pay to script is a bit newer and starts with a 3\n- segwit starts with bc1q\n- taproot starts with bc1p\n- lightning starts with ln\n\nMore on addresses: https://shiftcrypto.ch/blog/what-are-bitcoin-address-types/", "link": "https://shiftcrypto.ch/blog/what-are-bitcoin-address-types/"}, {"text": "Blockchain is Dead - In this talk, at Emergence 2019, Aleks Svetski makes the case for why blockchain is an incremental innovation at best, and at worst, a misguided distraction at worst.\nhttps://www.youtube.com/watch?v=b3MVPmFCm_0", "link": "https://www.youtube.com/watch?v=b3MVPmFCm_0"}, {"text": "Blockchain growth 2021\nhttps://twitter.com/lopp/status/1477091465323028483?s=20", "link": "https://twitter.com/lopp/status/1477091465323028483?s=20"}, {"text": "<b>vByte transaction fees</b>\nhttps://river.com/learn/terms/v/vbyte/", "link": "https://river.com/learn/terms/v/vbyte/"}, {"text": "Bitcoin is the underlying technology behind the block chain hype, but saying that the block chain is the key invention here is misguided at best. The anchor chain is not the underlying technology behind the anchor. Nor is the keychain the technology behind the key or the food chain the underlying, most interesting aspect of a human being.\n- Bitcoin: Sovereignty through Mathematics"}, {"text": "Technical explanation of bitcoin transactions:\nhttps://www.youtube.com/watch?v=Shd9nXe1X-0", "link": "https://www.youtube.com/watch?v=Shd9nXe1X-0"}, {"text": "https://twitter.com/scottgun/status/1564646909670727680?s=20&t=j3pmyv5VxC6ewMIZGwzQ6g", "link": "https://twitter.com/scottgun/status/1564646909670727680?s=20&t=j3pmyv5VxC6ewMIZGwzQ6g"}, {"text": "https://twitter.com/alexstanczyk/status/1542188781410738176?t=0zezkW89_EbFn6gXTwPEiQ&s=19", "link": "https://twitter.com/alexstanczyk/status/1542188781410738176?t=0zezkW89_EbFn6gXTwPEiQ&s=19"}, {"text": "Timechain presentation\nhttps://twitter.com/PortlandHODL/status/1579260648818872321?t=z89T78mUFF4Zy7Ywcmo9Uw&s=19", "link": "https://twitter.com/PortlandHODL/status/1579260648818872321?t=z89T78mUFF4Zy7Ywcmo9Uw&s=19"}, {"text": "https://youtu.be/Shd9nXe1X-0", "link": "https://youtu.be/Shd9nXe1X-0"}, {"text": "Addresses\nhttps://x.com/PortlandHODL/status/1701373045703893044?s=20\nhttps://twitter.com/i/spaces/1OyKAVjovvMGb?s=20", "link": "https://x.com/PortlandHODL/status/1701373045703893044?s=20"}, {"text": "Derivation paths https://x.com/PortlandHODL/status/1703900260198998509?s=20\n\nhttps://x.com/tom_honzik/status/1839372261893046705?t=ztQfzquGe31ISMjQ1C9j7A&s=19", "link": "https://x.com/PortlandHODL/status/1703900260198998509?s=20"}, {"text": "Transaction accelerators:\nBitcoin accelerators are used to get a Bitcoin transaction to be included in a block. You can use F2Pool, ViaBTC, or another pool or these sites:\nhttps://acceleratebtc.com/\nhttps://bitaccelerate.com/", "link": "https://acceleratebtc.com/"}, {"text": "Full list of Bitcoin address prefixes\nhttps://stacker.news/items/375356/r/needcreations_", "link": "https://stacker.news/items/375356/r/needcreations_"}, {"text": "Justification for 10 minute block time\nhttps://x.com/EliNagarBrr/status/1921583321105981858?t=8mTZtoXbmKX7HO-ESNmG0w&s=19", "link": "https://x.com/EliNagarBrr/status/1921583321105981858?t=8mTZtoXbmKX7HO-ESNmG0w&s=19"}]}