{"cat": "Experienced Topics", "title": "💡energy", "desc": "ENERGY CONCERNS Globally, Bitcoin mining consumes an estimated 100-150 teraw", "msgs": [{"text": "<b>ENERGY CONCERNS</b>\nGlobally, Bitcoin mining consumes an estimated 100-150 terawatt hours (TwH) per year which is 0.1% of global energy usage. However, despite consistent scrutiny from the media and many politicians, using a great deal of energy is not a crime. Also, for comparison, the online advertising agency was uses 100+ TwH/year (a large percentage of that is also spam), the cruise ship industry uses 250 TwH per year, and \"always on\" devices in homes use 1,375 TwH/year. Christmas lights in the US alone even consume more energy than the Bitcoin network. So the question comes down to this: can the value that the Bitcoin network provides be justified to be more valuable than the value of something like Christmas lights? \n\nBitcoin uses proof of work. This is proof of energy. To consider the value of Bitcoin, let me start with an example of another currency. Wampum is a traditional shell bead of the Eastern Woodlands tribes of Native Americans that has been used as currency as early as the 1600s. It takes time and energy to make wampum, which is why it is considered to have value. The same can be said about Bitcoin. It takes time and effort (energy) to produce bitcoin. Bitcoin is only rewarded when a miner can prove that they have done a certain amount of work through electricity, processes and code. No state or authority has ever instructed or forced anyone to mine bitcoin. Mining is an activity carried out by individuals in response to the organic emerging demand for bitcoin."}, {"text": "Bitcoin miners need to find low cost energy to get an edge and turn a profit. Despite state coal subsidies in some countries, this now means miners need to turn to efficient, clean energy. Wind, solar, and especially hydro, as well as flared natural gas and geothermal (even from dormant volcanos like in El Salvador!) become the priority. Because of the way rewards work for mining, miners have a direct incentive to find the cheapest energy available, and in a lot of cases, the cheapest energy is renewables. We've been seeing miners over the past decade shift to cheaper, renewable forms of energy because it makes economic sense. An estimated 39% of Bitcoin's energy use is currently renewable, and that percentage is growing larger every day. It is believed that Bitcoin mining will one day be 100% renewable. General energy use worldwide is only 11% renewable. \n\nMore than 2/3 of the energy produced in the world is waste energy, because it's produced during the hours of the day when there isn't a demand to consume it. It is also produced in a place where there's not transmission to move it across space and time, so that energy goes unused and wasted. It is a misnomer that Bitcoin is using all the energy of a country like Switzerland, for example. Technically, that may be true, but that's not the whole story. You have to realize that a lot of the energy Bitcoin is consuming is waste energy that wasn't even available to be consumed in the first place!"}, {"text": "Citizens of countries that have volcanos, hydro plants, and wind and solar farms are often far away from population centers. So what this will allow is electrification of new areas which will create new economic activity. So for a country like El Salvador, communities in the mountains and by the rivers can get a jump start. Where there's Bitcoin mining, there are people who need food, new housing developments, and new jobs. Just like how mankind developed along rivers throughout our history, we could develop future activity around Bitcoin mining. Once an industry begins to grow, there's an entire ecosystem that builds around it. It's not just the miners, it's the skilled workers working around energy systems as well as electricians and supporting businesses through manufacturing and skills. \n\nIn places like Congo, only 9% of the population of 90 million people have access to the electricity grid. This causes an enormous amount of deforestation because they get their energy from biofuels by cutting down trees and producing charcoal which also produces a lot of indoor air pollution that kills lots of children. If all of a sudden this other 91% of the population used hydro electricity instead of biofuels, that would be a massive difference maker for the environment and all the people. Focusing energy usage around Bitcoin can help us get there!"}, {"text": "Bitcoin's demand for the most efficient power pushes miners to innovate, obtaining power that is either wasted, like trapped methane, stranded, like remote volcanos, or simply efficient and therefore clean. In contrast with gold, the search for which leads to more dirty, wasteful mines, the search for Bitcoin appears to lead to greener and more efficient energy production.\n\nBitcoin miners are also very mobile. They can move to where the power is. You can set up your mining facility very close to the source of power generation, even directly on a volcano! This is unique to Bitcoin mining. Normally, when you generate power, you need to move it somewhere else like to a city or an industrial facility. You can locate Bitcoin mining directly to where the power is! It doesn't have to be near population centers. Bitcoin miners can help bootstrap new types of energy in new locations, especially in developing areas. For example, Bitcoin miners are moving to Wyoming, Texas, and Alberta where oil rigs flare off huge quantities of waste methane. They capture this methane with portable mining equipment. Not only are they taking the natural gas and using it as electricity, they are capturing the carbon and put it underground (not venting it and creating acid rain and CO2). This helps the environment and turns a profit at the same time!"}, {"text": "Bitcoin has the potential to render obsolete what may be the least environmentally friendly institution of all time, the fiat currency petrodollar. Bitcoin requires no war planes to sustain it, no Middle East peace wars, no drone fleets, no multi-billion dollar armament deals. Like the internet itself, it just works. Bitcoin is a peer-to-peer protocol for money in the network age. It solves many problems that plague our world, see <#875000313092902942> Therefore, its energy use is definitely justified."}, {"text": "Source: https://www.youtube.com/watch?v=b-7dMVcVWgc&t=612s\n\nA thread by Lyn Alden on Bitcoin's energy use:\nhttps://twitter.com/LynAldenContact/status/1374774367666761729?t=JvXtyDcN8uKPGRNJu2W7bg&s=19\nExcerpt: \nHowever, the bitcoin network can only handle a finite number of daily base layer transactions. From there, secondary layers can multiply that number arbitrarily. \nIn other words, if 10x more people use bitcoin in 5 years, it won't use 10x more energy than now.", "link": "https://www.youtube.com/watch?v=b-7dMVcVWgc&t=612s"}, {"text": "Here is a detailed whitepaper outlining the environmental benefits to current + future oil & gas production resulting from $btc mining as an emerging technology.\nWritten by a good friend + colleague Kat Galloway from Artemis Energy.\n\nThe #bitcoin network harmonizes with O&G 💯\nhttps://twitter.com/denverbitcoin/status/1495848501867171848?t=cmtGZW1CP9ECU_St8wXrLQ&s=19", "link": "https://twitter.com/denverbitcoin/status/1495848501867171848?t=cmtGZW1CP9ECU_St8wXrLQ&s=19"}, {"text": "Add to mining concerns:\nUsing energy *helps* humanity.... (freezers, lights in the hospital) and hence there is some amount of energy we need to use to do good things (now you can reference the good things Bitcoin provides)\nshow that current fiat system takes a lot of energy to keep up\nshow people that currently dollar is backed by US Army, which consumes a lot of energy.\nAlso you can mention that mining gold currently takes more energy than mining bitcoin (afaik true).\nshow that Bitcoin can be mined anywhere in the world and you don't need to waste energy on transporting it to cities, etc.\nshow that Bitcoin is now using more renewable sources than average and can be used for flare gas"}, {"text": "Bitcoin Mining Council Data Review Q1 2022\nhttps://bitcoinminingcouncil.com/wp-content/uploads/2022/04/2022.04.25-Q1_2022_BMC_Presentation.pdf", "link": "https://bitcoinminingcouncil.com/wp-content/uploads/2022/04/2022.04.25-Q1_2022_BMC_Presentation.pdf"}, {"text": "Clean energy\nhttps://twitter.com/DSBatten/status/1600643653466492929?t=_Qs4JZRCVMbzP2hgkJDE7g&s=19", "link": "https://twitter.com/DSBatten/status/1600643653466492929?t=_Qs4JZRCVMbzP2hgkJDE7g&s=19"}, {"text": "https://twitter.com/moneyball/status/1603035890229600258?s=20&t=-pKPgrl0Nxr_CyOirYs6Nw", "link": "https://twitter.com/moneyball/status/1603035890229600258?s=20&t=-pKPgrl0Nxr_CyOirYs6Nw", "imgs": ["images/experienced/energy_111_mining_energy.jpg", "images/experienced/energy_112_energy_Fj8gcN6UcAA39W7.jpg", "images/experienced/energy_113_energy_Fj4AfwhWAAEGChP.jpg"]}, {"text": "", "author": "hodl.rodeo", "imgs": ["images/experienced/energy_110_IMG_7301.png"]}, {"text": "From: SWAN SIGNAL MONTHLY NEWSLETTER VOL. 32", "author": "hodl.rodeo"}, {"text": "Exactly!"}, {"text": "Have you seen This Machine Greens - Bitcoin energy doc by swan?"}, {"text": "Bitcoin network methane emissions mitigated tracker \nhttps://woocharts.com/esg-bitcoin-emissions-mitigated/\n\nhttps://twitter.com/woonomic/status/1787983895671247045?t=dcDN6b3vwXjkquQxhHdK6w&s=19", "link": "https://woocharts.com/esg-bitcoin-emissions-mitigated/", "imgs": ["images/experienced/energy_109_energy_GNAxgNda0AAUrht.jpg"]}, {"text": "https://twitter.com/Dennis_Porter_/status/1788295599324111244?t=34BhuIgibhGX7vZKFT8pvg&s=19", "link": "https://twitter.com/Dennis_Porter_/status/1788295599324111244?t=34BhuIgibhGX7vZKFT8pvg&s=19", "imgs": ["images/experienced/energy_107_20240508_201056.jpg", "images/experienced/energy_108_energy_GNFNXWKboAAPupc.jpg"]}, {"text": "Digital Assets\nResearch Institute\nQuantifying the environmental and social impact of Bitcoin using data\nhttps://www.da-ri.org/\nhttps://x.com/DSBatten/status/1798780751543955584", "link": "https://www.da-ri.org/", "imgs": ["images/experienced/energy_105_energy_66503ffb66fe301945aeee5c_da-ri-open-graph.jpg", "images/experienced/energy_106_energy_GPaLmHxW0AAyiVD.jpg"]}, {"text": "Cambridge Bitcoin Electricity Consumption Index (CBECI)  \n\nUnderstand Bitcoin’s environmental impact.  \n\nThis tool tracks Bitcoin’s electricity usage and compares it to other industries. Designed by Cambridge University.\nhttps://ccaf.io/cbnsi/cbeci", "link": "https://ccaf.io/cbnsi/cbeci", "imgs": ["images/experienced/energy_104_energy_og-image.png"]}, {"text": "Since 2023, there have been 18 peer reviewed papers on Bitcoin & Energy. \n\n16 concluded that Bitcoin mining supported climate action and UN Sustainable development goals while stabilizing grids and accelerating the energy transition.\n\nHere are the 16 studies:\nhttps://x.com/DSBatten/status/1905343638542188577?t=tRlM80AwrS5Hh3rzvEm0gw&s=19", "link": "https://x.com/DSBatten/status/1905343638542188577?t=tRlM80AwrS5Hh3rzvEm0gw&s=19"}]}