{"cat":"Experienced Topics","title":"📉the-problems-of-todays-money-and-freedom","desc":"*(under construction)*  THE PROBLEM OF TODAY'S MONEY (AND WHY BITCOIN IS THE SOLUTION)  \"It is well enough that people of the nation do not...","msgs":[{"text":"*(under construction)*\n\n<b>THE PROBLEM OF TODAY'S MONEY (AND WHY BITCOIN IS THE SOLUTION)</b>\n\n\"It is well enough that people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.\"\n- Henry Ford\n\n\n70% of ALL USD in circulation was created after 2008.\nOver 40% since 2020\nIt's getting worse and worse \n\nFiat currency in the United States started about 100 years ago.\n\nQuick history of the dollar: https://stacker.news/items/3009\n\nThe dollar as defined by the Constitution is a \"weight of gold or silver.\" In 1913, the government inserted a permanent central bank called Federal Reserve to stand in between the Constitution and the people. This was the introduction of \"the Fed dollar\" or fiat currency. It is not a Constitutional dollar; it is a note that is issued by the Federal Reserve. This also gave the right to the Federal Reserve to print money whenever they wanted to.  *One dollar today was worth $0.04 in 1913, a reduction of purchasing power by 96%*\n\nIn the years past The Great Depression, through WWII, and after, the United States traded cash for gold from citizen and other nations. Eventually, those nations started asking for their gold back.\nIn 1971 President Nixon decided to cut off other nations from their gold and we got off the Gold Standard. This is known as \"The Nixon Shock.\" Our money wasn't backed by gold anymore. Instead, it was backed solely by the full faith and credit of the United States government. You had to trust the government. And while it helped America grow as a superpower … and helped many of us live lives of exorbitant privilege …It’s also responsible for the mess we’re in today. And it’s what will ultimately topple the US dollar. They say those who don’t know history are doomed to repeat it. But politicians know their history.","link":"https://stacker.news/items/3009"},{"text":"They know that inflating the money supply is what ultimately kills it. They either just can’t help themselves - or they actually want our currency to collapse. There’s no rolling this back, either. The damage is already done. The US dollar is a ‘dead man walking’. And the only thing that can save America itself is bitcoin.\n\nWhen our government needs money, they create bonds or treasury bills and then sell them to large banks who sell them to the Federal Reserve for a profit. This is the \"Magic Money Machine.\" The Fed is America's central bank, but it doesn't have any money on its balance sheets. When a bank buys a bond and takes it to the Federal Reserve, the Fed says, \"Thanks Mr. Banker, here's the principal and some profit.\" New money isn't exchanged, it simply appears on the banks accounts- magic. This has been happening in secret for 100 years. This is where it gets really interesting. The Federal Reserve is not a government agency. It's a private entity. Its shareholders are banks who earn a dividend. This process answers to no one. And the Fed also sets the bar for how much interest you pay for a car, home or business loan. \n\nFractional reserve banking - means that banks only store a portion of our money while lending out way more (further debasing our money). Today, when you deposit $100 into a bank, the bank has the power to do whatever it wants with it. It can even take that $100 and loan $97 out to another person. The bank still says that you have $100...but it also says that the other person has $97 (it's all digital). Then, that person has to pay interest to the bank on that $97. The person then spends those $97 to some shop. That shop then deposits the $97 into a bank. Then the bank lends most of that money out too! This happens again and again...new money created from debt!"},{"text":"If you are deemed \"credit worthy\" by a bank, you can take out a loan where a bank creates money out of no where and charges you interest for it...giving more money to the banks!\n\nIf everyone who had money in banks requested 3% of their money in cash, the banks would not be able to do it.\n\n2008 financial crisis: Banks loaned out too much money to people who couldn't afford to pay it back. 30 million jobs were destroyed. The US lost $16 trillion in household wealth. The banks foreclosed on over 1 million homes. Were the banks punished for their actions? No, in fact, they were bailed out!\n\nNeed to mention: Debasement by Qualitative easing (QE) and the constant printing of USD by the Federal Reserve (Fed). Negative interest rates.  The playbook is as follows: increase the money supply, reduce interest rates and reflate asset values such that existing debt levels can be sustained and more debt can be created. However, despite record low interest rates, the global economy has once again begun to deteriorate and the effectiveness of quantitative easing is naturally being questioned by many. Contrary to popular belief, the function of quantitative easing actually creates the instability it seeks to avoid. When understanding its base operation, it becomes clear that quantitative easing has always been a fool’s errand. Quantitative easing is designed to allow banks to expand credit; for every dollar that is created through quantitative easing, the credit system can expand by multiples of each dollar added. This incremental credit (think auto loans, mortgages, student loans, etc.) is then used to purchase goods in the real economy, which causes the prices of goods to rise and the value of the dollar to decline on a relative basis."},{"text":"Our monetary policies have created a nation of debtors. Not just personal debt or cooperate debt, but government debt. What is the wealth of the nation? It is simply a gigantic hole of money that we owe to the world that is never going to be paid back. The US pays more than $400 billion in interest to its creditors every year. When a government spends more money than it collects in taxes, it just borrows or prints more. (see US current debt: https://www.usdebtclock.org/)\n\nSolution: Bitcoin via properties of Thermodynamics (first and third). See explanation here: https://hackernoon.com/bitcoin-and-thermodynamics-63f46b90627\n\nIf we can fix the money, we can fix the world. For the last century, the government has had full control of our money because they control the Federal Reserve and the Federal Reserve controls the money printer. Whoever controls the money printer controls everything. Decisions that influence our cultures, the food we eat, the education we receive, the energy that we have and can use, poverty levels as well as political imbalance, greed and corruption and more is all out of our control. There is a reason why some financial institutions like Goldman Sachs are still prospering while others like the Lehman Brothers went out of business- the government decided to print money for one of them and not the other. There is a reason why some areas of the country suffer from higher levels of poverty and get less educational funding than others- can you guess why?\n\nWe need to end the printing of money. We need to take back control from the government. We need to shut down Keynesian, Marxist and Monetarist economists and other proponents of the state theory of money who believe money is whatever the state says is money, and therefore it is the prerogative of the state to do with it as it pleases, which is going to inevitably mean printing it to spend on achieving state objectives, hurting the motives of our politicians and weakening our Democracy.","link":"https://www.usdebtclock.org/)"},{"text":"We need to adopt Austrian Economics advocating for no government control over our money. As the saying goes, \"Bitcoin fixes this.\" The Austrian theory of money posits that money emerges in a market as the most marketable commodity and most salable asset, the one asset whose holders can sell with the most ease, in favorable conditions. Bitcoin is sound money because of its fixed supply. When people store their value in Bitcoin, it will retain its purchasing power over time. Bitcoin allows everyone in the world access to a free market. There is a way out of the fiat system, and it is Bitcoin. Bitcoin is resurrecting what money used to be all about. It is money with real value.\n\nThroughout history, money from taxes and government bonds have financed wars. Just take a look at this chart: https://discord.com/channels/874318808423219280/874319602811801670/875572406612283432\n\nWe are living in an amazing time period where three revolutionary cycles are converging. The financial market resets every 80 years. A technological revolution happens every 50 years or so. We have a political/social/cultural revolution every 250 years. It seems like every 250 years, the world rejects globalism and more centralization and moves to decentralization. The American/French resolution happed 250 years ago and 250 years before that was the Protestant Reformation. Most people are looking for a centralized answer- will the dollar remain? Will it be the Chinese Yuan? Will it be an SDR? I think the world will be decentralized with Bitcoin. The Bitcoin Standard.\n\nMention Bitcoin's involvement in geopolitics. If two governments of two nations don't get along, money simply doesn't flow across their boarders. To give an example of how this applies: if you wanted to give a dollar to someone via the internet, almost half of the world can't receive it from you. Bitcoin fixes this.","link":"https://discord.com/channels/874318808423219280/874319602811801670/875572406612283432"},{"text":"The function of the American Rule of Law is to preserve our rights to life, liberty, & property...which are fundamentally the rights to consume, deploy, and store energy. Bitcoin perfects property rights (stored energy) because it literally is time-bottled energy with zero path loss.\n\nYou don't have to explain Bitcoin's use case to an Argentinian, Venezuelan, Zimbabwean, Ukrainian, Cypriot, Greek or Cuban. There countries are examples where there is an ongoing monetary crisis. There currency is worth virtually nothing (believe it or not, this is where USD in the United States is headed). Take a look at Bitcoin's use case in a desperate country in a monetary crisis that is hypothetically not too far from where America is now. \"Inside Cuba's Bitcoin Revolution\" - Mired in their worst economic crisis since the early 90s, Cubans face tyranny, shortages, blackouts, the embargo, and a collapsing peso. A growing number are finding hope through Bitcoin: https://bitcoinmagazine.com/culture/cubas-bitcoin-revolution\n\n\"Nigeria offers a great case study of Bitcoin's promise and utility. Political repression, currency controls, and rampant inflation have turned Nigerians into 'minimum-wage slaves.' Thirty-two percent of Nigerians own Bitcoin, the highest percentage in the world.\" There is no value in their native currency, but they see value in Bitcoin. Excerpt taken from an open letter to avid Bitcoin opponent, Senator Elizabeth Warren (it is beautifully written): https://medium.com/@samanthamessing/why-progressives-should-love-bitcoin-an-open-letter-to-senator-elizabeth-warren-176ab5cc9229","link":"https://bitcoinmagazine.com/culture/cubas-bitcoin-revolution"},{"text":"Over 2.5 billion people on Earth are unbanked. Now, with Bitcoin, having access to a mobile phone with internet makes you your own banker with the global marketplace at your hands. Kids born today wont ever have a bank account in the way that cell phone technology allowed entire nations to leap-frog the landline telephone system and achieve communications that would otherwise be unthinkable by their citizens.\n\nIn this age of human history we have embraced innovation. We have digitized music, film, medical records and communications. With Bitcoin comes digitized money.\n\nImagine payments without a middle man, investments without a broker, loans without a bank, insurance without an underwriter, charity without a trustee, escrow without an agent, betting without a bookie, record keeping without an accountant. Global, secure and nearly instant. Free. Bitcoin innovates so much.\n\nYou might think that Bitcoin will never catch on or worse yet that we don't need it. If you recall, the horse and carriage railroad industries tried to stop the automobile, the Postmaster General tried to stop email, and the telephone companies tried to stop the internet. The people who try to halt innovation are the ones that will be hurt by it the most. Early adaptors of a new technology like Bitcoin will benefit the most. Get involved!\n\nDefund war. Buy Bitcoin https://twitter.com/BITVOLT7/status/1426284226102575110?s=20","link":"https://twitter.com/BITVOLT7/status/1426284226102575110?s=20"},{"text":"Bitcoin- a sophisticated approach: well you see it's based on an open access participatory model of market based economic competition through risk and reward strategies based on game theoretical outcomes that ensure collaborative participation by multiple participants without anybody having the ability to cheat due to a system of emergence consensus based on mathematical rules and strong cryptography to which they respond yes yes but who's in charge who is in control?"},{"text":"It's a system of trust without authority. A system of trust without a center. A system of trust without hierarchy or control. We've never had a system of trust in our society where this has been possible. A 19th century hierarchical organization that is the outcome of the industrial era that is a system of bureaucracy and authority based on internal processes and rules oversight in layers and ultimately authority vested in someone perhaps authority that is elected through democracy perhaps authority that is not maybe it's hereditary maybe it's dictatorial but you can always point you look at the pyramid the hierarchy and you just let your eyes follow to the top and usually the someone at the top in some cases that person is merely an actor and there's a whole shadowy group playing the puppet strings but nevertheless authority is vested in that person and then you look at Bitcoin and it's a flat system and there's a few people who seem to have a special role and you say okay maybe those people are in control is it the miners is it the software developers is it some part of the node system and then you notice that these people can't actually do anything."},{"text":"Then people look at Bitcoin and they see its greatest strength as flaws! This is characteristic of new technology."},{"text":"They look at Bitcoin and they go but you can't even get the miners on the developers to agree on how to scale the system why doesn't one of the groups just say this is how we're going to do it because that's not Bitcoin because we don't have that ability there will be an adversarial competition it is a system of market forces competing against each other the reason we're in deadlock is because consensus overrides personal ambition popularity and everything else and so they look at Bitcoin and say you keep squabbling you can't make a decision yep by design feature not bug they look at Bitcoin and they say but you can't reverse a transaction payments are irreversible and they say that's a problem that's a bug how can you do that what what if something goes wrong who do I call to reverse the transaction feature not bug between guarantees execution of the scripts you put into it."},{"text":"More on this: https://discord.com/channels/874318808423219280/874344285623955516/876503603626532954","link":"https://discord.com/channels/874318808423219280/874344285623955516/876503603626532954"},{"text":"What gives money its value? The people do. Essentially, we are all under the hallucination that the money we have to day will be able to be used tomorrow to buy goods and services. This hallucination took hundreds of years to develop. It started in the 15th century (the Chinese did it even earlier in the 11th century) with the introduction of paper money- gold certificates, IOUs, bearer notes, etc pieces of paper which could be exchanged in promise for something else. But we've gotten to the point where these pieces of paper don't actually represent any value...not gold, not anything else...just a belief in value."},{"text":"Gresham's Law: where bad money chases out good money. If you have something that holds value (good money), you stash it! You use the bad money as a means of exchange until you run out of it...but it never really runs out because everyone is using it and it remains in circulation!"},{"text":"the great scourge of the emerging 21st century is the resurgence of populist nationalism. In countries like India, Fascism is rising. And just like the politicians wrap themselves in the flag, they also create these associations with their national flag money to wrap their money in the veil of nationalism to wrap the policies of wealth destruction and confiscation in the veil of nationalism if you disagree with the idea that pensioners should pay for the national debts and to bail out the banks if you disagree with the idea that a whole generation of young people should find themselves permanently unemployed or under employed or working in \"McJobs\" then you are a traitor to the nationalist ideal of solving crime and black money and corruption."},{"text":"That is exactly the tone of discussion that is happening right now in places like turkey where their government announced that it was everybody's duty as a Turkish citizen to sell their dollars and buy Lira and gold in order to prop up the nationalist pride where the Indian government use the same exact rationale to get everyone to suffer just a little bit because the people suffering the most have no voice they are invisible especially in India and the middle class that suffers a bit can wrap itself in the flag and go for these nationalist ideals in these. What ends up happening is hundreds if not thousands of people will die. With currency controls comes the short notice of government devaluing certain bill denominations (like India just did to the 500 rupee note) and closing the banks for days. When the banks finally open, people have to wait in long lines to withdraw what little funds they still have to pay medical bills. When they can't get their money in time, their family members die. In Zimbabwe, there is a $100 trillion note. In Venezuela, people have to carry their cash around in wheel barrels and measure it by the pound. \nBitcoin is a way to opt out of this madness of currency wars. Bitcoin stands neutral and is a safe haven asset and exit strategy for billions of people worldwide. Bitcoin gives access to financial services to billions around the world without a bank account. This access directly correlates to increases in dignity, liberty and self determination.\n\nmore here: https://www.youtube.com/watch?v=Bu5Mtvy97-4","link":"https://www.youtube.com/watch?v=Bu5Mtvy97-4"},{"text":"A world with Bitcoin is a happier world. When the value of money appreciates, people are likely to be far more discerning with their consumption and to and to save far more of their income for the future. Such a world would cause people to develop a lower time preference, as their monetary decisions will orient their actions towards the future, teaching them to value the future more and more."},{"text":"Great info ! Thank you","author":"houdinii37"},{"text":"Thanks, I definitely still need to edit this channel"},{"text":"Now that bitcoin exists, it is no longer merely the subject of an intellectual debate. Instead, we now have two competing monetary systems that present great contrasts: one attempts to create stability through active management of the money supply, while the other tolerates interim volatility in the interest of maintaining a fixed supply. For the last ten years, the bootstrapping upstart has been gaining ground on the incumbent system, as demonstrated by its adoption and steadily increasing value relative to other currencies. Opting in to bitcoin means opting out of quantitative easing, and while it may be a volatile path, the long-term trend will continue because central banks continue to pursue the very policy tool which bitcoin prevents.\n\n- excerpt from https://nakamotoinstitute.org/mempool/bitcoin-fixes-this/","link":"https://nakamotoinstitute.org/mempool/bitcoin-fixes-this/"},{"text":"“I don’t believe we shall ever have a good money again before we take the thing out of the hands of government, that is, we can’t take them violently out of the hands of government, all we can do is by some sly roundabout way introduce something that they can’t stop.”\n-F. A. Hayek\n\nThe FED can't end qualitative easing. They can't stop printing money or the system will collapse. Bitcoin solves this crisis by giving everyone an option to opt out of QE and the government's failed plan."},{"text":"Amazing and informative article that fits into this channel perfectly https://bitcoinmagazine.com/culture/the-truth-behind-bitcoins-opposition","link":"https://bitcoinmagazine.com/culture/the-truth-behind-bitcoins-opposition"},{"text":"Our current financial system is Proof-of-Stake, and it is broken beyond repair. It is exclusionary and elitist. It permits \"Silicon Valley investors\" to back projects that are forbidden for the average American. Bitcoin was invented as a new financial foundation. Bitcoin’s commitment to free speech, property rights, individual freedom, and open markets is *much more American* than any centrally-planned Proof-of-Stake system. \nThe Cantillon Effect, where those closest to the money spigot get the most benefits, is a powerful force in FIAT money. See more: https://bitcoinmagazine.com/culture/bitcoin-and-the-american-idea","link":"https://bitcoinmagazine.com/culture/bitcoin-and-the-american-idea"},{"text":"It remains critical to have these conversations, to remind the world that Bitcoin is not a company, not a stock, not a trade to get more dollars — but a way to reshape the system so that insiders, venture capitalists, banks and governments don’t have an advantage over everyone else anymore."},{"text":"I am a human rights advocate. Bitcoin fixes this."},{"text":"The truth hurts: https://twitter.com/gemsays/status/989644810016477184?s=19","link":"https://twitter.com/gemsays/status/989644810016477184?s=19"},{"text":"Add more info about the International Monetary Fund (IMF), The World Bank - https://www.youtube.com/watch?v=9Pi1sHbXWXw , Depository Trust & Clearing Corporation (DTCC), Bank for International Settlements (BIS) - In charge of policies for all international central banks. They will probably push the CBDC. Also European Central Bank (ECB)\n\nhttps://www.youtube.com/watch?v=p5Ac7ap_MAY - “Princes of the Yen: Central Banks and the Transformation of the Economy” a film by Michael Oswald. The film reveals how Japanese society was transformed to suit the agenda and desire of powerful interest groups, namely, central banks, and how citizens were kept entirely in the dark about this. \nBased on the book of the same title by Professor Richard Werner \n@ProfessorWerner","link":"https://www.youtube.com/watch?v=9Pi1sHbXWXw"},{"text":"Bitcon fixes war. More on this in a short article by Robert Breedlove: https://breedlove22.substack.com/p/bitcoin-is-the-war-on-war","link":"https://breedlove22.substack.com/p/bitcoin-is-the-war-on-war"},{"text":"“If the American people ever allow private banks to control the issue of their currency...first by inflation, then by deflation, the banks and corporations that will grow up around (these banks) will deprive the people of all property until their children wake up homeless on the continent their fathers conquered.” - Thomas Jefferson, Founding Father"},{"text":"Check out all these countries where Bitcoin is helping their oppressed citizens: https://twitter.com/gladstein/status/1429901086878421012?s=20\nAfghans: https://bitcoinmagazine.com/culture/bitcoin-financial-freedom-in-afghanistan","link":"https://twitter.com/gladstein/status/1429901086878421012?s=20"},{"text":"Bitcoin is the internet (of money).\nBitcoin is here to stay.","imgs":["images/experienced/problems-of-money_342_20210825_210254.jpg"]},{"text":"https://en.wikipedia.org/wiki/Executive_Order_6102","link":"https://en.wikipedia.org/wiki/Executive_Order_6102","imgs":["images/experienced/problems-of-money_341_problems-of-money_1200px-NNC-US-1907-G_2420-Saint_Gaudens__28Arabic_29.jpg"]},{"text":"\"Little did she know, she was already on the same page as many Bitcoin users, who often talk of the idea of a citadel where they can retreat into a space of freedom without external control. “I’ll see you in the citadels,” says the popular Bitcoin podcaster Stephan Livera at the end of every one of his 350-plus episodes.\"\n\nSo, Mahboob researched the idea of mobile money. As it turned out, cellphone-based payment systems like M-PESA, which worked so well in Kenya, never took off in Afghanistan. PayPal was still not available because of U.S. sanctions. And the women did not have bank accounts, so she could not wire them the money. The women had to have their father’s or husband’s permission to open an account, and this was often not granted.\n\nhttps://bitcoinmagazine.com/.amp/culture/bitcoin-financial-freedom-in-afghanistan?__twitter_impression=true","link":"https://bitcoinmagazine.com/.amp/culture/bitcoin-financial-freedom-in-afghanistan?__twitter_impression=true"},{"text":"Bitcoin removes the *human element* of tampering with money and its supply which inevitably leads to the corruption & debasement of money that has plagued civilization for 10,000 yrs of existing monetary policy."},{"text":"What is Bitcoin's use case? What problem does it solve? I'm glad you asked. I'll answer in one sentence: Bitcoin removes the human element of the inevitable corruption & debasement of money that has plagued civilization for 10,000 years of monetary policy. We now have the chance to alter the course of human history!"},{"text":"Need to add more on Game Theory, Geopolitics and Macroeconomics"},{"text":"Fiat is a cancer & incentives:\n\n- Business lying to customers\n- State dependency\n- Endless wars\n- Over price homes\n- Gutted manufacturing\n- Rampant consumerism\n- Family break down\n- Cheap food\n- Inefficient energy\n- Poor education"},{"text":"I need to add more on Bretton Woods. Mentioned in this article https://bitcoinmagazine.com/culture/bitcoin-and-gold-energy-debate","link":"https://bitcoinmagazine.com/culture/bitcoin-and-gold-energy-debate"},{"text":"Wonderful thread detailing on the collapse of three former civilizations due to the debasement of money:\nhttps://twitter.com/Dennis_Porter_/status/1398371603424026624?s=20","link":"https://twitter.com/Dennis_Porter_/status/1398371603424026624?s=20"},{"text":"More on this: A Cantillon effect is a change in relative prices resulting from a change in money supply, which was first described by 18th-century economist Richard Cantillon. ... Instead, history shows that certain assets take favor over others, leading to rising in some areas of the economy and falling prices in others. The Cantillon Effect describes how new money creation benefits those who receive the money first, at the expense of those furthest from the creation of new money. ... Bitcoin divorces the creation of new money from politics, making it much fairer. Bitcoin doesn't necessarily eliminate the wealth gap, but it levels the playing field.\nMore: https://whatismoney.info/cantillon-effect-bitcoin/\nMore: https://bitcoinmagazine.com/culture/cantillon-effect-2-0-bitcoin-is-the-worlds-first-truly-fair-money\n\nBitcoin doesn’t aim to do anything innovative — rather, it offers an improved alternative to the existing inequitable, inaccessible, and inflationary financial system. By decentralizing finance, we are progressively simplifying a system so complex that it locks out nearly two billion people worldwide, and turning it into a permission-less network that anyone can be a part of.\n\nBitcoin enables unit-level currency validation that isn't possible with fiat (government-backed money). For instance, there are plenty of fake dollar bills in circulation (the U.S. Treasury estimates that one in every 10,000 bills is counterfeit) that the average person fails to discover. However, nobody can create fake bitcoin because the Bitcoin network is secured cryptographically via a public blockchain that anybody can access and validate any amount of bitcoin as real.","link":"https://whatismoney.info/cantillon-effect-bitcoin/","imgs":["images/experienced/problems-of-money_338_problems-of-money_Cantillon.jpg"]},{"text":"Bitcoin solves the ancient problem of scarcity and the modern problem of privacy with the oldest technology known to man, money."},{"text":"https://twitter.com/nickgillespie/status/1438211211754102784","link":"https://twitter.com/nickgillespie/status/1438211211754102784"},{"text":"Bitcoin is a rebellion against the most powerful bastion of socialism in the free world: central banking. It is a peaceful revolution involving the permanent disarmament of tyrants that weaponize money to confiscate wealth. Bitcoin is a weapon of peace used for the assassination of time-theft. An alchemical archetype, it is an antidote to state corruption and social moral affliction. As a purely honest free market money, Bitcoin is an irrepressible truth; an expression of pure monetary capitalism and a modern-day declaration of independence for fiat-slaves worldwide.\n\nBitcoin is money without masters: a system governed by rules instead of rulers. By awakening the world from the nightmare of financial slavery, Bitcoin is a dream of freedom coming true.\n\n- Excerpt from Masters and Slaves of Money by Robert Breedlove"},{"text":"https://twitter.com/parman_the/status/1439849158051917828?s=19","link":"https://twitter.com/parman_the/status/1439849158051917828?s=19"},{"text":"More on the Cantillon Effect:\n\nWhy do the rich get richer and the poor get poorer ... ??? \n\nTHE RICH HOLD ALL THE ASSETS that benefit from the monetary policy that MANIPULATES these assets higher.\n\nbitcoin fixes this\n\nVia <@!705947643821555774>","imgs":["images/experienced/problems-of-money_336_wealth_control.jpg"]},{"text":"How the economy actually works in 30 minutes by Ray Dalio:\nhttps://www.youtube.com/watch?v=PHe0bXAIuk0","link":"https://www.youtube.com/watch?v=PHe0bXAIuk0","imgs":["images/experienced/problems-of-money_314_problems-of-money_maxresdefault.jpg"]},{"text":"Example of the Cantillon Effect: Corporations can get a $100,000,000 loan for 2-3% interest, but the average man has to pay 26% interest on his credit card and typically above 12% on a bank loan."},{"text":"The invention of Democracy decentralized politics with the branches of government and checks & balances. The invention of the internet decentralized information, giving all humans free and equal access to all knowledge. The invention of Bitcoin decentralized money, creating a permissionless and trustless system of rules without rulers.\n\n53% of the world, 4.3 billion people in 93 countries live under authoritarian rule.\n\nHow can Bitcoin be used to fight authoritarianism and the surveillance state? 2 things: Bitcoin is a sovereign savings account that is debasement proof. The government can't print more bitcoin whenever they want. \n\nOnly 13% of the world lives in a liberal democracy with property rights and has a reserve currency meaning a currency so stable and desirable that other countries save in it at the central bank level. Countries like US, Australia, UK, Switzerland, the Euro and Canada. Everyone else lives under a weaker currency or an authoritarian regime, almost 7 billion people. A permissionless sovereign savings account that doesn't require an ID is a big deal to all of those people. Over 1.3 billion people live under double or triple digit inflation...Nigeria, Turkey, Argentina and about 32 other countries all have its citizens' earnings and savings are disappearing rapidly over time. Bitcoin is an immediate, low cost solution to this problem.\n\n\n\n\nhttps://www.youtube.com/watch?v=kSbMU5CbFM0","link":"https://www.youtube.com/watch?v=kSbMU5CbFM0","imgs":["images/experienced/problems-of-money_314_problems-of-money_maxresdefault.jpg"]},{"text":"(continued from above)\n\nIf the US stops sanctions on countries, the citizens can still transact, do commerce, and send/receive remittance payments in Bitcoin. We see this currently in Cuba, Iran and Palestine.\n\n\"Not only does Bitcoin have NGU (number go up) technology, but also FGU (freedom go up) technology.\"  - Alex Gladstein.\n\nThe beauty in Bitcoin lies in the way it aligns human incentives and our most based desires, needs and realities with freedom and privacy like nothing has ever been able to do before. Here is an example. Bitcoin is an interesting vehicle for freedom because nothing has ever existed like it before. Normally, to raise money for a human rights group, people have to beg for money with non profit work to get people to make a difference with you. With Bitcoin, it is an asset that most people want to accumulate out of self interest, self preservation and greed, yet hidden underneath this investment is a strengthening force to power the individual. This is what we need to fight \"big brother.\" It's hard to really care about struggling people living thousands of miles away. But with Bitcoin, it makes the process a lot easier. Another way incentives are lined up is this: https://discord.com/channels/874318808423219280/875765140711166053/899764243774210129","link":"https://discord.com/channels/874318808423219280/875765140711166053/899764243774210129"},{"text":"Bitcoin can and is saving the Turkish citizens from their debased currency and failing government/central bank.\n\nhttps://twitter.com/JanWues/status/1451176497046228995?s=20","link":"https://twitter.com/JanWues/status/1451176497046228995?s=20"},{"text":"https://bitcoinmagazine.com/culture/turkish-tribal-war-against-bitcoin","link":"https://bitcoinmagazine.com/culture/turkish-tribal-war-against-bitcoin"},{"text":"\"On January 15, 2021, the number of people investing in the Turkish Stock Market went past 2 million for the first time. By April 24, 2021, there were more than 5 million users registered to the two biggest Turkish bitcoin exchanges. One would wonder how a 12-year-old technology manages to attract more people than the Istanbul Stock Exchange that has been active since 1985 with the full support of government institutes. The answer lies in the Turkish lira and the reputation of the central banking system of Turkey.\""},{"text":"\"In a world where money is not controlled by someone (the president of Turkey in this case), it is much harder to fund these projects by printing money and diluting people’s savings and earnings. Bitcoin, in this case, would be very beneficial for the majority of Turkish people who want to opt out of this craziness. People would prefer to store their wealth in a sound money that can’t be diluted instead of one printed to support these otherwise zombie companies and government cronies. As mentioned at the beginning of the article, this is a war between Bitcoin — a mathematically backed software that only aims to deliver immutable blocks every 10 minutes — versus a mathematically illiterate tribe that does as many malinvestments as possible to sustain their Ponzi-like business.\""},{"text":"","imgs":["images/experienced/problems-of-money_331_Screenshot_20211022-224812.png"]},{"text":"Cantilion Effect - the elite disproportionately benefit from newly printed money, inflation means those already with a lot of real estate and stocks get richer while the average person doesn't see those benefits and all the while their savings get devalued"},{"text":"Four global phenomena -- the devaluation of personal wealth (inflation), the restriction of money transfer (most countries make it difficult and lengthy to transfer money to another country), financial centralization (government makes all the decisions) and loss of privacy (digital surveillance, third parties know your purchase history) -- represent major risks to the individual as they navigate the 21st century monetary system. Bitcoin fixes this"},{"text":"https://twitter.com/gladstein/status/1453087434623754240?s=20","link":"https://twitter.com/gladstein/status/1453087434623754240?s=20"},{"text":"Banker bailouts, external military interventions, enhanced border security, and subsidized welfare are just some of the questionable activities enabled by printing more money.\n\nWhen citizens are forced to use centralized payment platforms like China's WeChat which microtracks millions of lives, when a human rights group's bank account is frozen by a dictator, or when sanctions on a country punishes people for crimes they're unelected rulers have committed, Bitcoin can be a way out."},{"text":"More on Cantillon Effect:\nhttps://bitcoinmagazine.com/culture/cantillon-effect-2-0-bitcoin-is-the-worlds-first-truly-fair-money","link":"https://bitcoinmagazine.com/culture/cantillon-effect-2-0-bitcoin-is-the-worlds-first-truly-fair-money"},{"text":"https://twitter.com/louishliu/status/1455294939101679617?s=20","link":"https://twitter.com/louishliu/status/1455294939101679617?s=20"},{"text":"Need to research Metcalf Law, Lindy Effect, and more on Gresham's Law"},{"text":"https://twitter.com/Dennis_Porter_/status/1457808778615656454?t=ztreZEh6qzhb49Or9D_eqA&s=19","link":"https://twitter.com/Dennis_Porter_/status/1457808778615656454?t=ztreZEh6qzhb49Or9D_eqA&s=19"},{"text":"Bitcoin and the end of Imperialism:\nhttps://bitcoinmagazine.com/culture/bitcoin-replacing-us-super-imperialism","link":"https://bitcoinmagazine.com/culture/bitcoin-replacing-us-super-imperialism"},{"text":"https://twitter.com/jaygould/status/1458908154725556235?t=M1iQNV3CXl4Vaqsenydvvg&s=19","link":"https://twitter.com/jaygould/status/1458908154725556235?t=M1iQNV3CXl4Vaqsenydvvg&s=19"},{"text":"Reveiew of the dollar's history with gold","imgs":["images/experienced/problems-of-money_328_Reveiew_of_the_dollar_s_history_with_gold.png"]},{"text":"Thread on Cantillon Effect\nhttps://twitter.com/SahilBloom/status/1460242310420123651?t=Rf7cPHm0xwitWGyX7XcvRw&s=19","link":"https://twitter.com/SahilBloom/status/1460242310420123651?t=Rf7cPHm0xwitWGyX7XcvRw&s=19"},{"text":"In a world where technology is concurrently driving deflation and abundance, maybe eventually, one of the forcing functions that makes cooperation more likely to stick is the very fact that there will not be a large economic incentive to quote cheat or quote betray... Abundance minimizes the payoff. Or maybe we should attempt to create an economic system that works that way. Bitcoin enters the chat\n- The Price of Tomorrow"},{"text":"Further reading recommended by <@!232636672892731392>:\nBen Kaufman - The Monetary Case for Bitcoin: https://medium.com/coinmonks/the-monetary-case-for-bitcoin-778cd51ff272\nNick Szabo – Shelling Out: The Origins of Money : https://nakamotoinstitute.org/shelling-out/\nAlex Gladstein - UNCOVERING THE HIDDEN COSTS OF THE PETRODOLLAR : https://bitcoinmagazine.com/culture/the-hidden-costs-of-the-petrodollar","link":"https://medium.com/coinmonks/the-monetary-case-for-bitcoin-778cd51ff272"},{"text":"seigniorage\n/ˈsānyərij/\nnoun\nprofit made by a government by issuing currency, especially the difference between the face value of coins and their production costs."},{"text":"changing the current political state of the world is nearly impossible. Not because of the risk of having your voice drowned out—everyone on the internet faces that hurdle—but because the game is rigged. It’s rigged everywhere. Ignorant bloggers with hubris and a paycheck, often referred to as “journalists”, often parrot their unseen masters, the central bankers, and accuse Bitcoin of being the biggest pyramid scheme ever known to man. Our current monetary system is a pyramid scheme of such gargantuan proportions that almost everyone on Earth fails to see it for what it is, since the bubble encapsulates the entire planet. Quantitative easing is counterfeiting and counterfeiting is theft. Wealth is stolen from everyone and given to those most cynical and evil among us. If we had sound money, the playing field would be levelled and those of us making the most responsible investments would be rewarded. Right now our system rewards ignorant demagogues and outright liars instead. A hierarchical system of power will always favor those who crave power above all else. A decentralized system will not. It can not. It’s fair.\n- Sovereignty through Mathematics"},{"text":"Africa thread\nhttps://twitter.com/marcrjandrew/status/1487923985551552517?s=20&t=g6qn0dMn-iGuddPHgTMMew","link":"https://twitter.com/marcrjandrew/status/1487923985551552517?s=20&t=g6qn0dMn-iGuddPHgTMMew"},{"text":"On August 15, 1971, Nixon defaulted on the promise to redeem dollars for gold, ending Bretton Woods I. On Feb 26 2022, the US defaulted once again, drawing the curtain on Bretton Woods II. My latest in @CoinDesk By Nic Carter\nhttps://www.coindesk.com/layer2/2022/03/09/americas-quiet-default/","link":"https://www.coindesk.com/layer2/2022/03/09/americas-quiet-default/"},{"text":"As citizens from Canada, Russia and Ukraine have recently had their money frozen, the importance of self sovereignty has never been higher.\n\nTime for a🧵thread on👇\n\n-Trend of monetary confiscation\n-Warning signals to watch\n-How to protect yourself from all of this\n\n1/\nhttps://twitter.com/1MarkMoss/status/1501620386672304130?t=cTvV13Navqqw6XaJcOGOcg&s=19","link":"https://twitter.com/1MarkMoss/status/1501620386672304130?t=cTvV13Navqqw6XaJcOGOcg&s=19"},{"text":"Cantillon Effect: where those closest to the point of money creation benefit at the expense of the rest"},{"text":"History of money lesson for an audience of shitcoiners with the goal of pushing them towards Bitcoin only. By <@796386480367992832> \nhttps://www.youtube.com/playlist?list=PLXnoQDI0yzQRuQVDEj_sOIIudvLGfk3Yd","link":"https://www.youtube.com/playlist?list=PLXnoQDI0yzQRuQVDEj_sOIIudvLGfk3Yd","imgs":["images/experienced/problems-of-money_325_problems-of-money_hqdefault.jpg"]},{"text":"https://twitter.com/dustinwatchman/status/1439853026076987393?t=oWyt7yb3cd1yq7pHT8hxDg&s=19","link":"https://twitter.com/dustinwatchman/status/1439853026076987393?t=oWyt7yb3cd1yq7pHT8hxDg&s=19"},{"text":"To do: \nReorganize this channel and start it with this video:\nhttps://www.youtube.com/watch?v=LgI0liAee4s&t=","link":"https://www.youtube.com/watch?v=LgI0liAee4s&t=","imgs":["images/experienced/problems-of-money_314_problems-of-money_maxresdefault.jpg"]},{"text":"The Creature from Jekyll Island: A Second Look at the Federal Reserve:\nhttps://amzn.to/3PEapPR","link":"https://amzn.to/3PEapPR"},{"text":"The first Central Bank ROTHSCHILD \nhttps://en.wikipedia.org/wiki/Bank_of_Amsterdam\nhttps://www.newyork.org/history/history-of-the-rothschild-bank-worlds-biggest-bank","link":"https://en.wikipedia.org/wiki/Bank_of_Amsterdam","imgs":["images/experienced/problems-of-money_318_problems-of-money_1200px-Saenredam_-_Het_oude_stadhuis_te_Amsterdam.jpeg"]},{"text":"https://nakamotoinstitute.org/mempool/bitcoin-is-not-backed-by-nothing/","link":"https://nakamotoinstitute.org/mempool/bitcoin-is-not-backed-by-nothing/"},{"text":"","imgs":["images/experienced/problems-of-money_320_dollar_history.png","images/experienced/problems-of-money_321_prob_of_todays_money.png"]},{"text":"The debt spiral\nhttps://twitter.com/jameslavish/status/1562078782453792768?t=cV0mDhS1bws2neYm8_6TMQ&s=19","link":"https://twitter.com/jameslavish/status/1562078782453792768?t=cV0mDhS1bws2neYm8_6TMQ&s=19"},{"text":"How the FED creates money\nhttps://twitter.com/CoinbitsApp/status/1577992421023031296?t=LsPeei0pmscC-eaijm1J4A&s=19","link":"https://twitter.com/CoinbitsApp/status/1577992421023031296?t=LsPeei0pmscC-eaijm1J4A&s=19"},{"text":"Fractional reserve banking\nhttps://en.wikipedia.org/wiki/Fractional-reserve_banking","link":"https://en.wikipedia.org/wiki/Fractional-reserve_banking","imgs":["images/experienced/problems-of-money_317_fractional_reserve_banking.png","images/experienced/problems-of-money_318_problems-of-money_1200px-Saenredam_-_Het_oude_stadhuis_te_Amsterdam.jpeg"]},{"text":"First three youtube links explain our broken money\nhttps://twitter.com/theyoungrossco/status/1560017619859623936?s=20&t=Vgz_rNtik9U4fCPewZw9BQ","link":"https://twitter.com/theyoungrossco/status/1560017619859623936?s=20&t=Vgz_rNtik9U4fCPewZw9BQ"},{"text":"reserve requirements zero percent","imgs":["images/experienced/problems-of-money_316_reserve_requirements_zero_percent.jpg"]},{"text":"federal reserve","imgs":["images/experienced/problems-of-money_315_federal_reserve.jpg"]},{"text":"Dave Smith on Hyper-Inflation and Fractional Reserve Banking on Joe Rogan\nhttps://www.youtube.com/watch?v=g6LS7GO7Qkw","link":"https://www.youtube.com/watch?v=g6LS7GO7Qkw","imgs":["images/experienced/problems-of-money_314_problems-of-money_maxresdefault.jpg"]},{"text":"When Buckminster Fuller was asked, \"How would you suggest solving international problems without violence?\" He answered:\n\n\"I always try to solve problems by some artifact, some tool or invention that makes what people are doing obsolete so that it makes this particular kind of problem no longer relevant.\n\nMy answer would be to develop a world energy grid, an electric grid where everybody is on the same grid. All of a sudden, there would be no problems anymore, no international troubles.\n\nOur new economic basis wouldn't be gold or dollars; it would be kilowatt hours.\"\n\nR. Buckminster Fuller\n\nBucky spent his life searching for what he called nature's coordinate system. He observed that nature does not have a chemistry, physics, or biology department, yet somehow, everything in the universe was coordinating. He deduced that there was an underlying system used to coordinate everything. He often referred to it as a universal time-energy accounting system. \n\nIn 2009, a pseudonymous developer built this accounting system with computer code (as Bucky predicted would happen), and it has since been openly accessible to anyone worldwide. It is a public utility with increasing engagement, utility, and resiliency.  \n\nhttps://www.aworldgame.org/","link":"https://www.aworldgame.org/"},{"text":"The Four Horsemen, documentary on the fiat scam (2013) https://www.youtube.com/watch?v=5fbvquHSPJU","link":"https://www.youtube.com/watch?v=5fbvquHSPJU"},{"text":"Tracks real inflation shadow stats https://www.shadowstats.com","link":"https://www.shadowstats.com"},{"text":"Bitcoin is Not Democratic\nBitcoin is not Socialist. It is not Democratic. It is a system of voluntary, entirely non violent, free association.\nBy Beautyon, 2014\nhttps://medium.com/decentralize-today/bitcoin-is-not-democratic-81f87158250a","link":"https://medium.com/decentralize-today/bitcoin-is-not-democratic-81f87158250a"},{"text":"Money printing visualization \nhttps://neal.fun/printing-money/","link":"https://neal.fun/printing-money/"},{"text":"Cantillon Effect \nhttps://x.com/jameslavish/status/2011592411244372440?s=20","link":"https://x.com/jameslavish/status/2011592411244372440?s=20","imgs":["images/experienced/problems-of-money_0345_G-qbpmqbsAAbu04.png"]}]}