{"cat":"Experienced Topics","title":"📱smart-contracts","desc":"SMART CONTRACTS “'Smart contracts' as a term was coined by Nick Szabo back in 1996 before the idea of a blockchain was even a twinkling in Satoshi’s...","msgs":[{"text":"<b>SMART CONTRACTS</b>\n“'Smart contracts' as a term was coined by Nick Szabo back in 1996 before the idea of a blockchain was even a twinkling in Satoshi’s eye. They had nothing to do with DAOs, or decentralized exchanges or any of these types of constructs that people tend to think of when they hear the term.” - \n\nThrowing out the hype, the shitcoin buzzwords, the DAOs, and all the obscure claims about smart contracts on the various \"crypto\" platforms out there, and let's get down to the origins and true meaning of the term \"smart contract.\" What does it really mean, and does Bitcoin have smart contracts, or not? A great piece from  and Bitcoin Magazine today. Not to be missed.\n\nMultisignature (Multisig)\nMultisignature (multisig) wallets are smart contracts that allow multiple signers to review and agree on an action on the blockchain before the action is executed. \nhttps://www.curvegrid.com/docs/multi-signature-multisig-wallet-smart-contracts\nhttps://bitcoinmagazine.com/tags/multisig\n\nCheckTemplateVerify (CTV) (pending activation)\nhttps://bitcoinmagazine.com/.amp/technical/what-is-bitcoin-checktemplateverify\nCheckTemplateVerify (CTV) is a soft fork proposal for Bitcoin specified in the Bitcoin Improvement Proposal (BIP) 119. It aims to enable new use cases for the network by adding a basic type of “covenant,” or smart contract, which is more than what can be achieved at the moment.\nCTV may be the most efficient way to implement ‘subtractive covenants,’ in which users restrict the majority of transaction data while leaving only a small part free. Are subtractive covenants the same thing as non-recursive covenants? (I'm not sure).","link":"https://www.curvegrid.com/docs/multi-signature-multisig-wallet-smart-contracts"},{"text":"Hash time locked contracts (HTLCs) (pending CTV activation)\nHave increased efficiency and liquidity in Bitcoin’s second-layer protocol, the Lightning Network.\nhttps://en.bitcoin.it/wiki/Hash_Time_Locked_Contracts\n\nVaults (pending CTV activation)\nVaults could allow a Bitcoin user to pre-define scheduled and limited spending of bitcoin from cold to hot storage, hence limiting the damage from a potential hack.\n\nSatoshi built smart contract opcodes into the bitcoin client, most of which were removed because they compromised security. Bitcoin devs have long understood that smart contracts’ proper place is higher layers, which is now bearing fruit with Lightning & federal designs:\nhttps://twitter.com/TuurDemeester/status/1540180474844397568?s=20&t=ygTs0YWFCD1PI8FV96redg","link":"https://en.bitcoin.it/wiki/Hash_Time_Locked_Contracts","imgs":["images/experienced/smart-contracts_374_smart-contracts_FV_R-sMXkAAutfc.jpg"]},{"text":"https://bitcoinmagazine.com/technical/why-bitcoin-smart-contract-platform\nAudible:\nhttps://open.spotify.com/episode/6PnoitqNTXCWaykcz8S7DP?si=VW-5HmylRyCwykJ-lYmTJA&utm_source=copy-link&nd=1","link":"https://bitcoinmagazine.com/technical/why-bitcoin-smart-contract-platform"},{"text":"Hash time locked contracts: (smart contracts) HTLCs make up the Lightning Network \nhttps://twitter.com/LN_Capital/status/1605265299183472640?s=20&t=iL22HKwwOTr5jQIgqBDWuA","link":"https://twitter.com/LN_Capital/status/1605265299183472640?s=20&t=iL22HKwwOTr5jQIgqBDWuA","imgs":["images/experienced/smart-contracts_372_smart-contracts_FkcMR6pWYAAo56F.png"]}]}