{"cat":"Additional Info","title":"0⃣Mining (Hashing)","desc":"Deep dive into Bitcoin mining and hashing — how SHA-256 works at the bit level.","msgs":[{"text":"How does mining/hashing actually work? Why doesn't each cumulative hash increase the probability of finding the correct hash? Can two blocks be solved at the same time? What is the nonce?"},{"text":"0⃣Mining (Hashing)"},{"text":"Why miners are not closer to the solution as they hash potential solutions:\nExplanation by : the problem the miners have to solve is to find a hash of the block header that is less than the target number for that difficulty period. The block header includes the time stamp down to the second. The two other variables that can be changed are the nonce field and the input of the coinbase transaction (can be thought of as a second nonce). Therefore, each second there are a 2^96 different combinations of the block header that can be hashed to try and find a solution (which may not be found by that miner at all that second). The next second the timestamp variable will be different, so all the hashes will be completely different. Since it is impossible to predict patterns based on inputs into the hash, no patterns can be identified over time either. Hope this helps."},{"text":"Nonce means \"number once.\""},{"text":"From the Book of Satoshi","imgs":["images/helpdesk/0_mining__hashing_181_Screenshot_20220130-145504.png"]},{"text":"<b>What happens if two blocks are solved at the same time?</b>\nIf two blocks are solved at the same time by miners A and B, the chain splits and some miners work from A's block and the others work from B's block. Whichever chain solves the next block becomes the longest and therefore official chain, and the other chain becomes orphaned and dropped."},{"text":"More on what a nonce is and what the block header consists of:","link":"","imgs":["images/helpdesk/0_mining__hashing_180_0_mining__hashing_pexels-photo-1342460.jpeg"]},{"text":"https://youtu.be/MJ0OzrkHvXA","link":"https://youtu.be/MJ0OzrkHvXA","imgs":["images/helpdesk/0_mining__hashing_179_0_mining__hashing_maxresdefault.jpg"]},{"text":"Is this the appropriate channel to discuss setting up miners? I just acquired some S9s flashed with BraiinsOS, gunna get tinkering today.."},{"text":"Yeah this is fine. I got my first S9 setup last week!"},{"text":"heck yeah! my machines were flashed with BraiinsOS. I'm trying to make sure I am configuring properly."},{"text":"Same with mine. If you have any questions let me know"},{"text":"Is there a way to split allocations of my hashpower to different pools?"},{"text":"Follow up, can anyone comment on using lincoin pool? \n\nI've heard it's good for when you're mining intermittently because you get paid for your hashpower rather than if your pool finds a block?"},{"text":"1. Yes. Use Quota. Setting quota to 90 for one pool and 10 for another pool splits it 90% / 10%. I'm on braiins dashboard...are you using brains?\n\n2. Never heard of it. But here's a breakdown of the different types of mining payouts. Do what's best for your situation https://medium.com/luxor/mining-pool-payment-methods-pps-vs-pplns-ac699f44149f","link":"https://medium.com/luxor/mining-pool-payment-methods-pps-vs-pplns-ac699f44149f"},{"text":"I send 90% to brains and take a 1 and a million shot (per day) by sending 1 Th/s to soloCK lol"},{"text":"yes I do, I run BOS+"},{"text":"hey I finally have time to tinker tonight, I'm hashing now, just figured out a wifi-repeater set up.. hopefully i can replicate this at my job\n\nhow exactly do I edit the quota? do i need to add the second pool info first?"},{"text":"On the braiins dashboard click Configuration. Then Pool Groups. Create 2 groups. Mode \"quota\" for both. Value 90 for one group and 10 for the other (or whatever percent breakdown you want). Then add one pool to each group"},{"text":"okay, got it! that worked."}]}