{"cat": "Additional Info", "title": "🇦🇹Austrian School of Economics", "desc": "What is the Austrian School of Economics and how does it relate to Bitcoin?", "msgs": [{"text": "What is the Austrian School of Economics and how does it relate to Bitcoin?"}, {"text": "The Austrian methodology operates under the premise that value is subjective. This is the main idea that separates it from the other schools of economics."}, {"text": "Therefore:\nEconomic calculation should be done on an individual level and is something that can not successfully be done objectively by a centralized authority. This leads to the conclusion that individuals themselves should have autonomy over their own life in terms of economic decision making."}, {"text": "This is an anti-government and the decentralization of power stance. Bitcoin fits into this mold perfectly because it is a decentralized currency with no leaders."}, {"text": "And praxeology."}, {"text": "Friedrich Hayek died 17 years before the introduction of the idea he was talking about here. \nhttps://fxtwitter.com/janpaul_f/status/1461596623038038017?t=Q9MkN9kIEO7nsLo2NxMaTg&s=19", "link": "https://fxtwitter.com/janpaul_f/status/1461596623038038017?t=Q9MkN9kIEO7nsLo2NxMaTg&s=19"}, {"text": "Why Every Entrepreneur Should Study the Austrian School of Economics:\nhttps://www.entrepreneur.com/article/395462", "link": "https://www.entrepreneur.com/article/395462", "imgs": ["images/helpdesk/austrian_school_of_economics_131_austrian_school_of_economics_1637012645-GettyImages-1188479329.jpg"]}, {"text": "bump"}, {"text": "\"Creative destruction,\" coined by Austrian American economist Joseph Schumpeter, is the idea that capitalism is fueled by innovation by entrepreneurs that is a destructive force to sustain economic growth, even though it destroyed the value of established companies. New technologies often change what is valuable in a way that is misunderstood by incumbents who have spent years perfecting their own playbook to win markets (sound familiar? Bitcoin is the new technology and central banks are the incumbents)"}, {"text": "Austrian Economists advocate for no government control over our money. As the saying goes, \"Bitcoin fixes this.\" The Austrian theory of money posits that money emerges in a market as the most marketable commodity and most salable asset, the one asset whose holders can sell with the most ease, in favorable conditions."}, {"text": "I had the privilege of attending Mises University in 2004. I found many fascinating arguments and narratives within the halls of the Mises Institute.\nI still concord with many of the conclusions of Austrian school economic theory, but not many of the advocacies of Austrian school economists.\nI consider praxeology the most important tool developed by the Austrian school."}, {"text": "Nobel Prize winning Austrian Economist Friedrich Hayek predicting the emergence of Bitcoin 38 years ago. RIP legend", "imgs": ["images/helpdesk/austrian_school_of_economics_130_friedrich_hayek_quote.jpg"]}, {"text": "Murray Rothbard - Austrian Economist\nhttps://en.wikipedia.org/wiki/Murray_Rothbard\nHis books on Amazon:\nhttps://www.amazon.com/s?k=Murray+Rothbard&linkCode=sl2&linkId=1ccea0cc5a1dfe78b9419180cacb252b&tag=rothbardsuggests-20&ref=as_li_ss_tl", "link": "https://en.wikipedia.org/wiki/Murray_Rothbard"}, {"text": "Austrian School economist ludwig von mises (1881 - 1973) quote on sound money and civil liberties", "imgs": ["images/helpdesk/austrian_school_of_economics_128_ludwig_von_mises_quote.jpg"]}, {"text": "Austrian VS. Keynesian Economics - with Vijay Boyapati\nhttps://www.youtube.com/watch?v=yUCzLWwdQLs", "link": "https://www.youtube.com/watch?v=yUCzLWwdQLs"}, {"text": "Austrian Economist:\nhttps://twitter.com/LawrenceLepard", "link": "https://twitter.com/LawrenceLepard"}, {"text": "Bump"}, {"text": "Ludwig von Mises.\nSocialist calculation problem", "imgs": ["images/helpdesk/austrian_school_of_economics_125_Screenshot_20220406-173840.png"]}, {"text": "Hayek again", "imgs": ["images/helpdesk/austrian_school_of_economics_124_20220408_215446.jpg"]}, {"text": "Praxeology: is the theory of human action, based on the notion that humans engage in purposeful behavior, as opposed to reflexive behavior and other unintentional behavior.\nhttps://en.wikipedia.org/wiki/Praxeology", "link": "https://en.wikipedia.org/wiki/Praxeology"}, {"text": "Promoting Austrian economics, freedom, and peace in the tradition of Ludwig von Mises through research, publishing, and education. IG: misesinstitute\nhttps://mises.org/\nhttps://twitter.com/mises", "link": "https://mises.org/", "imgs": ["images/helpdesk/austrian_school_of_economics_122_austrian_school_of_economics_Mises_1200x630_thumbnail_20190329.jpg"]}, {"text": "https://www.twitter.com/lawrencelepard", "link": "https://www.twitter.com/lawrencelepard"}, {"text": "."}]}