{"cat": "Additional Info", "title": "⏰Block Time-Block-Size", "desc": "Why is a 10 minute block time important?", "msgs": [{"text": "Why is a 10 minute block time important?"}, {"text": "This thread takes aim at countering Litecoin maxis claim that on-chain Litecoin transactions of 2.5 minutes are 4x faster and therefore better than Bitcoin."}, {"text": "Good question/thread topic"}, {"text": "Ten minutes was specifically chosen by Satoshi as a tradeoff between first confirmation time and the amount of work wasted due to chain splits. After a block is mined, it takes time for the other miners to find out about it, and until then they are actually competing against the new block instead of adding to it.\n\nIf someone mines another new block based on the old block chain, the network can only accept one of the two, and all the work that went into the other block gets wasted. For example, if it takes miners 1 minute on average to learn about new blocks, and new blocks come every 10 minutes, then the overall network is wasting about 10% of its work. Lengthening the time between blocks reduces this waste.\n\nhttps://medium.com/@lingyong/why-the-bitcoin-difficulty-is-set-to-10-minutes-per-block-50aaf1d60ae", "link": "https://medium.com/@lingyong/why-the-bitcoin-difficulty-is-set-to-10-minutes-per-block-50aaf1d60ae"}, {"text": "It's all about security. The 10 minute block time ensures more security for those transacting in the block."}, {"text": "Also, Bitcoin is meant to be decentralized. As a result, there needs to be some time for all the nodes in the network to update and be on the correct chain. If the block times were very short, it would be easier to screw with nodes in the network and have them synced to the wrong chain. 10 minutes is more than enough time, but as always, Bitcoin sacrifices speed in certain aspects for security and decentralization."}, {"text": "Exactly. Shorter block times = easier to manipulate the Blockchain. Possibly easier to commit a double spend and not get \"caught\" by a node?"}, {"text": "Sounds right to me. But not exactly sure on the technical implications of it"}, {"text": "I wish Andreas was here. Lol"}, {"text": "⏰Block time"}, {"text": "⏰Block Time"}, {"text": "https://twitter.com/parman_the/status/1473458953182855169?t=JMWiu7IqSUruTN7OIBpBPw&s=19", "link": "https://twitter.com/parman_the/status/1473458953182855169?t=JMWiu7IqSUruTN7OIBpBPw&s=19"}, {"text": "⏰Block Time-Block-Size"}, {"text": "bump"}, {"text": "<@!186696311330832395>"}, {"text": "Also (not advocating) this is why Ethereum can't go below the 15 second timeframe"}, {"text": "and some high block speed chains have problems with wasted blocks or propagation time"}, {"text": "The on chain does not have to be extremely fast when we have LN"}, {"text": "and also too big of blocks would make it unreasonable to self host"}, {"text": "if we had 4x blocks we may have needed 750GB of storage or more"}, {"text": "and then it gets into the more than 1TB range with time"}, {"text": "The 10 minute block time ensures an even network distribution between nodes. This decreases the chances of anything being modified in Bitcoin's consensus network."}, {"text": "Its based on several factors; some being:\n\nthe slowness of onion protocols (privacy)\nthe cap of 52GB/year growth of the blockchain\nthe time it takes to relay a block to the DHT network\nthe time it takes to download 1MB over an inexpensive internet connection (to reduce the head start big server farms would get)\nthe time it takes to announce your block over an even slower connectino and blockhash (domestic internet uplinks are always slower than downlinks, and every miner is trying to solve a different subset of UXTOs, thus a different block).\nIts not simply a matter of \"lets just speed up or slow down the block rate\" or \"lets increase the block size\" without tradeoffs at the expense of decentralization.\n\nThe fact is the blocktime or the blocksize doesn't really matter once its been set. The purpose of the bitcoin blockchain isn't to replace visa and mastercard, its to replace the movement of large amounts of value. It is to enable a trustless backbone upon which other trustless or moderate-trust transactions can take place such as with lightning or liquid."}, {"text": "."}]}