{"cat": "Additional Info", "title": "🏈Game Theory", "desc": "How does game theory apply to Bitcoin?", "msgs": [{"text": "How does game theory apply to Bitcoin?"}, {"text": "said the following:\n\nI think of it as the mathematics/logic of natural selection. Natural selection would be the biological view and game theory is more the mathematical view. \n\nSo something like the simple phrase “eat or be eaten” would be the natural view. And game theory would model those interactions with math.\n\nBitcoin pretty much runs on math and physics, outside the control of any human. So as time progresses, the way it interacts/operates in the world with us humans could be modeled/described through the lense of game theory because it is very predictable if you assume a long enough time frame.\n\nAnd that’s why you’ll hear people say certain things are inevitable. And you can only do that because it is fully decentralized and secured by proof of work. So it can’t be manipulated in ways that can’t be predicted."}, {"text": "Schelling point - In game theory, a focal point (or Schelling point) is a solution that people tend to choose by default in the absence of communication. \nMore: https://en.wikipedia.org/wiki/Focal_point_(game_theory)", "link": "https://en.wikipedia.org/wiki/Focal_point_(game_theory)"}, {"text": "I'm not sure if a \"first principles\" mindset applies to game theory, but I'm putting this here for now. I stumbled upon this article which does a great job at explaining the methodology behind thinking in first principles and why it's valuable to creativity and ingenuity. There are lots of helpful metaphors including coaching sports, Elon Musk's successful career, and the difference between chefs and cooks. https://fs.blog/first-principles/", "link": "https://fs.blog/first-principles/", "imgs": ["images/helpdesk/game_theory_101_game_theory_First-principles.png"]}, {"text": "The \"prisoner's dilemma\" is an example of a non-zero-sum game, where the actions of each player could make their combined situation better without taking from each other. If neither confesses you both get a year for a crime, if you onfesses and the other doesn't, you get 0 years and the other gets 10 years. If you both confess, you both get 5 years in prison."}, {"text": "Game theory examples in real life (as outlined in The Price of Tomorrow book chapter 9)\nCarpool lane (single occupant cars cheat to go faster, but when more and more do it everyone goes slower)\nDoping in sports....bad for your health but athletes and teams think it's worth the risk to gain competitive advantage. Lance Armstrong ex.\nMilitary spending - if no country invested in their military, that money can be used to benefit society. But if one chose to break the rule they get a big advantage."}, {"text": "Group dynamics: what might be better for one person often is worse for the group - ex. Currency manipulation"}, {"text": "Capitalism is known as a dominant cooperative strategy that with the rise of fiat currencies and 2008 bailout eventually failed and led to crony capitalism where the cheaters (banks) were rewarded and won."}, {"text": "Game theory makes us cooperate or betray depending on the incentive or punishment."}, {"text": "https://twitter.com/gametheorizing", "link": "https://twitter.com/gametheorizing"}, {"text": "First principles and game theory:\nhttps://medium.com/@game_theorizing/of-smoke-and-mirrors-part-1-117c1f92e186", "link": "https://medium.com/@game_theorizing/of-smoke-and-mirrors-part-1-117c1f92e186"}, {"text": "Bitcoin was the first system to solve the Byzantine Generals Problem. Although some argue that it only created a \"probabilistic approximation of a solution that is good enough.\"\nhttps://river.com/learn/what-is-the-byzantine-generals-problem/", "link": "https://river.com/learn/what-is-the-byzantine-generals-problem/"}, {"text": "Game theory suggests that governments won't ban Bitcoin because they won't want to deal with it being on the black market and because they also want the tax revenue"}, {"text": "In part one of this series, we examine the game theory of bitcoin, an often mentioned but often misunderstood aspect of bitcoin adoption.\nhttps://bitcoinmagazine.com/culture/the-game-theory-of-bitcoin\n\nPart 2. Thinking about the potential Bitcoin-oriented geopolitical moves to be made only shows the unlimited possibilities of Bitcoin’s game theory.\nhttps://bitcoinmagazine.com/culture/bitcoin-has-endless-possibilities", "link": "https://bitcoinmagazine.com/culture/the-game-theory-of-bitcoin"}, {"text": "Bitcoin Mag full index\nhttps://bitcoinmagazine.com/tags/game-theory", "link": "https://bitcoinmagazine.com/tags/game-theory"}, {"text": "\"Bitcoin is the next Schelling point in terms of warfare. If you don't adopt the next best piece of military technology, you are going to fall behind.\"\nhttps://www.youtube.com/watch?v=VK7YiSkjiJ0 \nFocal point / Schelling point in Game Theory: https://en.wikipedia.org/wiki/Focal_point_(game_theory)", "link": "https://www.youtube.com/watch?v=VK7YiSkjiJ0", "imgs": ["images/helpdesk/game_theory_095_game_theory_maxresdefault.jpg"]}, {"text": "Your government will either adopt Bitcoin or be left out, and being left out will be bad for said government. Game theory at its finest."}, {"text": "By \nhttps://satoshisjournal.com/bitcoin-game-theory-part-i/", "link": "https://satoshisjournal.com/bitcoin-game-theory-part-i/", "imgs": ["images/helpdesk/game_theory_094_game_theory_Bitcoin-Game-Theory.jpg"]}, {"text": "Thanks for sharing my game theory article. Did you know I submitted two game theory articles to BTC Mag? They are within this thread as well. This is my favorite thing to write about 😊"}, {"text": "What?!!! I didn't realize those two were you as well. Brilliant articles. I loved them!"}, {"text": "Honestly they helped me understand GT so well. For about a year I heard the term thrown around and had no clue what it meant."}, {"text": "Thanks! I explain GT in its simplest form. The article I did for SJ was the most \"technical\" and I had Neski review it for me. I will probably draft an even more technical article after I study it from the perspective of Nash"}, {"text": "Looking forward to it"}, {"text": "."}]}