{"cat": "Additional Info", "title": "✅Improved Incentive Structure", "desc": "How does Bitcoin change incentives to benefit civilization?", "msgs": [{"text": "How does Bitcoin change incentives to benefit civilization?"}, {"text": "I like the topic of this thread"}, {"text": "Yes. Super important. I'm going to start adding to it tonight."}, {"text": "✅Improved Incentive Structure"}, {"text": "I got the following from a Tomer Strolight piece called, \"Why Bitcoin?\"\n\nBitcoin incentivises time and work. \n\nTo earn money you have to put in time and work. So for the sake\nof fairness, it should also be the case that the creation of money\nitself takes time and work.\n\nBut this is not the case with national currencies. Any arbitrary\namount of dollars, euros, pesos, pounds, etc.. can be conjured\nout of thin air instantly and with no work. The creation of this\nkind of money is therefore not tied to time and work. And so,\nthis method of the creation of money discourages people from\nworking. It instead encourages people to seek handouts of this\neasy money. This isn’t just welfare for the poor — it is mostly\nhuge handouts for the very rich.\n\nBitcoin fixes this.\n\nCreating bitcoins requires time. Bitcoin, the system, guarantees\nthat bitcoins, its unit of currency, can only be created over a\npreset schedule of time. A small amount of bitcoin is created\nevery ten minutes on average, with that amount getting cut in\nhalf every four years, leading to a maximum supply of 21 million\nbitcoins ever.\n\nAnd creating bitcoins also requires work. Nobody can conjure\nbitcoins without proving that they worked to create them. The\ncreation of bitcoins is a giant competition between workers all\nover the world to win each reward that is won every ten minutes\non average. The more competitors and the more work they do,\nthe harder it gets to win.\n\nSo if you put in your time and your energy to earn money,\nwouldn’t you want to choose a money that also requires the\npeople who create it to have to put in their time and energy too?\nThat money is Bitcoin and it is the only money in the world now\nthat gives fair treatment to people who put in their time and\nenergy to earn money."}, {"text": "I have a feeling you can contribute a lot to this thread. I'd love to see what you have to say. How does Bitcoin change incentives to benefit civilization?"}, {"text": "Bitcoin incentivises clean energy production because it is cheaper to produce clean energy from wind and flared natural gas than from dirty forms like fossil fuels. For more,", "link": "https://discord.com/channels/874318808423219280/874331239081975929/887703643481063424"}, {"text": "Around the 6 minute mark, Alex Gladstein talks about \"aligning incentives\" where NgU (Number go up) meets FgU (Freedom go up), where more greed in Bitcoin inherently leads to more freedom for the people. https://www.youtube.com/watch?v=3xH1vBuDbBA&t=311s", "link": "https://www.youtube.com/watch?v=3xH1vBuDbBA&t=311s", "imgs": ["images/helpdesk/improved_incentive_structure_093_improved_incentive_structure_maxresdefault.jpg"]}, {"text": "Thread backing this up: https://twitter.com/BitcoinIsSaving/status/1456655265714122756?s=20", "link": "https://twitter.com/BitcoinIsSaving/status/1456655265714122756?s=20"}, {"text": "The whole ecosystem of Bitcoin runs on incentives. Ex. miners are incentivized to mine blocks and secure the network because they can earn a block subsidy. They are rewarded for their work. You are incentivized to run your own node because then you can confirm your own transactions and improve your privacy. This helps the network because more nodes means more decentralization."}, {"text": "Value for Value - \"One beautiful thing about this model is that it re-aligns incentives. You are not trying to maximize clicks, or view time, or any other of the countless metrics. You will want to provide value for your audience, and that's it. And if your audience got value out of it, a certain percentage will give back. All you have to do is ask.\" - https://dergigi.com/2021/12/30/the-freedom-of-value/\nPodcasting 2.0 - These podcasts are set up to receive Bitcoin payments in real-time over the Lightning network using compatible https://podcastindex.org/podcast/value4value", "link": "https://dergigi.com/2021/12/30/the-freedom-of-value/", "imgs": ["images/helpdesk/improved_incentive_structure_092_improved_incentive_structure_busking.jpg"]}, {"text": "speaking of - just got on fountain and it's dope. have been on sphinx for a while but i don't listen to many podcasts tbh - i'm interested in releasing mixes on it, the demo lightning set where sats were streamed to the producers of the songs currently playing is one of my favorite demonstrations so far https://twitter.com/fountain_app/status/1503350009294643202", "link": "https://twitter.com/fountain_app/status/1503350009294643202"}, {"text": "https://twitter.com/fountain_app/status/1504582440333070338", "link": "https://twitter.com/fountain_app/status/1504582440333070338"}, {"text": "oh wow that's epic! I'm a DJ hobbyist as well 🙂"}, {"text": "the cross app comments are slick. game changer imo"}, {"text": "trying to find that article about the lightning network dj set"}, {"text": "https://junglelab.net/esky-junglelab-bio/", "link": "https://junglelab.net/esky-junglelab-bio/"}, {"text": "https://twitter.com/DWhitmanBTC/status/1513737788352520194?s=20&t=nO6Lhg0PA7ryVYP-XpVnFA", "link": "https://twitter.com/DWhitmanBTC/status/1513737788352520194?s=20&t=nO6Lhg0PA7ryVYP-XpVnFA"}, {"text": "Oh hey"}, {"text": "Sorry Phil, I had to go because I'm with my parents. I just wanted to support you and say hi."}, {"text": "You will get more people on space once The Bitcoin Council of Autism is over. Lots of Bitcoiners are there. One strategy is to change the title to something enticing like, \"Bitcoin is going to $100,000,000 or something.\". Just some Twitter Strategy"}, {"text": "", "imgs": ["images/helpdesk/improved_incentive_structure_087_incentives_3.png", "images/helpdesk/improved_incentive_structure_088_incentives_2.png"]}, {"text": "Miner, when finds a block (correct hash) cannot broadcast to the network without access to a node. So has another reason to have a node."}, {"text": "Value for value \nhttps://open.spotify.com/episode/1Hl43kgKmEDG0SxTMmbAIZ?si=LJZYiQJpSp-IV5pGZv2HUQ", "link": "https://open.spotify.com/episode/1Hl43kgKmEDG0SxTMmbAIZ?si=LJZYiQJpSp-IV5pGZv2HUQ"}]}