{"cat": "Additional Info", "title": "🌐Scalability", "desc": "said: From my perspective, BTC will never scale well enough to be a global currency. Why do you believe it can? I'm genuinely very intrigued in this...", "msgs": [{"text": "said: From my perspective, BTC will never scale well enough to be a global currency. Why do you believe it can? I'm genuinely very intrigued in this BTC future you imagine."}, {"text": "🌐Scalability"}, {"text": "So I don't think Bitcoin will have any problem scaling. Due to , millions of transactions per second are possible. The lightning network itself is growing exponentially in both nodes and bitcoin (I believe the liquidity now is over 3000 BTC)."}, {"text": "In the future, large transactions (think millions and billions of dollars) will be done on the base layer. The elite and large institutions will use the base layer because it is technically more secure (I think). They wont mind waiting for their transactions to clear as long as they have faith that everything will be fine with their money.\n\nDay-to-day \"cup of coffee transactions\" will take place on Lightning."}, {"text": "would love for you guys to weigh in here"}, {"text": "Yeah I agree with Phil. I’m just starting to learn Bitcoin on a technical level so I can understand the programming of lighting. But as a concept and seeing how it’s scaling now is fascinating to me. I think it’s a really interesting second layer structure."}, {"text": "Yeah, if you've never used lightning I can send you some sats via Lightning so you can see how fast it is for yourself!"}, {"text": "It’s secured by the base chain without needing to transact on it for instant settlement. Very cool"}, {"text": "Yeah, so I'm not confident on my statement above regarding large transactions. Since the security of lighting is the same as the base layer. What is the benefit of doing a large transaction on the base layer? There is a reason why you want to do billion dollar transactions on the base layer...I'm just not remembering"}, {"text": "The things that are built on top of Bitcoin are going to be so interesting. Lightning is just the start"}, {"text": "Ah, now that I think of it it must be the benefit of final settlement. After 3 confirmations (three mined blocks, typically 30 minutes), it is mathematically guaranteed that your transaction is final and settled."}, {"text": "I guess theoretically one could stay on lightning one’s entire life. But at some point, you will value the security of final settlement on the blockchain."}, {"text": "It’ll be a market. At some point you’ll have to weigh how much you value that security. Because it will more than pennies at some point"}, {"text": "True. Lightning transactions are NOT recorded on the blockchain. I learned that recently. Good point"}, {"text": "I have used lightning"}, {"text": "Recently actually"}, {"text": "My friend sent me some sats"}, {"text": "What wallet did you use?"}, {"text": "It is extremely fast I have to say"}, {"text": "I see the potential"}, {"text": "The more channels that are open, the greater the network effect will be"}, {"text": "Some dodgy wallet, we weren't sending a lot of sats so not a big deal"}, {"text": "About $3"}, {"text": "Check this out \nLightning Network Channel connections\nvia: https://lnrouter.app/graph", "link": "https://lnrouter.app/graph", "imgs": ["images/helpdesk/scalability_076_scalability_twitter_image.png"]}, {"text": "Takes a bit to load but it's cool"}, {"text": "Series of Lightning Channel charts in this thread:\nhttps://twitter.com/PrestonPysh/status/1448353757394309124?t=mA8l5Slgo1fFpRr8UEd0eQ&s=19", "link": "https://twitter.com/PrestonPysh/status/1448353757394309124?t=mA8l5Slgo1fFpRr8UEd0eQ&s=19"}, {"text": "this was about a month ago so it's gone up", "imgs": ["images/helpdesk/scalability_074_lightning_capacity.jpg"]}, {"text": "Growing FAST"}, {"text": "Setting up nodes on lightning is arguablely more valuable for the lightning network than setting up nodes for Bitcoin at this point. How channels work and how sats are sent actually use the network."}, {"text": "Oh that's interesting. I have heard that you should first set up a Bitcoin node, then you actually \"add to it\" to make it a Lightning node"}, {"text": "I'm probably going with the Umbral route. At least to start. I'm not willing at the moment to go through the technicals to set one up myself otherwise. I heard Umbral is easy"}, {"text": "That’s just my opinion, idk if I’m right. But I’ve seen people talk about how Bitcoin nodes only serve yourself at this point for you to verify your own transactions. The network itself doesn’t care if you have a node or not. Technically only 1 Bitcoin node needs to exist and it can work."}, {"text": "I think the logic makes sense"}, {"text": "I see where you're coming from. Well, the more nodes, the greater the decentralization and lower chance of network going offline. Although at this point I think we're fine haha"}, {"text": "Yeah for sure. The argument is that now the Bitcoin network is over secure and sufficiently decentralized"}, {"text": "So any more nodes coming online now don’t add as much to the network as adding nodes earlier in its life"}, {"text": "But the sats on lightning are actually using the nodes and channels. So that’s pretty cool"}, {"text": "A better way to say what I meant: you should always have a Bitcoin node (so I agree with you Phil). But you only technically need to turn the node on when you need to send transactions. Having the node on constantly doesn’t add value to the network in it of itself. Does that make sense?"}, {"text": "Yeah that makes sense."}, {"text": "So in that sense, that’s what I meant when I said that the node is more valuable to the lightning network than the Bitcoin network."}, {"text": "Yeah, so a node's function is to verify the transactions put into the block by the miner. But what's the difference between 10,000 nodes verifying and 10,001? Meanwhile, a lightning nodes function is to create liquidity and faster transactions in the lightning network. More of those if definitely valuable. Is that in line with your thinking, ?"}, {"text": "Yeah, well said. I like that framing"}, {"text": "I don't think we can imagine what's going to come about. Lightning may be the micropayments solution for day-to-day spending, but I don't have the kind of confidence that many others do. I don't have nearly the same confidence in lightning as I do in bitcoin generally."}, {"text": "I think fedimint will change the game"}, {"text": "I don't think any one thing will change the game, but eventually a bunch of things together will"}, {"text": "lots of potential upgrades coming https://bitcoinmagazine.com/technical/2020-and-beyond-bitcoins-potential-protocol-upgrades", "link": "https://bitcoinmagazine.com/technical/2020-and-beyond-bitcoins-potential-protocol-upgrades"}, {"text": "also this is just over the last 2 years...", "imgs": ["images/helpdesk/scalability_072_lightning_ecosystem.jpg"]}, {"text": "someone could find a similar chart for Web3.0"}, {"text": "yeah? but that's trash lol"}]}