{"cat": "Additional Info", "title": "Softwar", "desc": "What is Jason Lowery's Softwar thesis?", "msgs": [{"text": "What is Jason Lowery's Softwar thesis?"}, {"text": "Jason Lowery's SOFTWAR thesis is a novel framework to understand Bitcoin through a first principles, grounded methodology, and systems thinking approach as first and foremost an emerging power projection technology with significant national strategic implications.\n\nI will now begin a summary of each chapter of his thesis explaining the main core concepts of Power Projection Theory and Bitcoins place within it."}, {"text": "Chapters 3, 4, and 5 are the actual content of his theory and will be the main focus of this summary. I will be directly quoting the thesis and listing specific chapters, sections, and sub-sections while trying to summarize it as best as I can.\n\n<b>Chapter 3 Power Projection Tactics in Nature</b>\n\n\"To understand the sociotechnical and national strategic signifigance of Bitcoin, it is first necessary to develop a first principles understanding of the primary value-delivered function of physical power projection. A mental model is needed of how physical power projection works, why it works, and what its primary value-delivered function is for the organisms which master it.\"\n\n3.2 Physical Power & Resource Ownership\n\n3.2.1 Proof-of Power is Proof-of-Ownership\n\n\"Since the dawn of life on Earth, organisms have evolved increasingly more creative ways to project physical power to settle disputes, secure control authority over resources, achieve consensus on the state of ownership ad chain of custody of property, and establish dominance hierarchies (a.k.a. pecking order). The control authority over Earth's natural resources that many plants and animals enjoy todday appears to be the byproduct of energy exerted over time (joules/sec). This would imply that property ownership has a physical signature that can be denominated in watts.\"\n\n\"Watts signal ownership. Organisms determine what they own based not on what they say, but on what they do - how they project their watts.\"\n\n\"When an organism stops using watts to secure their access to a resource, their perceived ownership of that resource disappears.\""}, {"text": "\"The property rights we enjoy today exist because people were willing to project lots of physical power to claim and maintain those rights. Without the expenditure of watts by living things to secure access to precious resources, living creatures are unable to perceive a resource as being something's property in the first place. Without physical power, resources are either perceived to be unclaimed (therefore not property), or resource ownership is purely an abstract construct that manifests as a belief system - belief systems which can be ignored, exploited or considered illegitimate.\""}, {"text": "3.2.2 Signaling Ownership by Showing One's Capacity and Inclination to Impose Severe Physical Costs", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "A Wolf's capacity and willingness to impose severe physical costs to secure her access to freshly hunted meat is displayed via her snarl, and it would likely leave a clear impression on the reader. There are two things to be noted about this display. The first is that her power projection capacity is physically quantifiable. With the right sensors, we could measure her capacity to project power in watts. The second thing about this display is the fact that those watts are the only independently verifiable and objective signal of ownership based in physical reality. Her ownership of the meat manifests itself through the power she projects to secure her access to the meat. That snarl serves as her certificate of ownership. In other words, her proof-of-power is her proof-of-ownership.\n\n\"Without her physical projection of power, there is no physical signature from which we can perceive or denominate her ownership of the meat.\"\n\n\"Since physical power is the only part of the phenomenon of property ownership that appears to be based in shared objective physical reality, physical power competitions are the only non-imaginary way for organisms with no belief systems or conflicting belief systems to resolve disputes about property ownership.\""}, {"text": "3.3 Life's War against Entropy\n\n3.3.1 To Live is to Project Power\n\n\"Among the first resources that would likely qualify as being owned by life were mineral-rich deposits of nutrients captured from deep-sea hydrothermal vents shortly after the formation of oceans around four billion years ago. Life's first major power projection technology wasn't sharp teeth like what we saw with the example of the wolf in the previous section. Instead, it was a pressurized membrane - little more than a bubble. A pressurized membrane is a wall or thin mass stretched across a volume that exerts force to displace surrounding mass, as illustrated in Figure 9. when external forces from the environment contact a membrane, the membrane exploits Newton's third law to passively project opposing forces back at the environment to displace the mass of the surrounding volume.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Early life forms \"owned\" deep-sea hydrothermal nutrients for the same reason a wolf \"owns\" meat: because they had the capacity and inclination to project physical power to succesfully capture and secure their access to it. Since these first little organisms emerged, life's pressurize membrane power projection tactic has evolved and taken many different complex forms over the past four billion years, but the function has not changed. From microscopic bubbles, to armor, to castle walls, to militarized national borders, all pressurized membranes work the same way: they passively project physical power to gain and maintain access to precious resources. These resources are captured by force. Period.\"\n\n\"Abiogenesis reminds us that living is an act of projecting physical power to capture physical resources. Life physically captures the oxygen it breathes by force. Life physically captures the food it eats by force. Life physically captures the volume it occupies by force. What life needs to survive is \"owned\" for no other reason than the fact that life has the capacity and inclinationto project power to capture it. A quick glance into the night sky reminds us that the universe does not owe us our lives; we have what we have because we take it using physical power. As discussed in chapter 4, the rest of what we believe about resource ownership is abstract.\""}, {"text": "3.3.2 To Live is to Convert Chaos into Structure\n\n\"The emergent behavior of life is something remarkable. By projecting lots of physical power to capture and secure access to resources, life is miraculously able to turn the inexorable chaos of the universe into something more structured. It then leverages that structure to exert more more physical power to capture more resources and convert those resources into even more structure. Life owes its existence and prosperity to this process. Few things are as aligned with the fundamental nature of all living things than this physical power projection process through which organisms secure access to resources and then use those resources to build additional structures, for no other discernable reason than to simply improve its ability to countervail entropy and survive a little longer.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Under the protection of their pressurized membranes, these new global superpowers were able to form highly complex internal microorganic economies, Subcellular molecules self-assembled into increasingly more specialized workforces, trading various microorganic good and services and becoming ever more efficient, productive, and resource abundant. Through this special combination of robust membrane power projection and high-functioning internal economy, life was able to follow a multistep biochemical path towards ever-increasing structure until it managed to build complex massive-scale economies we now call single-celled bacteria.\""}, {"text": "3.4 Primordial Economics\n\n3.4.1 Benefit-to-Cost Ratio of Attack\n\nthis is an incredbly important concept to grasp going forward into the rest of this thesis.\n\n\"Every organism could be described as a nutrient-rich bounty of precious resources. Inside every organism are the building blocks necessary to create other organisms. For this reason, most organisms represent an attractive target of opportunity for other organisms to do what we have established that life does demonstrably well: capture with force. Consequently, a weak, docile, or ineffectual nutrient-abundant organism is essentially a floating gift basket of vital resources for neighboring life forms to devour. This is because of the primordial economic dynamics shown in Figure 11.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Every organism can be attacked; therefore, every organism has a BCRa. An organism's BCRa is a simple fraction determined by two variables: the benefit of attacking it (Ba) and the cost of attacking it (Ca). Ba is a function of how resource abundant an organism is. Organisms with with lots of precious resources have high Ba. Organisms with less precious resources have lower Ba. On the flip side of the equation, Ca is a function of how capable and willing an organism is at imposing severe physical costs on attackers. Organisms capable of and willing to impose a severe physical costs on neighboring organisms have high Ca. Organisms that are not capable of or willing to impose severe physical costs on neighboring organisms have low Ca.\""}, {"text": "\"Higher BCRa organisms are more vulnerable to attack than lower BCRa organisms because they offer a higher return on investment for hungry neighbors to devour. Organisms therefore have an existential imperative to lower their BCRa as much as they can afford to do so by increasing their capacity and inclination to impose severe physical costs on neighboring organisms. An organism can't just devote all their time and energy towards increasing their resource abundance and expect to prosper for long, because doing so would cause their BCRa to climb and jeopardize their chances of long-term survival.\"\n\n\"To survive, organisms must manage both sides of their BCRa equation. To prevent their BCRa from climbing to hazardous levels, organisms must shrink their numerator or grow their denominator. They must either decrease their resource abundance to decrease their Ba or grow their Ca by increasing their capacity and inclination to impose physical cost on attackers. Decreasing resource abundance is not an ideal solution for organisms seeking to grow, so increasing Ca(i.e. increasing the denominator) is a preferable option. If organisms choose to grow the denominator, they must grow Ca at an equal or higher rate than the rate at which their Ba increases, or else BCRa will climb.\""}, {"text": "3.4.2 Lower Benefit-to-Cost Ratio of Attack means higher Prosperity Margin\n\n\"A simple way to visualize the primordial economic dynamics of survival is shown in Figure 12. To survive, an organism must keep their BCRA level lower than a hazardous BCRa level that would motivate neighboring life to attack them. The space in between the organism's BCRa level and the hazardous BCRa level can be called the prosperity margin. This margin indicates how much an organism can afford to increase its BCRa before it risks being attacked.\"\n\n\"Primordial economic dynamics seem simple and straightforward, but there's a catch. There's not really any way for organisms to know how large their prosperity region is because they don't know exactly what level of BCRa would qualify as being hazardous. How hazardous a BCRa level is depends almost entirely on factors outside of an organism's sigh and control. This is because it depends on external circumstances within the environment. If neighboring organisms(i.e. potential attackers) choose to grow their Ca to lower their BCRa then the hazardous BCRa for that environment drops and the organisms which don't lower their own BCRa lose prosperity margin. this, the same organism with the same BCRa could have two completely different prosperity margins based exclusively on the conditions of the environment wihch the organism can neither see nor control. This phenomenon is illustrated in Figure 12.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Organisms operating in empty neighborhoods have intrinsically higher prosperity margin than organisms operating in environments filled with neighboring life. With that surplus of margin, they can devote more time and energy towards boosting their resource abundance (thus increasing Ba) and increasing BCRa without having to focus much attention on growing Ca. they simply don't have to worry about their BCRa as much because there's nothing around to attack them (hence animals like manatees).\"\n\n\"Environments tend to change, however - sometimes quickly. They become congested; they fill up with a lot of other organisms. When environments become congested, they become contested; organisms increasingly oppose one another's attempts to access the same limited resources. As environments become more contested, they become more competitive; organisms seek to gain an advantage over each other. While all of this is happening, environments remain intrinsically hostile; entropy is a constant, looming threat. And if entropy doesn't attempt to kill an organism, a hungry neighbor will undoubtedly try to devour it. Add these factors together and we get the type of environment all organisms live in today: congested, contested, competive, and hostile (CCCH) environments.\""}, {"text": "\"Organisms can try to move to different environments that naturally afford a higher prosperity margin, but wherever life goes, other life inevitably follows, making the new environment CCCH as well. Consequently, finding a non-CCCH environment is not really an option. Survival becomes a task in learning how to adapt to the local environment by learning how to throttle down BCRa and buy oneself as much prosperity margin as possible. Different organisms have different successes at this task. Figure 13 illustrates how organisms which succeed at lowering their BCRa level enjoy more prosperity margin.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "3.5 Innovate or Die\n\n3.5.1 The Rise of Predation\n\n\"A predator is a proactive primordial economist. Predators are BCRa bargain shoppers who hunt down the best BCRa deals within their local environment. Armed with dual-use power projection technologies like whips, tails, and mouths, life's early predators mastered the art of BCRa bargain shopping by swimming around and eating resource-abundant organisms with the highest BCRa levels. As oceans gave rise to more of these BCRa bargain shoppers, neighborhoods became increasingly more CCCH. Organisms which developed the most effective dual-use power projection tactics for their neighborhood became what we call apex predator. Organisms which couldn't buy themselves enough prosperity margin to adapt to their new environment were promptly devoured by these apex predators, as illustrated in Figure 14 below.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Some might say predation is a negative phenomenon because of how murderous and fratricidal it appears to be. This assertion is based purely on human ideology. From a systemic perspective, predation has benefits for life. In sufficient moderation, predation acts life a filter that weeds out life's most unfit and unadaptable organisms. By passing organisms through this filer, life revectors Earth's precious limited resources awat from its worst prosperity-margin-growers towards its best prosperity-margin-growers, consequently buying more prosperity margin for life as a whole. In other words, the stronger and more adaptable organisms become at surviving against predation, the more capable life itself becomes at surviving against entropy.\""}, {"text": "3.5.2 We Owe our Lives to the Ecological Arms Race caused by Predation\n\n\"Endothermy serves as a great example of the complex emergent benefits of predation. Around 250 million years ago, life above the surface of the Earth was very CCCH due to the Permian-Triassic mass extinction. Organisms couldn't afford to spend a lot of time out in the open because of harsh conditions caused by predation and entropy. This presented a challenge for organisms seeking to regulate their body temperature. Not spending a lot of time on the surface means not being able to capture an important resource from the sun: heat. Shrew-like organisms like the one shown in Figure 15 were able to overcome this challenge thanks to biological mutations which allowed their bodies to actively produce their own heat by metabolizing fats and sugars in their food. This power projection tactic is called endothermic body heating, or warm blood.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Why would an organism volunteer to compete over scarce watts and then burn those watts just to heat themselves when they have the more energy-efficient option of receiving heat passively for free? The answer is because they live in a CCCH environment filled with predators and entropy. If organisms don't learn how to warm their bodies underground where it's safe, they must go above the surface during the daytime where predators eagerly wait to devour them. With warm blood, organisms can keep themselves warm and safe underground during the heat of the day when their natural predators are out heating themselves. Endothermic weaseals can therefore save their resource-capturing activities for the night, after the sun goes down and their ectothermic predators are less likely to see and devour them.\""}, {"text": "\"Cold-blooded ectothermic body heating is indeed a more energy-efficient design - except when the sun stops shining and the world's free fuel supply of heat suddenly disappears. 66 million years ago, Earth's biggest, strongest, and most energy-efficient organisms learned the hard way that survival is not strictly about optimizing energy efficiency; it's also about adapting to a harsh environment. To be more specific, survival is about not freezing to death when entropy throws a 7.5-mile-wide asteroid at Earth sixteen times faster than a bullet, creating such a large debris cloud that direct sunlight didn't reach the surface of the Earth for years. Can the reader guess what power projection tactics are useful in that environment? Self-warming vlood and the full suite of improved speed, eyesight, intelligence, and other capabilities developed during the ecological arms race between endothermic predators and prey.\""}, {"text": "3.6 The Survivor's Dilemma\n\n3.6.1 Survival is not a Birthright; it must be Earned\n\n\"Survival and prosperity do not appear to be birthrights. Nothing in our observations of the universe indicates that life on Earth has an inherant right to live or to keep living. This would imply that survival is an act of earning life's seat at the table by countervailing the formidable entropy of the universe. The key to accomplishing this daunting task is for life to innovate and develop increasingly clever power projection tactics, techniques, and technologies. The power we project must be used to capture the precious resources we need to survive, because the universe does not appear to be inclined to part with them otherwise. The power we project must also be used to continually secure out access to those resources, because predators and entropy seems to always want to take them.\"\n\n\"Nature gives us abundant supporting evidence to indicate that the more organisms battle with each other, the more they develop better power projection tactics which help them lower their BCRa and grow their prosperity margin. On a planetary scale, this helps life vector its precious resources to its best survivors. Food, energy, and territory flow to the fittest - those which prove their capacity to countervail entropy. It's as if life uses predation as a testing environmentto try out and incubate differant power projection tactics in a controlled environment, so that when the next meteor hits, it's better prepared.\""}, {"text": "\"Unfortunately, nature's process of compelling life to overcome the innovator's dilemma seems to have led to yet another dilemma, on that has driven sapiens to the brink of self-destruction via nuclear annihilation (more on this in the next chapter). The author calls this dilemma the survivor's dilemma.\""}, {"text": "3.6.2 Organisms Have No Way of Knowing How Secure is Secure Enough, Creating a Survivor's Dilemma \n\n\"As previously discussed, organisms must ensure their BCRa levels stay below the environment's hazardous BCRa level to survive and prosper. Every local environment has a BCRa level which qualifies as hazardous, serving as a threshold where an organism is virtually guaranteed to be attacked. This level changes depending on the environment and organisms can increase their chances of survival if they adjust their own BCRa so that it stays below the environment's hazardous BCRa level. The farther an organism's BCRa level is below the hazardous BCRa level, the better. These dynamics are illustrated in Figure 16.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Keeping one's BCRa below the hazardous BCRa level seems straightforward, but it's challenging because organisms don't know what the hazardous BCRa level is. That level is a moving target; it changes depending on conditions outside of what organisms can see or control. They can only guess how far they can afford to raise their BCRa before they put themselves in a hazardous state. To make matters even more complicated, the hazardous BCRa level tends to drop as the environment becomes increasingly more predatory and CCCH, and the rate at which it drops is also unknown. This means <b>organisms don't know how much prosperity margin they have, nor how quickly it's shrinking.</b>\""}, {"text": "3.6.4 The Strategic Schelling Point is to Continuously Decrease the Benefit-to-Cost Ratio of Attack\n\n\"The survivor's dilemma represents the same fundamental challenges as national strategic security: there's no way to know how much security is *enough* security. A nation can only guess how much security they need based on the intelligence they can collect about their opponent's power projection capabilities, but the only way for a nation to know for sure that they haven't dedicated enough resources towards security is the hard way. This is the same dilemma that all organisms face, no matter what kind of organism they are and no matter what they think about primordial economics. The organisms which survive are the ones that adopt the Schelling point of lowering BCRa as consistently and as affordably as possible. In other words, <b>the organisms which survive are the ones who learn to continuously maximize their capacity and inclination to impose severe physical costs on their neighbors.</b>\""}, {"text": "3.6.5 The Survivor's Dilemma Explains why Nature's Top Survivors are so Powerful and Mean-Looking\n\n\"Have you ever stopped to consider *why* top-performers in nature look the way they do? Why aren't nature's top-performers consistently fat, soft, and docile? Once we understand primordial economic game theory, it makes perfect sense why Earth's top performers keep converging on the same characteristics despite being sepearated by vast quantities of time and distance. We can't allow ourselves to overlook the fact that what we observe in nature s incontrovertibly what survives in nature. The fact that life's top survivors keep converging into the same lean, mean, fighting machines is probably not a coincidence; to believe otherwise is to be guilty of survivorship bias (more on this later). Nature is clearly telling us something. It seems to be telling us that emphasis on Ca matters, and it matters quite a lot. It tells us that <b>organisms who burn watts to increase Ca are organisms which survive</b>. It tells us that if we want to prosper and grow, we need to become sharper, both physically and intellectually.\""}, {"text": "3.7 Chasing Infinite Prosperity\n\n3.7.1 Illustrating the Survivor's Dilemma using Bowtie Notation\n\n\"As discussed in the previous section, a core challenge associated with living in a CCCH envinronment is growing one's resource abundance (thus increasing Ba) without making oneself an attractive target of opportunity for predators to devour (i.e. without increasing BCRa or shrinking prosperity margin). To overcome this challenge, organisms have three options for responding to the survivor's dilemma outline in the previous section. We can revisit these options and gain further insight using bowtie notation, as shown in Figure 18.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "Option #1 increases benefit of attack more than cost of attack, leading to being devoured.\n\nOption #2 grows Ba and Ca at an equivalent rate. The advantage of this strategy is being able to increase resource abundance without increasing one's BCRa. The problem with this strategy is that as an environment becomes more CCCH, the prosperity margin shrinks.\n\nOption #3 is the strategy of an organism increasing it's ability to impose severe physical cost on attackers faster than it grows it's resource abundance. The fact that predators choose *not* to devour this target is proof that the energy expended to increase the organism's Ca was not wasted energy; it was worth every watt.\"\n\n\"Out of these options, #3 has the highest probability of long-term surivval because it minimizes the organism's BCRa and results in the largest prosperity margin.\""}, {"text": "3.7.2 An Infinitely Prosperous Organism is One that can Increase Ca ad infinitum\n\n\"The purpose of conceptualizing an infinitely prosperous organism is to generate the following insight: <b>the key to survival, resource abundance, freedom, and prosperity is to maximize your ability to impose severe physical costs on neighbors.</b> This insight helps us understand the dynamics of primordial economics and the resulting emergent behavior of life at increasing scales. The resource abundance enjoyed by all organisms, organizations, and civilizations alike are simply the byproducts of life aspiring to become an infinitely prosperous organism. <b>We owe our survival, resource abundance, freedom, and prosperity to our physical power projectors who burn watts to increase our Ca and decrease our BCRa.</b>\"\n\n\"Through this lens, a macroscopic topic as complez as national strategic security can be simplified down to a simple illustration. All of the power projection tactics employed by sapiens are merely a higher-scale version of the same type of power projection tactics that first emerged during abiogenesis. The lessons of survival are exactly the same, whether we're talking about bacteria, nation states, or anything in between.\""}, {"text": "3.8 Sticking Together\n\n3.8.1 Hitting a Bounded Prosperity Trap\n\n\"With the survivor's dilemma fresh in out minds, let's turn back to the example of bacterial predators. For nearly 2 billion years, life existed as a murderous and fratricidal soup of single-celled organisims. Under the stress of their environment, bacteria invented different power projection tactics until they eventually stumbled upon a way to mitigate one of life's biggest exogenous threats: the relentless bombardment of radiation from the Sun. *\"As a means of defense,\"* biologist Henry Gee writes, some bacteria *\"evolved pigments to absorb these harmful rays. Once their energy had been absorbed, it could be put to work... cyanobacteria used it to drive chemical reactions. Some of these fused carbon, hydrogen, and oxygen atoms together to create augars and starch. This is the process we call photosynthesis. Harm had become harvest.\"*"}, {"text": "\"Existing as nothing but a murderous, fratricidal, and burning soup of single-celled organisms, the state of life around two billion years ago could be described as a *bounded prosperity trap*. <b>The author defines a bounded prosperity trap as a situation where the inability to sufficiently grow Ca causes an organism to be unable to grow their prosperity margin any further, and they become trapped within either a fixed or shrinking margin of prosperity.</b>\"\n\n\"Having a bounded prosperity margin means an organism can no longer grow its resource abundance without automatically causing its prosperity margin to shrink to the point of being devouredby the local CCCH environment. <b>Bounded prosperity traps show that when organisms hit a ceiling on their ability to project power, it translates directly into a degradation in prosperity. The ability to counterveil entropy is severely degraded or halted altogether, and progress plateaus.</b>\""}, {"text": "\"Life plateaued at the single-cellular level as it struggled to overcome its CCCH environment. It hit a barrier on its ability to scale its power projection capacity to lower BCRa and countervail entropy. Fortunately, as Plato observed, life's needs are its creator (the modern form of this expression is *\"necessity is the mother of invention\"*). Through continuous iteration, life managed to find the power proection tactics it needed to overcome this plateau and escape its bounded prosperity trap. Among those innovations was another one of the most effective power projection tactics ever discovered: cooperation.\""}, {"text": "3.8.2 Projecting More Power by Summing it Together\n\n\"Organisms didn't decide to stick together because of their desire for a better future. As best as we can tell, bacteria are incapable of understanding abstract concepts like *the future*. Cells didn't wake up and deicde to turn off their predatory nature and begin cooperating becuase they suddenly felt bad about billions of years of murder and fratricide. They also didn't start cooperating because they believed teamwork and interdependence could lead to a greater good for all single-celled kind. On the contrary, the reason why cells first started sticking together was because *they were literally stuck together.*\"\n\n\"This phenomenon explains why <b>one of the most common forms of attack in nature is a colonization attack. Individual organisms simply act in their own self-interest to capture a small piece of territory for themselves and defend their access to it. They don't need to be intentionally working together or conscious of what's happening to execute this strategy, they just need to have aligned self-interests.</b>"}, {"text": "3.8.3 Cooperation is First and Foremost a Physical Power Projection Tactic\n\n\"These colonies of clustered cells grew increasingly more interdependent and reliant on each other for vital nutrients, materials, and gene swapping. They were able to form highly complex structures, self-assembling into increasingly more specialized workforces, trading various organic goods and services and becoming ever more efficient, productive, and resource abundant. Through this special combination of robust membrane power projection, security, and high-functioning internal economy, life was able to follow a multistep biological path towards ever-increasing structure until it managed to self-assemble into complex, massive-scale economies we now call multicellular life.\"\n\n\"the takeaway: <b>Cooperation is a physical power projection tactic that emerged unconsciously, useful first and foremost for its ability to help organisms survive longer by summing their Ca together to decrease their BCRa and buy them more prosperity margin</b>. Muticellular life and its remarkable levels of interdependence can be described as the byproduct of organisms simply having to occupy the same space or by inventing power projectiontactics to physically capture and entrap their neighbors. By entrapping neighboring organisms for their nutrients, archaeon inadvertently discovered how to tap into their neighbor's physical power projection capacity to buy themselves more prosperity margin for comparatively little effort.\""}, {"text": "3.8.4 \"Cooperate or Die Survival Dynamics\n\n\"We have established that the survivor's dilemma gives organisms a strategic imperative to grow Ca as fast as possible. They can grow Ca individually by discovering innovative new ways to impose physically prohibitive costs on attackers all on their own, but this requires them to spend their own watts. Alternatively, organisms can grow Ca without having to spend their own watts, simply by learning how to cooperate with neighbors and sum their Ca together as if they were a single, cohesive organism. In both cases, organisms execute the option #3 strategy where they grow Ca first to buy themselves enough prosperity margin to grow Ba without the threat of raising their BCRa to hazardous levels, enabling them to increase resource abundance and survive in a CCCH environment filled with predators and entropy. These can be illustrated in bowtie notation, as shown in Figure 19 below.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Now let's consider a multistep scneario whee twelve different organisms with different BCRa levels live together within a highly CCCH environment. Let's call this scenario the \"Bigger Fish\" scenario and illustrate it in bowtie notation using Figure 20.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"<b>Cooperation started its own ecological arms race by giving rise to a self-reinforcing feedback loop where the discovery of increasingly more effective cooperation tactics begets the need for increasingly more effective cooperation tactics</b>. If your murderous and fratricidal neighbors figure out how to cooperate at scale, then you better figure out an equal or better form of cooperation, or else you could become their dinner, It might not be feasible for you to grow your Ca by 100X to fend off an army of 100 cooperating cells on your own. But it *is* feasible for you to raise your own army of 100 cells. Cooperation is therefore a strategic imperative because of the survivor's dilemma.\""}, {"text": "3.9 Pack Animals\n\n3.9.1 Keeping up with the Joneses: New Power Projection Tactics Create New Schelling Points\n\n\"Primordial economics accounts for innumerable power projection tactics employed by plants, animals, and other multicellular eukaryotic organisms. A tiger's striples, for example, help it capture resources more effectively by closing the animal's attack distance on prey. A zebra's stripes help it impose more physically prohibitive cost on attackers by degrading their attacker's visual targeting capability. Camouflage is therefore a dua;-use power projection technology which enables animals to affect both sides of their BCRa equation. It's therefore not surprising that many of life's top survivor's utilize camouflage.\"\n\n\"Whenever a new power projection tactic is successful, it often becomes a focal point. Absent the ability to trust your neighbor or leave the neighborhood, it's in your best interest to ensure your power projection capabilities match or exceed your neighbor's. If your neighbors can use their fancy new power projection technology to grow their Ca faster than you can, that means you could become the organism with the highest BCRa in the neighborhood, which means you become the most attrative target of opportunity for your neighbors to devour. The survivor's dilemma creates a \"keeping up with the joneses\" effect where it becomes existentially necessary to stay on par with the power projection capacity of your neighbors.\""}, {"text": "3.9.2 Same Functions, Different Forms\n\n\"We can look back at our biological history and observe that <b>many of life's most successful evolutions were significant because of ow they helped life execute these proven power projection strategies more effectively or on larger scales</b>. Many of them appear to be functional repeats of the same dual-use power projection tactics discovered billions of years ago by our pioneering, microscopic ancestors. The wolf's snarling mouth is a more complex and higher-scale functional repeat of phagocytosis. Other power projection tactics like pressurized membreanes have too many functional repeats to count. We give them different names like *bark* or *epidermis* depending on the species they protect, but their function is practically identical.\"\n\n\"What specifically is the function of life? This is impossible to know. Perhaps it is simply to countervail the entropy of the universe. If we accept this, then consider what sub-functions are necessary to countervail entropy. To countervail entropy, life must learn how to survive and prosper. If we accept this, then consider what sub-functions are necessary to survive and prosper. To survive and prosper, life must grow its Ca to lower its BCRa as much as possible and buy itself as much prosperity margin as it can afford using scarve natural resources. This will allow it to grow and thrive in a reality that is incontrovertibly congested, contested, competitive, and hostile, teeming with predators. If, for the sake of argument, we accept these assertions, then we can't overlook the fact that <b>survivorship, prosperity, and the ability to countervail entropy all depend on the exact same activity: burning watts to grow Ca as much as possible</b>.\""}, {"text": "3.9.3 Organizations have the Same Power Projection Dynamics as Organisms\n\n\"The strategic imperative to grow Ca by tapping into the exogenous power supply of one's neighborsexplains why life's top survivors became so inclined to cooperate. The phenomenon of cooperation has emerged at every biological scale: subcellular, cellular, multicellular, multi organism, and even multi species. When multiple organisms tap into each other's power projection supply, they form a single cohesive unit called an *organization*. An organizationis a larger form of an organism, no different than how multiple subceullar microorganic compounds organize to form a single cell, or how multiple cells organize to form a single multicellular organism. We can therefore account for an organizaion's BCRa in the same way that we account for an organism's BCRa. We can also represent it the same way in bowtie notation, as shown in Figure 24.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"Despite its benefits, cooperation isn't easy. Pack animals have their own individual brains. Individual members of every pack have their own individual needs and priorities independent of the pack's collective priorities. <b>To cooperate at a large scale, pack animals must learn how to negotiate between their individual needs and the needs of the pack as a whole. Navigating this becomes especially tricky when it comes to feeding and breeding. Compromises must be made between the individual's needs and the pack's needs regarding resource control and ownership. Packs myst adopt heuristics for determining the state of ownership and chain of custody of the pack's collective resources between and among pack members</b>. This is called establishing a dominance hierarchy, or more colloquially known as a \"pecking order.\"\""}, {"text": "3.10 Domestication is Dangerous\n\n3.10.1 Disclaimer #1 - This Subject Hits Close to Home\n\n\"This section lays the conceptual bedrock for understanding complex social behavior in pack animals, how they establish dominance hierarchies, settle intraspecies disputes, establish control authority over limited resources, and achieve consensus on the legitimate state of ownership and chain of custody of property.\"\n\n\"For the sake of formulating a cohesive and conceptually insightful argument about the complex emergent behavior of new power projection technologies, the reader is asked to indulge the author temporarily and to stay cognizant of the broader context of what they're reading. This is a thesis about Bitoin - a technology that strikes directly at the heart of topics like power projection and resource control. Pecking order is just another name for a resource control protocol, and it will be useful to develop a conceptually dense understanding of naturally-occuring resource control protocols before entering into a discussion about Bitcoin.\""}, {"text": "3.10.2 Disclaimer #2 - Don't Forget About Survivorship Bias\n\n\"We can use the phenomenon of survivorship bias to our advantage when it comes to gaining insights about different types of heuristics related to survival. <b>If you want to know what pecking order heuristics are best for survival, simply observe nature</b>. Nature has spent the past four billion years seperating the wheat from the chaff and has already figured out the difference between heuristics that survive and heuristics that don't. This is something to keep at the forefront of our minds throughout the remainder of this thesis.\"\n\n\"There is an extremely low probability that we can come up with a non-abstract pecking order heuristic which hasn't been tried many times before over the past several hundred million years by enumerable animal packs whose survivorship depended on finding the most strategically optimal pecking order heuristic. Therefore, if we have a good idea for a pecking order heuristic that we don't see in nature, it's most likely *not* because that heuristic hasn't been tried. It's more likely because that heuristic is demonstrably incapable of surviving, therefore we don't see it in the wild.\""}, {"text": "3.10.3 Disclaimer #3 - Remember that Nature is a Sociopath\n\n\"Things which sapiens consider to be theologically, philosophically, or ideologically repugnant and reprehensible are often routine in nature, For example, suicide, murder, and cannibalism are so common in nature that they're considered to be unremarkable behavior. Aging, for example, is an evolved form of suicide; cells appear to have *learned* the habit of deliberately destroying themselves after a select duration of time as an evolution tactic. Why would nature do something so inefficient and wasteful? Because the world is filled with predators and entropy, which means the environment is constantly changing. Organisms with long lives can't change their genetic features as quickly as organisms with short lives and are therefore less adaptable to their environment, thus less likely to survive.\"\n\n\"The truth is that nature is not nearly as pleasant as what we see on our TV screens. Survival is an ugly business. It always has been, and it probably always will be. This ugly part of nature is less entertaining or inspiring to us, so we don't see it as often. The unfortunate side effect of this behavior at scale is that it distorts our perception of reality and inhibits us from understanding primordial economic dynamics, the survivor's dilemma, and the existential importance of physical power projection.\"\n\n\"For the sake of gaining deeper insight into the potential sociotechnical impack of new technologies like Bitcoin, the reader is invited to recalibrate their understanding of nature. This means allowing ourselves to feel uncomfortable for a short period of time so we can better understand the dynamics of physical power projection and how it relates to security and survivorship. There's a very clear (but ideologically repugnant) reason why lions kill their own cubs. Nature is giving us a lesson about survival, and it could be beneficial for us to pay attention if we want to survive against our predators, too.\""}, {"text": "\"her proof of power is her proof of ownership. That's badass. A snarl resolves the dispute of property ownership over the meat!"}, {"text": "Sometimes, sometimes it escalates to the point of one wolf having their teeth on another pack members throat. But this power competition is necessary from an existential perspective of survival. I'll continue writing more on this tomorrow, almost finished with chapter 3, trying to keep it concise, I've cut out thousands of words already while I think still keeping the thesis well structured."}, {"text": "keep it up man. I'm loving it. Thanks for the summaries !"}, {"text": "3.10.4 Correlation Doesn't Imply Causation, but Randomized A/B Experimentation Does\n\n\"It is possible to prove that changing an animal pack's pecking order strategy (how they choose who to feed and breed) ro reward different behavior than strength and aggression is systemically hazardous. However, that would require the design of a seried of very large, very long, and probably unethical experiments. Fortunately, we don't need to perform these experiments, because we have already done them on other animals for tens of thousands of years. The domestication of animals is incontrovertible proof that changing an animal pack's pecking order strategy to reward different behavior than strength and aggression is systemically hazardous to them.\"\n\n\"From these experiments, sapiens have already created a data set from which it's trivial to causally infer a relationship between security and lack of physical aggression. Over the course of tens of thousands of years, we have created many A/B testing experiments which demonstrate quite clearly whathappens to the safety, security, and survival of animals when they become less inclined to impose severe physical costs on their neighbors.\""}, {"text": "3.10.5 An Honest Description of the Systemic and Sociotechnical Implications of Domestication\n\n\"Changing pecking order heuristics to something other than \"feed and breed the most physically powerful and aggressive members of the pack\" has had an incontrovertible impact on the safety, security, and survival of dozens of animal species. This implies that <b>pecking order strategies - how animals instinctively choose to establish control authority over their resources - fundamentally represents a power projection tactic which directly affects their capacity for survival</b>. The survivor's dilemma (i.e. the strategic imperative to increase Ca) therefore applies to pecking order heuristics just the same as it applies to other power projection tactics. The \"better\" pecking order heuristics are the ones which maximize an animal pack's ability to decrease BCRa by imposing severe, physically prohibitive costs on attackers. In other words, animal packs don't reward their most powerful and aggressive members with feeding and breeding rights because it's the \"right\" thing to do - they do it because all the animals that didn't do it didn't survive.\"\n\n\"Sapiens have shown it's possible to change a wild animal pack's pecking order heuristics by genetically entrapping and enslaving the. If you entrap a herd of aurochs and then feed and breed the muscular and docile ones, you get a herd of oxen. If you entrap a herd of aurochs and then feed and breed the obese and docile ones, you get a herd of cows. If you entrap a litter of boar and then feed and breed the obese and docile ones, you get a litter of pigs. If you entrap a flock of junglefowl and then feed and breed the obese and docile ones, you get a flock of chickens. These activities produce A/B testing experiments where oxen, cows, pigs, and chickens become the treatment, and aurochs, boar, and junglefowl become the control. To measure how removing the physically powerful and aggressive members of an animal pack affects their"}, {"text": "ability to survive against predators, simply take inventory of the difference between the bacon on your plate, and the boars you *aren't* eating. From that data it's possible to infer a causal relationship between docility and survival. Across a wide range of randomized variables, the *docile* animals are the ones we keep encaged to eat or to do our manual labor.\""}, {"text": "3.10.6 To Make it to the Top of the Dominance Hierarchy, Domesticate your Peers\n\n\"Natural selection caused many pack animals to become sexually dimorphic, where one gender is genetically optimized to be physically stronger and more physically aggressive than the other. For some species, the female is genetically optimized to be more powerful. For others. it's the male. Either way, with few exceptions, natural instincts make animals sexually attracted to physically powerful, intelligent, and assertive members of the pack. These instincts ensure the species genetically self-optimizes itself for survival by passing on the genes of the most physically powerful, intelligent, and assertive members.\"\n\n\"To change the \"feed and breed the powerful first\" pecking order heuristic employed by mammalian pack animals, sapiens learned how to neuter the strongest and most physically aggressive males to remove their genes from the gene pool. This tactic is given polite-sounding names like *selective breeding*, but waht it represents from a sociotechnical (and honest) perspective is a way to force an entire species to become less physically powerful and aggressive through genetic modifications, thus less capable of and inclined to impose severe physical costs on their human oppressors. <b>Domestication is therefore a form of predation - a power projection tactic that dramatically reshaped our world and put sapiens at the top of a global interspecies dominance hierarchy.</b>\"\n\n\"A domesticated animal is a wild animal that has had it's Ca unnaturally shrunken, as illustrated in Figure 25. this type of exploitation is possible because many pack animals employ a specialized workforce devoted to the task of being physically powerful and aggressive. By simply identifying that workforce and not allowing them to multiply, it's possible to dramatically reduce an animal pack's overall Ca over time, thus raising BCRa, shrinking their prosperity margin, and making them easier to devour.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"The genetic entrapment and enslavement of animals via domestication is the practice upon which \"civilized\" human society was built in the Neolithic age. This is one of many reasons why modern sapiens should think twice before condemning the physically aggressive behavior of a lion or any other wild animal species that have successfully avoided being domesticated by humans. We have a large enough data set to causally infer that it's precisely *because* these animals are physically aggressive that they have no yet been domesticated.\""}, {"text": "3.10.8 If Domesticating Wild Animals is Predatory Behavior, then so is Domesticating Humans\n\n\"Not only is there a systemic danger of self-domestication, but domestication itself is a form of attack against human society. Remove society's capacity and inclination to impose severe physical costs on other humans, and that will have a direct and measurable effect on their ability to survive and prosper. Human societies therefore have a fiduciary responsibility to not allow themselves to become too self-domesticated. <b>Societies who are interested in survival and prosperity should not allow themselves to become less capable of and inclined to be physically aggressive to potential attackers or oppressors</b>.\"\n\n\"This has significant implications for sapiens who condemn the use of physical power and physical aggression to establish pecking order over resources because of the energy it uses or the injury it causes. Physical power and aggression clearly have a substantial effect on a population's safety, security, survival, and prosperity. Domesticated animals prove a causal link between docility and enslavement. Therefore, <b>we should be cautious of people who encourage docility and condemn physical power as the basis for settling disputes, establishing control authority over resources, or achieving consensus on the legitimate state of ownership or chain of custody of property. It's clearly a security hazard and can also be a deliberate attack vector</b>. This is a critical concept for the reader to understand for discussions in the following two chapters about power projection tactics in both society and cyberspace. This concept is also critical for understanding the sociotechnical implications of Bitcoin.\""}, {"text": "3.10.9 Check Your Power Projection Privilege\n\n\"With very few exceptions, wild pack animals abandon their sick, elderly, and injured. The physically powerful and aggressive members of the pack are rewarded with mating rights and control authority over resources, and physical power is used as the basis for achieving consenus on the legitimate state of ownership and chain of custody of resources. <b>The overwhelming majority of animals adopt physical power-based resource control hierarchies where they settle property disputes using physical power</b>.\"\n\n\"Somehow, different evolutionary paths all converged on practically the same physical power-based resource control and dominance hierarchies. In these systems, power projectors don't wait in line for food or breeding rights; they automatically get first dibs. Instead of being angry at their power projectors for these offenses, many pack animals (including sapiens) are sexually attracted to their power projectors - they instinctively want their most physically fit and powerful to have first dibs on food and mating rights to ensure their genes remain in the population's gene pool. <b>Completely different species seperated by major landmasses all independently converged on the same physical-power-based resource control protocols despite dozens of other perfectly viable options for settling disputes, establishing control authority over resources, and achieving consensus on the legitimate state of ownership and chain of custody of their property</b>. These animals didn't compare notes, but they converged on practically the same \"might is right\" pecking order heuristic.\""}, {"text": "\"Why did this happen? A knee-jerk reaction to this question is to be condescending towards pack animals and label their behavior as savage, as if humans aren't cut from the exact smae cloth. As if the foundation of Neolithic sapiens civilization *wasn't* based on our mastery of this exact same power projection tactic over animals. We hunter competing animal populations to extinction and then entrapped, enslaved, and devoured the survivors to form what we call \"civilized\" society. Sapiens are also instinctively attracted to signs of physical strength, and they constantly celebrate their capacity to project physical power against each other. Humans have no intellectually honest ground on which to stand and accuse animals of being savage, or act like \"might is right\" pecking order heuristics are beneath them. Sapiens use the same physical-power based resource control protocols whether they like to admit it or not.\"\n\n\"The subject of pecking order and resource control is where it becomes important for sapiens to check themselves on their survivorship bias and their privileges as the world's apex predator. We need to remind ourselves that only the best strategies for safety, security, and survival can survive four billion years of entropic chaos. <b>Modern sapiens judge and criticize the behavior of wild animals from behind a safety moat filled with the blood of competitors they drove to extinction. Humans burned and speared and slaughtered their way to the comfort of the armchairs from which they pontificate about \"right\" and \"wrong\" or \"fair\" and \"unfair\" ways to settle disputes, establish control authority over resources, and determine the legitimate state of ownership and chain of custody of property</b>. There is currently not a surviving mammal on this planet more predatory and destructive than humans.\""}, {"text": "3.10.10 Pack Animals Need their Power Projectors to Survive\n\n\"The behavior we see in nature should be regarded with solemn respect, not condescension or sanctimony. Nature offers a free lesson in survival from something that has been around far longer than we have, and it's good to listen to the hard-won wisdom of our elders, no matter how uncomfortable it makes us feel. By virtue of its ubiquity, nature's chosen pecking order strategy of \"feed and breed the power projectors first\" a.k.a. \"might is right\" deserves our reverance because it has been regression tested over thousands of millennia. Physical power-based dominance hierarchies are demonstrably more secure against predation, exploitation, enslavement, and abuse, capable of passing a very unforgiving natural selection process. This means we should take physical power-based resource control protocols seriously and have some intellectual humility before we condemn it. There's a reason why they survive, and we should seek to understand that reason from a systemic and sociotechnical perspective. Moreover, we should recognize that humans are clearly not \"above\" these sorts of physical power projection strategies. If anything, humans are the undisputed masters of them.\""}, {"text": "3.11 Physical Power-Based Resource Control\n\n3.11.2 Why are Physical-Power-Based Dominance Hierarchies so Fit for Survival?\n\n\"The survivor's dilemma indicates that option #3 is the best strategy. This could explain why \"feed and breed the power projectors first\" represents an optimal strategy for managing internal resources, because it ensures the most powerful and aggressive pack members with the most capacity and inclination to systemically secure the pack by imposing severe physical costs on attackers are well-fed and multiplied. This helps the pack maximize its Ca and minimize its BCRa to generate enough prosperity margin to grow resource abundance without substantially increasing the threat of being devoured (or domesticated) by neighboring organisms.\"\n\n\"Organizations which employ \"feed and breed the powerful first\" are more likely to have lower BCRa than organizations which use alternative pecking order heuristics, as illustrated in Figure 26. But when more packs adopt this same pecking order strategy, it drives the environment's hazardous BCRa level down and compels other packs to adopt the same strategy. This makes \"feed and breed the power projectors\" yet another power projection Schelling point which organizations are strategically inclined to adopt, hence its ubiquity in both the wild and in human society. If neighboring animal packs are feeding and breeding their power projectors, then your organization must feed and breed your pack's power projectors too, else risk becoming an attractive target of opportunity.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "3.11.3 Modeling Physical Power-Based Resource Control Protocols\n\n\"Even though Power Projectors have seemingly disproportionate control authority over resources, Members are not without their own form of control authority to provide a counterbalance. Members excercise substantial control over the controlled process by assigning value to the resources. This is a subtle but very important control action which often gets overlooked, that will become important to point out later in a discussion about Bitcoin.\"\n\n\"The need for power projectors to establish consensus on the state of ownership and chain of custody of resources hinges on the assumption that pack members actually value those resources in the first place. If members don't value the resource over which power projectors compete for control authority, then the power projectors' control authority over those resources is practically useless.\"\n\n\"<b>Members therefore have a unique ability to render their power projector's control authority practically useless by simply reovking the value they assign to the resources controlled by power projectors</b>. The reason why this control action is often overlook is because it's rarely excercised by the majority of all species of pack animals. Most resources have existential importance that is virtually impossible for pack members *not* to value. For example, it's not likely that members of any species will stop valuing food, water, oxygen, and other physical resources which are essential for their survival. But the value of some resources is flexible and prone to change. For example, the value of lakefront territory can change rapidly if the Sun dries up the lake. Pack members could care less about their power projectors' control authority over lakefront territory if they don't value it anymore.\"\n\n\"This control action is a major factor for human packs (a.k.a. polities like governments), because sapiens often compete to excercise"}, {"text": "control authority over immaterial resources with abstract value (e.g. money). A pack of sapiens could have the most dominant power projectors in the world, but their control authority over abstract resources like money can be rendered useless if members simply decided to stop valuing that abstract resource. With this subtle control action, we can close the loop and complete our physical power-based resource control model.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "3.12 The Beauty of Antlers\n\n3.12.1 Physical Power Projection is Necessary, but it Clearly has Drawbacks\n\n\"Pack animals spend a great deal of time establishing physical power-based dominance hierarchies to manage their resources, constantly seeking to display to their peers their physical strength and aggression, all to showcase their worthiness for the pack's resources because of their capacity and inclination to impose severe physical costs on attackers. For carnivores, this pecking order communication strategy often looks something like that shown in Figure 30.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"For animal packs which adopt physical power-based resource control protocols, the strongest and most aggressive power projectors are awarded with food and mating rights, perpetuating a virtuous cycle of systemic security that develops and sustains a well-resourced workforce of power projectors who keep the pack's BCRa as low as possible given limited resources. The result of this heuristic is safety, security, and survival in a CCCH environment filled with predators and entropy.\"\n\nAn unfortunate side effect of using physical power as the basis for establishing dominance hierarchies is that it can lead to intraspecies fratricide.\n\n\"Nature mitigates this risk by making pack animals instinctively disinclined to fatally injure each other. For example, when wolves infight to establish their pecking order, it is common for one wolf to successfully pin down their opponent. The dominant wolf will press its teeth against the jugular of the opponent, but it will not bite. For existential reasons, the wolf is instinctively disinclined to kill a fellow member of the pack; it needs every member of the pack to hunt for prey, secure the pack against predators, and to survive and prosper for as long as possible. This explains why many animals do not battle to the death over food and mating rights; they battle to the point where they can discern that one is clearly more powerful and aggressive than the other (thus more fit for survival in a CCCH environment).\"\n\n\"Nevertheless, wolves still end up killing wolves. Humans end up killing other humans, and so on. The simple fact of the matter is that physical power-based resource control protocols are destined to cause lethal injury; it's an unfortunate side effect of a demonstrably necessary protocol for survival and prosperity. We know this becuase the pack animals which survive in the wild are the ones who use this protocol. Is physical injury wasteful?"}, {"text": "It certainly seems to be. But it also seems to be the case that the risk of physical injury is a price that natural selection demands for survival; a price Earth's top survivors are willing to pay.\""}, {"text": "3.12.2 There are Less Harmful Ways to Establish Interspecies Dominance Hierarchies using Physical Power\n\n\"From a primordial economic perspective, antlers are a fascinating evolution. They can impose as much, if not more, severe physical costs on attackers as a wolf's teeth or claws can. A well-grown pair of antlers are no doubt effective at lowering the BCRa of a stag and herd of deer. But antlers aren't simple stabbing devices like rhino or triceratops horns; they have bizarre geometries like those shown in Figure 31.\""}, {"text": "", "imgs": ["images/helpdesk/softwar_051_image0.jpg"]}, {"text": "\"When two pairs of antlers go head-to-head, their entanglement functions as a cushion and creates a safe standoff distance large enough to prevent either side from being severely injured. Thus, the tendency of antlers to entangle is an emergent property of their awkward geometry and a special design feature, not a flaw. <b>The primary value-delivered function of antlers is to empower stags to defend their packs and establish their intraspecies dominance hierarchy using physical power, but to do it in a way that protects the species against fratricide</b>.\"\n\n\"Pack animals must be able to identify their strongest and most physically aggressive members and award them with control authority over the resources they need to lower the pack's BCRa, they they don't have to inflict injury and commit fratricide in the process. Stags prove it's possible for pack animals to survive and prosper by projecting power the way natural selection demands, all while minimizing physical injury. In other words, <b>it's possible to maximize security and safety simultaneously. All it takes is the right kind of bizarre technology, and the right kind of people to recognize the value of the design</b>.\"\n\n\"This concludes the first chapter of Power Projection Theory. In the remaining two chapters, the author will outline why Bitcoin may represent the human equivalent of antlers.\""}, {"text": "<b>Chapter 4: Power Projection Tactics in Human Society</b>\n\n4.1 Introduction\n\n\"Organisms fight and kill each other for their resources. This struggle is real and directly observable. But when evaluating human behavior, there are clear differences between the way sapiens behave and the way other organisms behave, particularly in the way they fight and kill each other for resources. Behaviorally modern sapiens are unique in the animal kingdom in that they fight and kill each other not just for resources, but also for what they choose to believe in. They use their powerful brains to think abstractly, adopt belief systems that other organisms are physiologically incapable of perceiving, and then they physically compete over those belief systems at unrivaled scale.\"\n\n\"Now that we have a foundational understanding about how and why organisms use physical power to settle intraspecies disputes and establish their dominance hierarchies, we can turn our attention to human beings. The remarkable thing to note about modern sapiens is that they strive *not* to use physical power as the basis for settling their disputes and establishing their pecking order. Instead, they use their imaginations to conceive of *abstract* sources of power, and then they *attempt* to use these abstract sources of power to settle their disputes and establish their pecking order. These attempts often don't succeed, hence the continual and inevitable reversions back to warfare.\""}, {"text": "bump"}, {"text": "here is a thread that I just unarchived by posting in it"}]}