{"cat": "Resources", "title": "🥩health", "desc": "CrowdHealth (recommended by Saifedean Ammous) - get the tools you need to afford", "msgs": [{"text": "CrowdHealth (recommended by Saifedean Ammous) - get the tools you need to affordably break free from the insurance system - https://www.joincrowdhealth.com/", "link": "https://www.joincrowdhealth.com/"}, {"text": "<@895376338674921492> I just created this <#1058446760105746583> channel. Let's build it up! Maybe we can invite those two guys you had on your Spaces 🙂"}, {"text": "Podcast on Keto and Insulin Resistance\nhttps://twitter.com/NEEDcreations/status/1572279127037575169?s=20", "link": "https://twitter.com/NEEDcreations/status/1572279127037575169?s=20"}, {"text": "Keto bruh"}, {"text": "Really? I just heard about it from Saife's podcast"}, {"text": "That sh!t is magic"}, {"text": "Best Keto resources?"}, {"text": "If specifically trying to help with insulin resistance, apple cider vinegar is great to drink just before or after eating"}, {"text": "I just YouTube’d it all"}, {"text": "Apple cider vinegar shot every morning in my protein shake"}, {"text": "IDK some filter I guess? but complain about it here <#874333896035139584>"}, {"text": "yeah I agree with this for sure. Especially politicians who claim they like bitcoin. Being a single issue voter is very dangerous...right <@782358286232977438> ?"}, {"text": "Yes, I don’t trust them."}, {"text": "They just want our vote"}, {"text": "The absolute easiest thing to do is stop drinking sugary drinks. Soda, sweet tea, juices. Drink water and be happy and healthy. Drink more water. That's it. It helps with your blood pressure and heart health. End note."}, {"text": "Facts! But let's continue politics discussion here if you want <#964230300349653072>. This channel is for health. Just wanted to ping you cuz of what Semi said"}, {"text": "Better than insurance is preventative care. The BEST tool for prevention of nearly all disease is fasting. But don't expect to be told that when non-consumption leads to fewer corporate profits, government taxes, and disease-care expenses. \n\nI've found the Master Cleanse, lemon juice, cayenne pepper, maple syrup and water to be the easiest way to start. I began doing this for 10-14 days twice a year over 30 years ago. Have not been sick once, never taken prescription or OTC meds, or had any reason to even see a doctor since then.\n\nGood news too is that fasting costs next to nothing, maybe $3/day. Freeing up more resources for daily stacking of sats!"}, {"text": "Let's try less conversation here. More research with links/paragraphs explaining healthy practice. I will be deleting little convos from this channel once all is settled"}, {"text": "Conversations: <#874318808423219283> / <#874333896035139584> or anything under <#874330263096815757>"}, {"text": "wow this is amazing. You can survive on those items only for 10-14 days?? Was it tough your first time??"}, {"text": "Not at all. Was amazingly easy. Just drank plenty of water and made a spicy lemonade drink every couple hours. \n\nI have after all this time learned to level up this practice further too. For the last 5 years I've been \"dry fasting\", consuming nothing but air for 3-5 days. We have been lied to when told that we will die without water for 3 days. I was \"going dry\" for at least 3 days monthly for nearly a year. Not a practice for those new to these disciplines or with very low body fat.  One of the many benefits of this practice is lowering of all inflammation in the body, one of the root causes of aging and all disease. The biggest risk is kidney stones, IF you are mineral deficient to begin with. Good news is that less sleep is needed and the brain functions even better on \"endogenous ketones\" and the water released from our body fat it \"living water\", better than any you get from a tap or a bottle, only coconut water comes close."}, {"text": "Here’s some of my favorite healthy finds and threads:\nhttps://twitter.com/creosote_rain/status/1608563960193875970?", "link": "https://twitter.com/creosote_rain/status/1608563960193875970?", "imgs": ["images/resources/health_0405_health_FlLEOkjagAAo-o6.jpg", "images/resources/health_0406_health_FlLERmqagAAjtSG.jpg"]}, {"text": "Smoke weed everyday."}, {"text": "https://twitter.com/sirbarefoot/status/1605987286763520000?", "link": "https://twitter.com/sirbarefoot/status/1605987286763520000?"}, {"text": "https://youtu.be/BrcfKO1azc8", "link": "https://youtu.be/BrcfKO1azc8"}, {"text": "https://twitter.com/sirbarefoot/status/1586039605387612161?", "link": "https://twitter.com/sirbarefoot/status/1586039605387612161?"}, {"text": "", "imgs": ["images/resources/health_0404_unknown.png"]}, {"text": "https://www.mrmoneymustache.com/2022/09/30/lessons-from-the-badass-muscular-neurobiologist/", "link": "https://www.mrmoneymustache.com/2022/09/30/lessons-from-the-badass-muscular-neurobiologist/"}, {"text": "https://www.mrmoneymustache.com/2013/04/22/curing-your-clown-like-car-habit/", "link": "https://www.mrmoneymustache.com/2013/04/22/curing-your-clown-like-car-habit/"}, {"text": "https://www.mrmoneymustache.com/2018/05/15/a-day-in-the-life-of-my-supposedly-frugal-stomach/", "link": "https://www.mrmoneymustache.com/2018/05/15/a-day-in-the-life-of-my-supposedly-frugal-stomach/"}, {"text": "It’s all about having some amount of self discipline"}, {"text": "Something that helps me with sleep / stress / mood is Valerian Root and Ashwagandha. I haven’t seen many others mention it here. People on other platforms talk about it more often. But it’s an amazing herbal remedy and great alternative to prescription drugs for anxiety, insomnia, depression, etc.  They can also help with blood pressure and blood sugar regulation. Definitely worth looking into"}, {"text": "^"}, {"text": "<@392553943298998302> I know you been struggling with what to eat, variety, and how. \n\nI highly suggest doing something like nutri meals, it’s a meal prep service. It can cost anywhere from 60-100 a week. You get sent prepped meals based on what you’re trying to do, and it will also give you ideas on what you can cook yourself for the future. It may sound like a lot of money but if you do it for 6 months until you get on a routine then just start cooking yourself it can be worth it. There is no better investment than making an investment in yourself and that even out trumps #bitcoin \n\nA lot of people always spend money on there cars, electronics, phones, clothes, etc…. And they all cheap out on food and the grocery store. I never understood it. \n\nhttps://www.nutrimealprep.com/meal-plans", "link": "https://www.nutrimealprep.com/meal-plans", "imgs": ["images/resources/health_0403_health_color_logo_with_background.png"]}, {"text": "https://www.gonutre.com/plans-and-menus/", "link": "https://www.gonutre.com/plans-and-menus/"}, {"text": "Beef maps - Great beef near you\nhttps://maps.beefinitiative.com/", "link": "https://maps.beefinitiative.com/"}, {"text": "Carnivore food pyramid \nhttps://x.com/SBakerMD/status/1805715090466914529?t=X8had1SQGXgwakLXSd8zLA&s=19", "link": "https://x.com/SBakerMD/status/1805715090466914529?t=X8had1SQGXgwakLXSd8zLA&s=19", "imgs": ["images/resources/health_0401_20240625_175736.jpg", "images/resources/health_0402_health_GQ8axI_aQAEQFUd.jpg"]}, {"text": "carnivore diet snacks", "imgs": ["images/resources/health_0400_carnivore_diet_snacks.jpg"]}, {"text": "Bitcoin Runs\nhttps://www.bitcoinruns.org/", "link": "https://www.bitcoinruns.org/", "imgs": ["images/resources/health_0399_health_world-view-21-runs-2060x990.jpeg"]}, {"text": "find seed oil free restaurants - seed oil scouts (app), or https://localfats.com", "link": "https://localfats.com", "imgs": ["images/resources/health_0398_health_localfats-meta.jpg"]}]}