{"cat": "Resources", "title": "🤡common-misconceptions-fud-debunked", "desc": "\"BITCOIN IS TOO COMPLICATED; WHAT IS BITCOIN?\" Bitcoin at a glance, is digit", "msgs": [{"text": "<b>\"BITCOIN IS TOO COMPLICATED; WHAT IS BITCOIN?\"</b>\nBitcoin at a glance, is digital money. However, as you know, this concept is nothing new. We've had digital money for years (think credit cards). Acting as a currency is just Bitcoin's first application. Saying that Bitcoin is just digital money is not enough to explain why it is so fascinating. When it boils down, *Bitcoin is simply a platform of trust without giving anyone control.* It is a the concept of decentralization, true decentralization (see: <#874449322081673217>) applied to the human communication of value in order to exchange goods and services. Money is a language. What Bitcoin enables everyone to do is to be your own banker. Kids born today will probably never have a bank account. Instead, they'll be able to communicate value to each other directly. This is the true purpose of money. \n\nBitcoin is an idea that takes aim at displacing the corrupt legacy monetary system that has existed for all time until now, namely, fiat money (money backed and controlled by a government). From an investor standpoint, Bitcoin is a great way to save and grow your money and protect it from debasement from the government. When your money sits in your bank account, the 1-2% interest you're earning has no chance to outrun the rate of inflation due to endless money printing- your money is being stolen from you no matter how you look at it! Don't let your grandkids make fun of you because you didn't take advantage of this opportunity to own the best asset of all time at a cheap price."}, {"text": "Bitcoin is self-sovereign, verifiable cash. We, the people, the users of Bitcoin, are in control of the bitcoin we own. Satoshi's Bitcoin invention used a branch of mathematics called cryptography and combined many other innovations. What was discovered was something remarkable and revolutionary. Bitcoin is a transparent network with a public and auditable ledger and the users who keep it secure are incentivized to do so. It is just as spectacular, if not more than the discovery of fire, electricity, and the internet. In fact, we can look at Bitcoin as being \"the internet of money.\" *What the internet did to allow an unrestricted free flow of information, Bitcoin is doing for money.* Essentially, bitcoin is to money as what TCP/IP is to the internet...except you can actually own bitcoin! The free flow of value...the free flow of trust, across the world to anyone is what Bitcoin is all about.\n\nBitcoin is the next big thing. It has also become known as a once-in-a-species, \"zero to one\" invention that brings a new idea to life for the first time...something like Gutenburg's printing press or Bell's telephone. Bitcoin is hope of a truly free market that is not overseen by the government. Bitcoin is a microeconomic miracle worker and a macroeconomic wrecking ball. Bitcoin is a movement. Bitcoin is financial freedom. It is ultra-sound money- *Fix the money, fix the world.* I suggest you opt-in if you haven't already.\nHere's a 2 minute video explaining why Bitcoin matters for human rights: \nhttps://www.youtube.com/watch?v=KG0Q05Lnm7s\nIf you are having a hard time navigating this Discord, this resource contains everything you will need as a beginner as well: \nhttps://www.lopp.net/bitcoin-information.html", "link": "https://www.youtube.com/watch?v=KG0Q05Lnm7s"}, {"text": "<b>\"BITCOIN IS A SCAM or A PONZI SCHEME\"</b>\nUnlike most alt coins with flashy, high budget marketing plans, Bitcoin does not make any false promises. Bitcoin, pure and simple, is money, and its monetary policy is as clear as day. Bitcoin is extremely transparent and up front about everything. It is a free, open source project and its code can be fully audited by anyone at anytime. The supply cap is known, the supply issuance is known, and no one can print more Bitcoin. There are no secrets. No one person or group or government or CEO is in charge of Bitcoin. This speaks to Bitcoin's true decentralization. In fact, Bitcoin is the most secure coin on the market, and the competition isn't even in the same league as Bitcoin. \n\nAdditionally, no Bitcoin holder has any more power than any other holder. Someone with $10 million of Bitcoin is no different than someone with $10 of Bitcoin. Everyone follows the same rules. Updates and/or rule changes must go through a deep consensus by members of the network (the users) before a change is implemented. Bitcoin doesn't change often. There have only been 2 small updates in the last 4 years. If you need further clarification on why Bitcoin isn't a scam, you're going to have to see passed some of the scary headlines you have probably read. You're going to have to dig deeper and do your own research. The more you learn, the more you'll realize that Bitcoin is legit.\n\nArticle by Swan Bitcoin - Bitcoin is not a Ponzi Scheme:\nhttps://www.swanbitcoin.com/why-bitcoin-is-not-a-ponzi-scheme-point-by-point/", "link": "https://www.swanbitcoin.com/why-bitcoin-is-not-a-ponzi-scheme-point-by-point/"}, {"text": "<b>\"BITCOIN ISN'T BACKED BY ANYTHING\"</b>\nNeither is fiat USD money anymore (since 1971). Watch: https://youtu.be/D4nmbPtd8IE?t=4260 Further explanation, read: https://unchained-capital.com/blog/bitcoin-is-not-backed-by-nothing/ and see: https://discord.com/channels/874318808423219280/874319558641610802/874959386525696000\nWhat really backs Bitcoin is mathematics and code. The Bitcoin network and its properties are supported online by tens of thousands of participants who verify it and keep it secure 24/7/365. No one needs permission to join the network and contribute. No one person, entity or even group of people are in control of the network. We don't have to trust the backing of a government. We don't have to worry about anyone changing the rules of the game.\n\n<b>\"BITCOIN HAS NO INTRINSIC VALUE or IT CAN'T PHYSICALLY BE HELD SO I DON'T UNDERSTAND WHAT GIVES BITCOIN VALUE/A PRICE\"</b>\nValue is subjective. On intrinsic value, see https://medium.com/coinmonks/bitcoin-has-no-intrinsic-value-and-thats-great-e6994adbfe0f\nPeople give Bitcoin its value. When lots of people buy Bitcoin, the value (and price) goes up, and visa versa- just like any stock on the stock market. Honestly, it's not much more complicated than supply and demand. With bitcoin, nobody alone gets to dictate that there is value to it. Unlike gold, bitcoin cannot be smelted to make jewelry or leafed to cover your gourmet soft serve. But bitcoin's purpose isn't to serve you in any physical way. It's merely a medium of exchange, a store of wealth, and a peer-peer electronic cash that you can store access to in your memory. Rather, the entirety of the Bitcoin network agrees to assign a certain monetary value to bitcoin, depending on its demand (which continues to rise over time). People are slowly starting to understand Bitcoin's inherent value (digital property, store of value, etc) which is why more and more people keep buying it (and holding it) 😀 👍 .", "link": "https://youtu.be/D4nmbPtd8IE?t=4260"}, {"text": "And honestly, that's a benefit over gold. Its value isn't dependent on physical use cases — just purely predictable scarcity.\nCounters to \"no intrinsic value\" claim in the replies: https://twitter.com/SrivatsPrakash/status/1501766188434665473?s=20&t=M_TGbx3SMLx8rggqucvSGg\n\n<b>\"BITCOIN IS A WASTE OF ENERGY or IT HURTS THE ENVIRONMENT\"</b>\nIt's not. Read: On why Bitcoin's energy usage isn't a problem (it's a feature): \nhttps://www.swanbitcoin.com/bitcoins-energy-usage-is-not-a-problem-heres-why-by-lyn-alden/\nThis Machine Greens, presented by Swan Bitcoin, is a documentary that explores Bitcoin’s complex and nuanced relationship with energy. It dispels many of the misconceptions about Bitcoin mining and makes a compelling case for Bitcoin as a net positive for the environment:\nhttps://www.youtube.com/watch?v=b-7dMVcVWgc\nIf you want a shorter video, this one is nice:\nhttps://twitter.com/reason/status/1460712110678229000?s=20\nThis is much more condensed but valuable research:\nhttps://assets.ctfassets.net/2d5q1td6cyxq/5mRjc9X5LTXFFihIlTt7QK/e7bcba47217b60423a01a357e036105e/BCEI_White_Paper.pdf\nIf you need more convincing: \nhttps://bitcoinmagazine.com/business/bitcoin-energy-use-compare-industry\nAlso, see this graphic comparing Bitcoin's energy uses to other industries https://discord.com/channels/874318808423219280/874319602811801670/875409215555006524\nWhy spending energy on Bitcoin is worth it. By Gigi\nhttps://dergigi.com/2018/06/10/bitcoin-s-energy-consumption/\nFor more, read the Energy Concerns section of <#874331239081975929> here: https://discord.com/channels/874318808423219280/874331239081975929/887201384359940157", "link": "https://twitter.com/SrivatsPrakash/status/1501766188434665473?s=20&t=M_TGbx3SMLx8rggqucvSGg"}, {"text": "As a side note, oppresive countries like China and North Korea have either banned or are working to ban Bitcoin. They want to keep full control of their monetary policy and their citizens, and they see Bitcoin as a problem for such a thing (and it is!). China specifically, doesn't want any competition for its own Digital Yuan. Bitcoin presents a big problem for them.\nThread (speculative) on the US government warming up to Bitcoin https://twitter.com/_log_scale_/status/1424083524282241028?s=20\n\n<b>\"BITCOIN IS THE 'MYSPACE' OF CRYPTO, IT IS TOO SLOW and IT IS GOING TO BE BE REPLACED BY SOMETHING BETTER/FASTER\"</b>\nIt's definitely not. See this graphic detailing all the events that led up to Bitcoin (it wasn't the first attempt at a cryptocurrency). Bitcoin is the culmination of 40 years of innovation in cryptography, math, programming and economic research: https://discord.com/channels/874318808423219280/874319602811801670/874328138002337893\nWith the invention of Bitcoin is 2009 came the invention of digital scarcity. Digital scarcity can not be \"reinvented,\" kind of like how no one can reinvent the internet. Bitcoin is a once-in-a-species invention and the way it came to be can not be replicated. Bitcoin had no known founders, no premine, and it started as a collectible, slowly gaining a monetary value over time.  \n\nOn transaction speed, I'll bet you've heard that Bitcoin can only process 7 transactions per second. While this is somewhat accurate for Bitcoin's base layer, it is not true overall for Bitcoin in general. Bitcoin has a second layer, called the Lightning Network, which scales Bitcoin to be able to process many thousands and potentially millions of transactions per second. Read more here: <#874338300721250324>.", "link": "https://twitter.com/_log_scale_/status/1424083524282241028?s=20"}, {"text": "<b>\"BITCOIN IS USED BY CRIMINALS or BITCOIN IS ANONYMOUS SO IT MAKES IT EASIER TO DO ILLEGAL ACTIVITIES</b>\"\nCriminals wear shoes too- should we ban shoes? On anonymity...Bitcoin is not as anonymous as you probably think. It is far less anonymous than cashflows of the fiat system in which millions of dollars change hands by criminals each year without detection. Bitcoin is pseudo anonymous, meaning that the ID of your transactions are behind a your Bitcoin address (a string of 26 to 35 letters and numbers). However, that address can be tracked on the Blockchain! Remember, every single transaction is timestamped in order on the Bitcoin Blockchain. Everything can be traced, and authorities have already demonstrated this by tracking down illicit activities that take place on the Bitcoin Blockchain.\nMore research cancelling this FUD: https://bitcoinmagazine.com/tags/criminal-activity\nTransactions with criminal activity 2.1% (2019), 0.34% (2020): https://www.nasdaq.com/articles/stop-the-bitcoin-fud%3A-criminal-cryptocurrency-transactions-are-falling-2021-01-20\nHow the US government is using blockchain to fight fraud (TED Talk) with federal prosecutor Kathryn Haun on how she helped bring down two other federal investigators and the administrator of The Silk Road back in 2013: https://www.youtube.com/watch?v=507wn9VcSAE&t=11s", "link": "https://bitcoinmagazine.com/tags/criminal-activity"}, {"text": "<b>\"BITCOIN CAN BE HACKED or A HACKER CAN STEAL YOUR BITCOIN\"</b>\nTo hack Bitcoin, the blockchain must be tampered with, and to do this, hackers must execute what is known as a 51% attack. It is very difficult to write new history to the Blockchain because it is so costly to forge it while there are always low costs to validate it. Andreas stated something along the lines of in order to rewrite (and hack) the Bitcoin blockchain, the hackers would have to gain 51% of the mining power for roughly 2 or so weeks and risk billions upon billions of dollars doing so trying to forge the Blockchain. It is a great risk for the hackers because if the number of miners \"hacking\" drops below 51% at any point during the hack, the hack fails and every bad miner just wasted tons of resources for nothing...let alone they didn't earn any real Bitcoin from the mining they would have been doing if they weren't trying to hack fake Bitcoin. To put this into perspective on how hard it would be to get 51% of the mining network on your side: if Google decided to program all their servers and supercomputers to mine Bitcoin, they would only make up less than 1% of the total network"}, {"text": "As far as a hacker being able to steal your Bitcoin...256 bit security that Bitcoin wallets employ is a lot stronger than even imaginable. The chances of guessing someone's wallet address is 24^2048 which is such an astronomically large number it's crazy. Here's a metaphor to imagine the chances of guessing it:\n\nThe chance is about the same as selecting a particular atom in a grain of sand (average of 43 quintillion atoms per grain) on one of the planets (estimated 7.5 quintillion grains of sand on Earth) in one of the 2 trillion galaxies (average of 100 billion stars per galaxy with an average of 1.6 planets per star) in the entire universe (metaphor by Andreas). Soooo nearly impossible. \n\nWatch this video that describes that even if billions and billions of supercomputers guessed for billions of billions of years, it would still be highly unlikely that a guess would be correct: https://www.youtube.com/watch?v=S9JGmA5_unY", "link": "https://www.youtube.com/watch?v=S9JGmA5_unY"}, {"text": "<b>\"BITCOIN IS TOO EXPENSIVE or I'M TOO LATE or I AM LOOKING TO GET RICH QUICK\"</b>\nPlease know that you can purchase a fraction of a bitcoin. You don't need to purchase an entire bitcoin at once! Start with $50, even $10. Anything is better than zero. Then, learn more about Bitcoin in this Discord. I guarantee you that you'll buy more and more as you gain knowledge.\n\nMore on bias surrounding bitcoin's price:\nhttps://bitcoinmagazine.com/culture/bitcoin-price-bias-investing\n\nIn my opinion, it is never too late to invest in bitcoin. The best time to buy bitcoin was 12 years ago; the second best time is NOW. \"Entry bias\" is hard to see past. Everyone gets in at a certain price point, and believe me, all people initially feel bad and hesitate to buy because they think they \"missed out\" on lower prices. This is normal. Over time, you'll find out that you got in when you could, and everything will be fine. The number will keep going up and you'll be in the green eventually.\n\nBefore you consider yourself \"late to the party,\" remember that even though millions of people have gotten in ahead of you, there are still BILLIONS behind you. But even if you consider yourself late, at least you can guarantee that the bitcoin you buy won't lose value over time due to endless printing. Bitcoin is a wonderful savings account. You can't say that about fiat money or alt coins like Ethereum. Also, it's still very early. Estimates show that Bitcoin is only 1-3% adopted so far which is basically like the internet was in 1997...and look at it now! Also, once we get to 100% adoption, there are estimate that show the price of bitcoin could be $100 Million which is 2000x from where it is now at $50K! For more: https://www.bitcoinstimulus.net/post/am-i-too-late-to-bitcoin", "link": "https://bitcoinmagazine.com/culture/bitcoin-price-bias-investing"}, {"text": "Additionally, getting rich quick isn't what Bitcoin is all about...instead, it's about getting wealthy slowly. That's what people don't understand and they get so caught up in becoming an overnight \"crypto\" millionaire because a handful of lucky people made some money off Dogecoin (for example) and bragged about it. The vast majority of crypto traders and those who invest in meme coins lose money...they just don't go online to talk about it after so it's not evident. Bitcoin is different. Bitcoin is a revolutionary monetary policy that will displace the corrupt legacy monetary system, namely, the fiat system. The best feature and easiest to explain feature of Bitcoin is its limited supply of 21M coins. Nothing in terms of currency has ever been like this. Get a piece of the pie cheap while you can.\n\nFinally, \"the price is too high\" argument is called Unit Bias. You don't need to buy an entire bitcoin for $50,000. You can buy small fractions of a bitcoin for $500, $100, $50, even $1 if you really wanted. Just because you see various altcoins at smaller prices, does not make them better buys. Bitcoin has more value than any altcoin, no matter what the price. I promise you that owning 0.02 BTC will be much more valuable for you than owning ten or a hundred thousand of (insert altcoin here)!\n\nThe best way to buy bitcoin is from a service called Swan Bitcoin. Use my referral line where signing up will give you $10 bitcoin for free - <#874338671715835944> \n\nFor more myths debunked, see: https://discord.com/channels/874318808423219280/874319558641610802/874335184286281819", "link": "https://discord.com/channels/874318808423219280/874319558641610802/874335184286281819"}, {"text": "\"<b>BITCOIN IS TOO VOLATILE or I DON'T WANT TO INVEST IN IT</b>\"\nYou're right about the volatility. No one is doubting that. Bitcoin is only 12 years old. The market cap is still very low, compared to gold, for example. The thing about Bitcoin's volatility is that it is due to the true nature of its free market price discovery. The general public together is figuring out what Bitcoin's value is, as the technology is being adopted worldwide. The fact that it can go down 30 percent in a week is okay, because based on it's true value you also know that when it goes up 30% in a week, that that vertical movement is valid. This graphic might ease your nerves https://discord.com/channels/874318808423219280/874319602811801670/915059987695423571.\n\nIt is important to note that over a significant amount of time, Bitcoin is volatile on its way up. No one who has invested money in Bitcoin and held for at least 3 years has lost any money. In fact, the average annual return of a bitcoin investment is 100-200%! Over time, that appreciation rate will drop, but bitcoin should continue to appreciate in denominated USD as the fiat printing will never end and Bitcoin's supply is capped! Don't let your grandkids make fun of you because you didn't take advantage of this opportunity to own the best asset of all time at a cheap price. #bitcoin only. For investing advice, see <#874331424952565850>.", "link": "https://discord.com/channels/874318808423219280/874319602811801670/915059987695423571."}, {"text": "<b>\"THE CRYPTO SPACE IS MORE IMPORTANT THAN BITCOIN or BITCOIN MAXIMALISM HURTS THE CRYPTO SPACE AND THIS IS BAD or BITCOIN DOMINANCE IS DOWN AND IT SHOWS THAT BITCOIN ISN'T AS IMPORTANT AS CRYPTO or THERE IS SO MUCH MONEY FLOWING INTO THE CRYPTO SPACE AND THIS MEANS THAT CRYPTO IS A GOOD THING.\"</b>\nBitcoin is a crypto(currency), but in today's world, you'd be mistaken to compare \"Bitcoin\" to what is referred to as \"crypto.\" There is a very important distinction between the two. Bitcoin is in its own category. Everything else is some form of a false promise or scam. Bitcoin is the only coin that stays true to its claim: Bitcoin is money - a better money than we've ever had before. All these other crypto projects and tokens claim to have distinct and innovative technology, but creating a token for their perceived \"use cases\" is pointless in and of itself. You don't spend \"Walmart coins\" at Walmart. You don't use \"McDonald's tokens\" when you eat at McDonald's. Why do you need \"x token\" for \"x technology innovation\"? For more on the scams that are \"blockchain not Bitcoin,\" \"Decentralized Finance (\"DeFi\"), NFTs, Web3, Ethereum, etc, see <#874608925675237406> and <#876178252325093456>."}, {"text": "Bitcoin dominance is a misleading metric as an index for Bitcoin's true strength. Bitcoin Dominance is the market cap of Bitcoin divided by the market cap of everything else plus bitcoin. The denominator of that fraction actually contains wrapped Bitcoin, all stable coins (essentially dollars), many coins with a high MC/liquidity ratio, and every single other coin and new coin that gets added to the market every day. The fact that pure Bitcoin still retains 40+% of ALL that is quite astounding. The *Real* Bitcoin Dominance Index is 92.50% if you disregard POS shitcoins (incl. ETH). The Real Bitcoin Dominance Index only includes coins using proof-of-work that are attempting to be money. It does not include ICOs or stablecoins. Bitcoin dominance historically has dropped to as low as 29%, but it comes back up when shitcoinery dies down.\n\nThere is so much money is flowing into the crypto space because it is being funded by venture capitalists (VC) aka rich investors looking to make more money. They raise funds and put it into a \"crypto project.\" They get a large portion of the supply (premine) and then open the project to the public, who buy the coin based on false promises, and then the VCs and project founders dump their supply on retail. This is commonly referred to as a \"pump-and-dump.\"\n\n<b>\"BITCOIN WILL BE BANNED BY THE GOVERMENT\"</b>\nIt wont. The United States government is, in fact, slowly embracing Bitcoin. Bitcoin is code that was written by human beings. So essentially, Bitcoin breaks down as an expression of free speech. As we know, the government can't ban or stop free speech. The government went insofar as to recently hire Gary Gensler as the Chairman of the Securities and Exchange Commission (SEC). Gary taught a course on Bitcoin at MIT in 2018, and he is a known devout Satoshi Nakamoto supporter. See his lectures: https://www.youtube.com/watch?v=EH6vE97qIP4&list=PLUl4u3cNGP63UUkfL0onkxF6MYgVa04Fn", "link": "https://www.youtube.com/watch?v=EH6vE97qIP4&list=PLUl4u3cNGP63UUkfL0onkxF6MYgVa04Fn"}, {"text": "Also, here is a 2 minute video explaining why Bitcoin won't be banned in the US https://www.youtube.com/watch?v=EtaStuipVzo\n\n<b>\"TETHER DOESN'T HAVE ADEQUATE RESERVES AND IS ARTIFICALLY PROPPING UP BITCOIN'S PRICE\"</b>\nFirst of all, $USDT supply is mostly driven by arbitragers. The claims that the Tether supply isn't 1:1 with dollars are baseless and pure FUD. However, if Tether was actually found to not have adequate reserves, this would actually be *bullish* for Bitcoin as funds would convert to BTC in mass. This article by Bitcoin Magazine goes over the history of Tether and further debunks the myths behind it https://bitcoinmagazine.com/markets/debunking-misconceptions-from-the-bit-short-inside-cryptos-doomsday-machine.\nThis Stephan Livera podcast with Nik Carter fights the FUD as well https://stephanlivera.com/episode/236/\nAdditionally, here's a video by Dan Held downplaying the FUD https://www.youtube.com/watch?v=37RhfyDVwOU in which he summarizes his article here https://www.theheldreport.com/p/dont-fear-tether?s=r\n\n<b>\"A FIXED MONEY SUPPLY WILL LEAD TO ECONOMIC CATASTRPHE. WE NEED INFLATION.\"</b>\nThis FUD is explored and analyzed in this great thread:\nhttps://twitter.com/john_at_swan/status/1612843297239695361?t=Ea2yTPL_FU7bP1hA9zPUHg&s=19\n\n<b>MORE CRITIQUES, MISCONCEPTIONS AND FUD DEBUNKED</b>\nhttps://endthefud.org/\nhttps://medium.com/@jbourneBTC/debunking-all-the-bitcoin-misinformation-one-by-one-54aaa2a20c4\nhttps://casebitcoin.com/critiques\nhttps://www.lynalden.com/misconceptions-about-bitcoin/\nhttps://bitcoinmagazine.com/tags/fud", "link": "https://www.youtube.com/watch?v=EtaStuipVzo"}, {"text": "Click this link to arrive at the top of this channel to begin your journey https://discord.com/channels/874318808423219280/874954629065109544/874954850968961046", "link": "https://discord.com/channels/874318808423219280/874954629065109544/874954850968961046"}, {"text": "FUD dismantled by Fidelity https://www.fidelitydigitalassets.com/sites/default/files/documents/1110227.1.0%20Fidelity%20Digital%20Assets%20-%20Revisiting%20Persistent%20Bitcoin%20Criticisms%20%2811.02%29.pdf", "link": "https://www.fidelitydigitalassets.com/sites/default/files/documents/1110227.1.0%20Fidelity%20Digital%20Assets%20-%20Revisiting%20Persistent%20Bitcoin%20Criticisms%20%2811.02%29.pdf"}, {"text": "Anti quantum FUD -\nhttps://armantheparman.com/qc/", "link": "https://armantheparman.com/qc/", "imgs": ["images/resources/misconceptions-fud_0568_misconceptions-fud_cropped-crop.png"]}, {"text": "Quantum FUD debunked thread \nhttps://x.com/olvelez007/status/1691116881996914689?t=1jy-oKV0Ig0hdMaTuhHAKA&s=19", "link": "https://x.com/olvelez007/status/1691116881996914689?t=1jy-oKV0Ig0hdMaTuhHAKA&s=19", "imgs": ["images/resources/misconceptions-fud_0567_misconceptions-fud_F3gDW_aWEAAI_iq.jpg"]}, {"text": "What the FUD documentary \nhttps://youtu.be/TUUF2kyFN68?si=yhph1xvzuaHAQDnk", "link": "https://youtu.be/TUUF2kyFN68?si=yhph1xvzuaHAQDnk", "imgs": ["images/resources/misconceptions-fud_0566_misconceptions-fud_maxresdefault.jpg"]}]}