{"cat": "Resources", "title": "🎬movies-tv-documentaries", "desc": "MOVIES THE ANATOMY OF BITCOIN An open-source film, community funded film, taking the viewer on a visual understanding of the mechanisms that make...", "msgs": [{"text": "<b>MOVIES</b>\nTHE ANATOMY OF BITCOIN\nAn open-source film, community funded film, taking the viewer on a visual understanding of the mechanisms that make Bitcoin work.\nhttps://anatomyofbitcoin.com/\n\nBitcoin is Generational Wealth - A Short Film by Matt Hornick and Tomer Strolight \nThis short film is not informational. It was created for Bitcoiners who are fully orange-pilled.\nhttps://www.youtube.com/watch?v=3Rnqst5qCgA\n\nComeback Country on El Salvador transforming from dangerous country to safest in Latin America with Bitcoin.\nhttps://www.comebackcountry.com", "link": "https://anatomyofbitcoin.com/"}, {"text": "movies continued"}, {"text": "<b>TV</b>\nBitcoin Beach: How a town (El Zonte) in El Salvador became a testing ground for bitcoin (CBS 60 minutes)\nhttps://www.cbsnews.com/news/bitcoin-beach-el-salvador-60-minutes-2022-04-10/", "link": "https://www.cbsnews.com/news/bitcoin-beach-el-salvador-60-minutes-2022-04-10/"}, {"text": "TV continued"}, {"text": "<b>DOCUMENTARIES</b>\nThe Great Reset and the Rise of Bitcoin. Shared by \nhere: https://www.thegreatresetfilm.com/\nalso shown here:\nhttps://youtu.be/xw9VshkgxJ4\nA great crash course in modern economics and why bitcoin is absolutely essential if we want to have a shot at financial freedom.\nYouTube\n\nRichard James, the creator of the film Hard Money which digs deep into the corrupted nature of what money has become.\nhttps://www.hardmoneyfilm.com/\n\nList of more documentaries compiled by noderunners\nhttps://noderunners.network/en/documentaries\n\nBanking on Bitcoin | BITCOIN DOCUMENTARY |\nhttps://www.youtube.com/watch?v=ByvbAi924TI", "link": "https://www.thegreatresetfilm.com/"}, {"text": "Documentaries continued"}, {"text": "<b>MOVIES THAT SPEAK TO BITCOIN BUT DON'T ACTUALLY MENTION BITCOIN</b>\n*The Big Short* starring Steve Carell \nThe Big Short, based on a non-fiction book by Michael Lewis, chronicles the real lives and actions of several financial-industry professionals in the mid-2000s—against the backdrop of the rise and then dramatic collapse of the real estate market.\n\n*V for Vendetta* starring Hugo Weaving. V is a masked anarchist who plots to blow up England's Parliament during an authoritarian rule. Takes place in 2027"}, {"text": "Bitcoin is Beautiful | a Short Film by Tomer Strolight\nhttps://www.youtube.com/watch?v=gsuMfKA7wFg", "link": "https://www.youtube.com/watch?v=gsuMfKA7wFg"}, {"text": "Documentaries list \nhttps://onbitcoin.substack.com/p/bitcoin-documentaries", "link": "https://onbitcoin.substack.com/p/bitcoin-documentaries"}, {"text": "Not sure if this is like totally on topic but"}, {"text": "if you think about it, Satoshi Nakamoto is a real-world hero who fits the mad scientist archetype... the autistic exchange of 30,000 lines of C++ cobbled together from his brain, like a Robinson Crusoe scavenging for materials alone to make a finished capital good, per the stories of Austrian Economics"}, {"text": "Just finished most/all of the Steins;Gate anime/movie franchise (have yet to play the games, hear audio drama CDs, or the many spinoff manga, but i digress)"}, {"text": "it's a series that venerates a singular hero/mad scientist archetype very nicely"}, {"text": "and I was thinking about how Satoshi Nakamoto the computer scientist/programmer, who saw a world most people could not, and brought it forward into reality, in this blessed hyperbitcoiniziation steins;gate (nakamoto;gate) timeline *and* vanishes entirely per hal finney, len sassaman, etc. similar candidates no longer alive most likely"}, {"text": "it has a nice similar arc to the steins;gate anime, with things like BSV and BCH timechains of fading garbage representing how the time travel in steins;gate has to avoid the bad/dark timelines and stick to the best timechain (original storyline of BTC Core 21M fixed in stone)... these timelines are called world lines in Steins Gate"}, {"text": "i could probably write (another?) (article idea? satoshi's journal?) comparing Satoshi Nakamoto's heroic arc to various fan favorite fictional protagonists and how Satoshi's heroic sacrifice of remaining unknown and not spending his ~1m coins mined to secure the early network ... reminds me of tomer strolight's \"satoshi's legendary treasure\" article which is also read in the bitcoin reader guy podcast also"}, {"text": "(and Satoshi Nakamoto ~ Hououin Kyouma of Steins;Gate)"}, {"text": "This would be cool to read!"}, {"text": "https://twitter.com/CooliganFields/status/1680922971802664966?t=0MgiMKbE2X_9qLvtULALJw&s=19", "link": "https://twitter.com/CooliganFields/status/1680922971802664966?t=0MgiMKbE2X_9qLvtULALJw&s=19"}, {"text": "https://twitter.com/DzambhalaHODL/status/1685037815644471297", "link": "https://twitter.com/DzambhalaHODL/status/1685037815644471297"}, {"text": "Finally watched Margin Call"}, {"text": "Now, in addition to having watched The Big Short last year, I have a newfound appreciation for the meaning of being an early short to the FRN... send it to 0 sats with haste"}, {"text": "How's it compare to The Big Short? I've never seen it"}, {"text": "Margin Call is very underwhelming compared to The Big Short IMO. It's like a 15 minute story made into a movie...kinda drags. The Big Short is one of my top 10 favorite movies now. I've watched it 5 or so times since becoming a Bitcoiner and love it more each time."}, {"text": "Speaking of movies...semi related to bitcoin....ARRIVAL is on Netflix and is probably my favorite movie of all time. If you watch it and want to discuss...please let me know."}, {"text": "Interesting, I've seen Arrival.. what parallels do you draw from it to Bitcoin?"}, {"text": "https://twitter.com/NEEDcreations/status/1698489037235855392?s=20", "link": "https://twitter.com/NEEDcreations/status/1698489037235855392?s=20"}, {"text": "That's an interesting idea, I'm gonna watch it again."}, {"text": "yeah I'm referring to a small part towards the end that you may not remember if you've only seen it once/awhile ago"}, {"text": "\"one of twelve\" might bring it back for you. if not, just look out for that idea when you watch again"}, {"text": "Gonna rewatch it in just a moment, will come back with my thoughts."}, {"text": "TBS is about being a true to life depiction of specific people. MC is an averaged-out idealized generic company that exhibits traits and events of many firms"}, {"text": "Margin call also shows the sadness and emptiness of a life devoted to money alone... Like think of your partner or kids or pets and how they also matter... You don't actually want to envy the people with the most fiat bc they're heartless people to even be able to control and gain that much"}, {"text": "So Margin Call is a bigger gut punch when you realize they're not playing specific individuals but as archetypes of the generic man or woman at different levels of hierarchy e.g. 250k salary, 2.5 million salary, billionaire"}, {"text": "The dutiful, diligent woman who does her part and is ignored by the reckless men... The ex wife of the guy who valued money and his job over their relationship"}, {"text": "that's a great description"}, {"text": "Nice to see the Barbies of Margin Call in addition to the Kens"}, {"text": "The women playing the lesser financial role in Margin Call but retaining their humanity, integrity, and values reminds me of my own career decisions to place authenticity above material gain"}, {"text": "Both Margin Call and Big Short remind me it's great to be long Bitcoin and short fiat (no leverage against Bitcoin) to sleep well at night"}, {"text": "the first thing I notice about Arrival is that it's produced by 21 laps entertainment.... probably nothing but that's quite the coincidence."}, {"text": "!! That's epic. Didn't realize that myself"}, {"text": "I was actually debating between margin call or arrival this evening and couldn't remember who told me arrival was a Bitcoiner movie in spirit but now I know it was you"}, {"text": "About half way through.. Ive seen this movie twice and it gets better each time.\n\nAt the part where they are talking about how they are offering a \"weapon\"... through the framework of softwar, Bitcoin is a non-lethal weapons technology. A non-lethal physical power competition.\n\nAlso when they say China and Russia have gone dark and shows the monitor with the countries, it says Siberia, not Russia. Siberia is where Russia mines a lot of its Bitcoin because of the abundant energy and ambiently cool temperatures."}, {"text": "Lowery describes how although Bitcoin is a physical power competition, humanity also is simultaneously cooperating to mutually benefit all members of the network by increasing security and freedom of information flow across cyberspace. Enemies become frenemies, adversarial nations become de facto collaborators. \n\nA non-zero sum game where the entire organization becomes more prosperous."}, {"text": "\"Weapon opens time\" is a refferance to how Bitcoin can lower our entire species time preference."}, {"text": "So although Bitcoin doesn't alter our perception of time like the heptapods language does to Louise, the cultural adoption of Bitcoin will cause a cognitive change in the way our species perceives time at a neural architectural level.\n\nSimilar to how mastering fire caused cognitive change in earlier homo genus ancestors."}, {"text": "Amazing movie. Definitely a Bitcoin movie."}, {"text": "Almost makes me feel like Satoshi was some kind of extra terrestrial superintelligent AGI drone that just incepted this gift into our species minds."}, {"text": "Any other movies with bitcoin themes?"}, {"text": "My friend developed a list of 21 movies he thought embodied a Bitcoin ethos", "imgs": ["images/resources/movies-tv_0575_20230905_093856.jpg"]}, {"text": "I'm guessing those are 21 laps like centuries, a la 20th century Fox"}, {"text": "That was my third time watching it and I'm blown away by the similarities to Bitcoin, especially after reading softwar."}, {"text": "I'm gonna watch brave new world next since I loved the book, then I'll check out current wars, thanks for the suggestions"}, {"text": "Try and imagine what Bitcoin can do when watching movies about money: https://www.topaccountingdegrees.org/movies-about-money-and-finance/", "link": "https://www.topaccountingdegrees.org/movies-about-money-and-finance/", "imgs": ["images/resources/movies-tv_0574_movies-tv_Unknown.jpeg"]}, {"text": "V for Vendetta 100% if you haven't seen that"}, {"text": "Yeah I've seen it 👍"}, {"text": "Also on time, Bitcoin keeps its own time. Starting with the Genesis block, each block is mined every 10 minutes. It's pretty cool that bitcoin has its own system for time"}, {"text": "I recommend reading the comic book above watching the film"}, {"text": "This raises an interesting question"}, {"text": "Yup, bitcoin doesn't need an atomic clock per se. Correct me if i'm wrong but, doesn't the network consensus the timestamp too? So even if it was off by real world standards, the network would still work regardless?"}, {"text": "As soon as a block is found it is immediately timestamped on Unix time and propagated to the nodes."}, {"text": "That's according to the miner/node that found the block right"}, {"text": "Every interaction on the network is done through nodes."}, {"text": "Time is relative, block height is standard"}, {"text": "Does anyone else remember Ritchie Rich's Christmas Wish movie? Millennial childhood classic. Basically the Christmas classic It's A Wonderful Life repackaged for 90s kids. Rewatched it tonight and now dwelling on how it's important to be a person whose impact on the world is a good one..."}, {"text": "Magic Money: The Bitcoin Revolution\nhttps://www.youtube.com/watch?v=2TNhojuAxMI", "link": "https://www.youtube.com/watch?v=2TNhojuAxMI", "imgs": ["images/resources/movies-tv_0572_movies-tv_maxresdefault.jpg"]}, {"text": "Cypherpunks Write Code documentary \nhttps://youtu.be/9vM0oIEhMag?si=tFy6kfYIJ_P7p1v5", "link": "https://youtu.be/9vM0oIEhMag?si=tFy6kfYIJ_P7p1v5"}, {"text": "2015 one of the first documentaries on Bitcoin\nhttps://youtu.be/_0axyH2X6mI?si=bPUOJEYhnxxD1cFa", "link": "https://youtu.be/_0axyH2X6mI?si=bPUOJEYhnxxD1cFa", "imgs": ["images/resources/movies-tv_0571_movies-tv_sddefault.jpg"]}, {"text": "2015 Teen Titan episode about \"Bee money\" summarizing Bitcoin \nhttps://youtu.be/V-TeANzcKAA?feature=shared", "link": "https://youtu.be/V-TeANzcKAA?feature=shared"}, {"text": "Documentaries list https://noderunners.network/en/documentaries", "link": "https://noderunners.network/en/documentaries", "imgs": ["images/resources/movies-tv_0569_movies-tv_noderunners.png"]}]}