{"cat": "Resources", "title": "💜nostr", "desc": "What is nostr?  Nostr is a decentralized social media protocol where no one ", "msgs": [{"text": "<b>What is nostr?</b>\n\nNostr is a decentralized social media protocol where no one controls the content. Your identity is uncensorable which makes it unique from typical social media platforms. There are many clients that have been built, and the user can choose to use whichever client(s) fit his/her needs. Your \"profile\" (in which you log in with a string of characters called your nsec - like a password) is integrated into whichever client you use or move to (although there will be slight variations of how things are displayed from client to client. Some features may be missing, etc.). Your public profile can be identified from your npub, and can be made even more identifiable by use of a NIP-05 identifier. More on all of these weird words below. A really cool thing about nostr is that Bitcoin Lightning is fully integrated. Just add a lightning address to your profile and BOOM, people can \"zap\" you sats for your content."}, {"text": "List of clients and what they're like:"}, {"text": "Resources:\n\nLearn more about all things nostr\nhttps://nostr-resources.com/\n\nMedia uploader\nhttps://nostr.build/\n\nGet emojis and find lists\nhttps://nostrudel.ninja/\n\nCreate and manage links and other notes \nhttps://nostree.me\n\nRequest features, earn sats for bounties \nhttps://nostrbounties.com/\n\nSetting up a relay for beginners\nhttps://github.com/UTXOnly/nost-py", "link": "https://nostr-resources.com/", "imgs": ["images/resources/nostr_0658_nostr_cover.png", "images/resources/nostr_0659_nostr_35a3489682170c6797e36559088b7622900b541bfd5a627d8e3fee841675f5da.png", "images/resources/nostr_0660_nostr_nostr.build_8ed2bdd79901d93c709cf81f2718c11cd5f06c286831f871d024ec05c0c93d.jpg"]}, {"text": "Fun facts:\nJack Dorsey, the founder of Twitter, donated 14 BTC in 2022 to nostr devs."}, {"text": "Reserved spot for resources"}, {"text": "Reserved spot for resources"}, {"text": "What client do you guys prefer on nostr? I'm liking Amethyst on android and Primal on desktop, although there are features I like that are missing from both"}]}