{"cat":"Resources","title":"🛑one-stop-shop","desc":"*This channel has been limited to contain the best of the best resources to convince you of Bitcoin's true value as fast as possible. Digesting all...","msgs":[{"text":"*This channel has been limited to contain the best of the best resources to convince you of Bitcoin's true value as fast as possible. Digesting all of this material should only take about 3-5 hours. If you don't spend at least this amount of time researching Bitcoin, then you will not truly begin to understand its potential.*\n\n🟠 The good news is, if you spend at least 15 minutes in this channel, you will know more about Bitcoin than 99% of the population!"},{"text":"<b>WHAT IS BITCOIN?</b>\nI love this video as an introduction to Bitcoin. It'll get you started down the rabbit hole...\nhttps://www.youtube.com/watch?v=-PsbNprqTgI\nBrand new to Bitcoin? This 2 minute video does a fabulous job hitting most of the major points behind Bitcoin:\nhttps://youtu.be/bRtFCXkNpWI\nThis 1.5 minute video gets into some other details such as Bitcoin mining:\nhttps://www.youtube.com/watch?v=Gc2en3nHxA4\nThis site explains Bitcoin in an easy to follow format:\nhttps://www.lopp.net/bitcoin-information/bitcoin-explained.html\nThis article dives into some major ideas:\nhttps://www.swanbitcoin.com/what-is-bitcoin/\n\nHere is the Bitcoin whitepaper (only 8 pages) which is the abstract and brief dive into the technicalities behind Bitcoin. It was released by Satoshi in late 2008. I do recommend at least skimming through it. Most of it is very easy to understand!\nhttps://bitcoin.org/bitcoin.pdf","link":"https://www.youtube.com/watch?v=-PsbNprqTgI"},{"text":"<b>THE PROBLEM WITH TODAY'S MONEY</b>\nThis graph shows that the value of the US dollar is declining rapidly over time. The dollar has lost 96% of its purchasing power since 1913--this is shocking, right?! The same thing is happening in most countries, and some, like Venezuela, Turkey and Nigeria, are way worse off than the US. This doesn't mean that the US is economically safe forever. The latest CPI inflation number reported is 8.6% which means that half of your wealth disappears in 9 years! This is due to the irresponsible money printing by the Federal Reserve.\n\nThis is why it is important to save in a deflationary asset that won't be infinitely printed and lose its value--an asset like Bitcoin. \n\nIf you leave your savings in say, a traditional bank, the ~1% interest you'll earn will not keep up with the rate of inflation. Your savings will be automatically stolen from you if you don't do something about it! Simply buy Bitcoin which can act as a real saving account that will even gain you money over time (close to 100% per year). The easiest way to start buying Bitcoin is to sign up with my *Swan* referral link here: https://discord.com/channels/874318808423219280/874338671715835944/874339278753243146. If you have any questions, please don't hesitate to dm me <@392553943298998302>. You got this!","link":"https://discord.com/channels/874318808423219280/874338671715835944/874339278753243146.","imgs":["images/resources/one-stop-shop_0665_purchasing_power_of_US_dollar.jpg"]},{"text":"<b>QUICK HITTERS ON BITCOIN'S TRUE VALUE</b>\nEach one of these animated videos is short and does a *fabulous* job explaining Bitcoin's value:\nhttps://www.youtube.com/c/IoniAppelberg/videos\n\n<b>WHY DOES BITCOIN MATTER?</b>\nThis video is 37 minutes long but definitely worth it as it is super inspiring. It orange-pilled me! After I watched this video, I immediately smash bought a bunch more Bitcoin. I'm happy I did! Andreas is a wonderful lecturer and he speaks about what Bitcoin really is and how it will change the world. This talk is from 2016. Enjoy:\nhttps://youtu.be/l1si5ZWLgy0\n\nThis video is only 14 minutes long and is similar in value to the one above:\nhttps://www.youtube.com/watch?v=IAFKJVLNVQA","link":"https://www.youtube.com/c/IoniAppelberg/videos"},{"text":"<b>WHY BITCOIN? (26 short reads 2-4 minutes each)</b>\nBitcoin is a vast subject, with countless facets, angles and perspectives. It can be looked at, thought about and appreciated in many ways. Here is Tomer Strolight's take:\nhttps://drive.google.com/file/d/1xJkyEXMj27JH2d6VgyPiPMxcAdcWtxwM/view?usp=sharing\n\n<b>21 LESSONS ABOUT BITCOIN (2-3 minutes each)</b>\nEach of Gigi's \"21 lessons\" contains wonderful information that can help you really understand Bitcoin's value. The lessons can be read or even listened to (there is an audio play button at the top of each page). It also includes copious amounts of additional resources at the bottom of each page that branch off from each lesson. You should really take some time to digest each lesson. Go through one a day if that works best for you. Each one represents a wealth of information. Enjoy:\nhttps://21lessons.com/preface","link":"https://drive.google.com/file/d/1xJkyEXMj27JH2d6VgyPiPMxcAdcWtxwM/view?usp=sharing"},{"text":"<b>BITCOIN WILL BECOME MAINSTREAM GRADUALLY, THEN SUDDENLY</b>\n\"Gradually, Then Suddenly\" is an outstanding writeup by Parker Lewis detailing about what Bitcoin isn't, what it is, and where it is headed. It contains 16 statements about Bitcoin with details explaining further as you click each link. Again, this is extremely valuable information which is why it is in this channel.\nhttps://nakamotoinstitute.org/mempool/series/gradually-then-suddenly/","link":"https://nakamotoinstitute.org/mempool/series/gradually-then-suddenly/"},{"text":"<b>HOW BITCOIN REALLY WORKS in 5 minutes</b>\nThis get a bit more into the technical side of Bitcoin.\nhttps://www.swanbitcoin.com/5-minute-reads-how-bitcoin-really-works/?s=09\n\n<b>WHY BITCOIN MATTERS FOR HUMAN RIGHTS</b>\nThis 2 minute video by Alex Gladstein details on why Bitcoin matters for human rights. Bitcoin is changing the world for the better:\nhttps://www.youtube.com/watch?v=KG0Q05Lnm7s","link":"https://www.swanbitcoin.com/5-minute-reads-how-bitcoin-really-works/?s=09"},{"text":"<b>BULLISH ON PRICE</b>\nThe Bullish Case for Bitcoin: https://vijayboyapati.medium.com/the-bullish-case-for-bitcoin-6ecc8bdecc1\n\nThe Case for $500k Bitcoin:\nhttps://winklevosscapital.com/the-case-for-500k-bitcoin/\n\nThat's it! Now feel free to take a deeper dive into any of our other educational channels like <#874449322081673217> to further your knowledge 😀\n\nIf this Discord is overwhelming or you just don't like the way it's set up, here is the most trusted guide you'll need to learn more about Bitcoin:\nhttps://www.lopp.net/bitcoin-information.html","link":"https://vijayboyapati.medium.com/the-bullish-case-for-bitcoin-6ecc8bdecc1"},{"text":"If you like concise pamphlets:","imgs":["images/resources/one-stop-shop_0663_intro_guide_1.jpg","images/resources/one-stop-shop_0664_intro_guide_2.jpg"]},{"text":"<b>CONTINUE LEARNING</b>\nThe first thing I would do now if I were you is head over to the Bitcoin Properties Layer 1 category on this Discord beginning with <#874449322081673217> . Read all of it. \n\n#1 Book - \"The Bitcoin Standard\" is a must read for all Bitcoiners. It goes through the history of money throughout mankind, the process of qualitative easing and debasement, and Bitcoin's solution to these problems. \nFree PDF: https://t.co/BEfe27oxor\nPurchase: https://amzn.to/3mx4PCu\n\n\"Inventing Bitcoin\" is another great book on all the details of Bitcoin\nFree including audio option:\nhttp://Swan.com/freebook\n\nLive learning on Twitter Spaces with <@895376338674921492> (and often other members of Satoshi's Journal including myself). Live Monday, Thursday, and Saturday nights 8-11pm EST. The Space is recorded on Thursday when we interview special guests. https://twitter.com/DjSaToShi18\n\nGreat podcast for education and news - What Bitcoin Did:\nhttps://www.youtube.com/c/WhatBitcoinDidPodcast\n\nFinally, for a bit of fun and inspiration...I'll leave you with this (fan of the Matrix?)\nhttps://twitter.com/BTCGandalf/status/1494431738084442115","link":"https://t.co/BEfe27oxor"},{"text":"Bitcoin for Beginners (with visual notes) by https://twitter.com/studentofbtc\nhttps://app.gumroad.com/read/d0e90f08ae48a6039b2d868f550db2af/i-7y6Tj4t8vZTuBIHA4fkQ==\n\nWhy does Bitcoin have value?\nhttps://x.com/River/status/1819384913344262654?t=4Z3a8DgIm7ut_G_R-9rFiA&s=19\n\nIf the above didn't resonate with you, here's a well put together 10 hour guide through Bitcoin - 10 Hours of Bitcoin. \"The fastest path to understanding Bitcoin.\" by @JWWeatherman_\nhttps://10hoursofbitcoin.com/","link":"https://twitter.com/studentofbtc"},{"text":"*This channel has been limited to contain the best of the best resources to convince you of Bitcoin's true value as fast as possible. Digesting all of this material should only take about 3-5 hours. If you don't spend at least this amount of time researching Bitcoin, then you will not truly begin to understand its potential.*"}]}